<p>POL&Iacute;TICA DE PRIVACIDAD</p>
<p>&nbsp;</p>
<p>Actualizaci&oacute;n.</p>
<p>&nbsp;</p>
<p>Nuestra Pol&iacute;tica de Privacidad se ha actualizado el1 de Nov 2017. Hemos modificado la Pol&iacute;tica de Privacidad de principio a fin, de modo que, a partir de esa fecha, incluya informaci&oacute;n detallada sobre c&oacute;mo administramos su informaci&oacute;n personal para los productos y servicios de Mi Home Security Camera.</p>
<p>&nbsp;</p>
<p>T&oacute;mese unos minutos para familiarizarse con nuestros procedimientos de privacidad y, si tiene alguna duda, p&oacute;ngase en contacto con nosotros.</p>
<p>&nbsp;</p>
<p>NUESTRO COMPROMISO CON USTED</p>
<p>&nbsp;</p>
<p>La presente Pol&iacute;tica de Privacidad establece c&oacute;mo Zimi corporation Inc. y sus filiales dentro del Grupo Zimi corporation ("ZM", "nosotros", "nuestro" o "nos") recopilamos, utilizamos, revelamos, procesamos y protegemos la informaci&oacute;n que nos proporciona al utilizar los productos y servicios de Mi Home Security Camera . Si le solicitamos alguna informaci&oacute;n que permita identificarle al usar los productos y servicios de Mi Home Security Camera , solo la usaremos de conformidad con la presente Pol&iacute;tica de Privacidad y nuestros t&eacute;rminos y condiciones para usuarios.</p>
<p>&nbsp;</p>
<p>La Pol&iacute;tica de Privacidad se ha redactado con los usuarios en mente. Es importante que conozca a fondo nuestras pr&aacute;cticas de recopilaci&oacute;n y uso de informaci&oacute;n personal, as&iacute; como que tenga la seguridad absoluta de que tiene el control de cualquier dato personal que proporcione a ZM.</p>
<p>&nbsp;</p>
<p>En la presente Pol&iacute;tica de Privacidad, &laquo;informaci&oacute;n personal&raquo; hace referencia a la informaci&oacute;n que se pueda usar para identificarle como persona, ya sea a partir de dicha informaci&oacute;n exclusivamente o combinada con otros datos a los que ZM tenga acceso sobre usted. Puede que en dicha informaci&oacute;n personal se incluya su nombre, direcci&oacute;n, n&uacute;mero de tel&eacute;fono y direcci&oacute;n de correo electr&oacute;nico.</p>
<p>&nbsp;</p>
<p>Si usa los productos y servicios de Mi Home Security Camera , se entender&aacute; que ha le&iacute;do y acepta todas las disposiciones que se estipulan en la Pol&iacute;tica de Privacidad, incluidas las modificaciones que hagamos puntualmente. Nos comprometemos a proteger la privacidad, confidencialidad y seguridad de su informaci&oacute;n personal mediante el cumplimiento de la legislaci&oacute;n vigente, incluida la legislaci&oacute;n local sobre protecci&oacute;n de datos. Tambi&eacute;n nos comprometemos a garantizar que todos nuestros empleados y agentes respeten estas obligaciones.</p>
<p>&nbsp;</p>
<p>En definitiva, lo que queremos es lo mejor para todos nuestros usuarios. Si tiene alguna duda relativa a nuestras pr&aacute;cticas de tratamiento de datos, que describimos en la presente Pol&iacute;tica de Privacidad, p&oacute;ngase en contacto con nuestro responsable de protecci&oacute;n de datos en la direcci&oacute;n zmi_privacy@zimiker.com para abordar sus preocupaciones espec&iacute;ficas. Estaremos encantados de resolverlas directamente.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&iquest;QU&Eacute; INFORMACI&Oacute;N SE RECOPILA Y C&Oacute;MO LA USAMOS?</p>
<p>&nbsp;</p>
<p>TIPOS DE INFORMACI&Oacute;N RECOPILADA</p>
<p>&nbsp;</p>
<p>Para prestarle nuestros servicios, le pediremos que nos facilite informaci&oacute;n personal necesaria para prestarle esos servicios. Si no facilita su informaci&oacute;n personal, es posible que no podamos proporcionarle nuestros productos ni prestarle nuestros servicios.</p>
<p>&nbsp;</p>
<p>Podemos recopilar los siguientes tipos de informaci&oacute;n (que puede ser informaci&oacute;n personal o no):</p>
<p>&nbsp;</p>
<p><strong>Datos relacionados con el dispositivo: </strong>datos relacionados con el hardware, el rendimiento, el estado de su dispositivo, etc. P. ej.: versi&oacute;n del sistema, informaci&oacute;n del fabricante del dispositivo, nombre del modelo, n&uacute;mero de identificaci&oacute;n del dispositivo y la placa base, uso de la CPU<a href="http://www.baidu.com/link?url=CIIdEw9qLNBCvOLBr54F8RQR80b3ZV9ELZvwCR7N-F0XeEiBnTFFDV1NSPeHtcQ9I07aVQoNYpWt5B-baph2SIlC54_SJOEGz5EMEhOoiNO&amp;wd=&amp;eqid=dc2f5476000023ef0000000559bf8d7a">heartbeat</a> y datos del mismo tipo.</p>
<p><strong>Informaci</strong><strong>&oacute;</strong><strong>n de red: </strong>WIFI SSID,RSSI,IP, etc.</p>
<p><strong>Datos relacionados con el usuario especificados por nosotros</strong>: &nbsp;podemos recopilar y usar su n&uacute;mero de cuenta y otros datos de xiaomi.</p>
<p><strong>V&iacute;deo almacenado en la memoria intermedia: : </strong>si tiene activada la configuraci&oacute;n de "alarma de v&iacute;deo en la nube", se cargar&aacute; al servidor un v&iacute;deo de unos 10 segundos, los usuarios podr&aacute;n ver el v&iacute;deo a trav&eacute;s del m&oacute;vil, el v&iacute;deo se mantendr&aacute; durante 7 d&iacute;as en el servidor.</p>
<p><strong>V&iacute;deo de visualizaci&oacute;n remota: : </strong>cuando los usuarios ven el v&iacute;deo en tiempo real o lo reproducen a trav&eacute;s del m&oacute;vil, la retransmisi&oacute;n del v&iacute;deo se codificar&aacute; y se realizar&aacute; a trav&eacute;s del servidor, pero no se guardar&aacute; en &eacute;l.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>USO DE LA INFORMACI&Oacute;N PERSONAL</p>
<p>&nbsp;</p>
<p>La informaci&oacute;n personal se recopila para prestarle servicios o proporcionarle productos, adem&aacute;s de garantizar el cumplimiento legal por nuestra parte seg&uacute;n la legislaci&oacute;n vigente. Por el presente acto, da su consentimiento para que podamos procesar y revelar informaci&oacute;n personal a nuestras empresas filiales (que se encuentran en el &aacute;mbito de las comunicaciones, las redes sociales, la tecnolog&iacute;a y la nube) y los proveedores de servicios externos (definidos m&aacute;s adelante) para los fines indicados en esta Pol&iacute;tica de privacidad.</p>
<p>&nbsp;</p>
<p>Podemos usar su informaci&oacute;n personal con los siguientes fines:</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<ul>
    <li>Comunicarnos con usted por alg&uacute;n motivo relacionado con su dispositivo, el servicio o cualquier consulta general como actualizaciones, atenci&oacute;n de ayuda al cliente, informaci&oacute;n relacionada con nuestros eventos o notificaciones.</li>
    <li>Analizar y desarrollar informaci&oacute;n estad&iacute;stica sobre el uso de nuestros productos y servicios, para mejorarlos.</li>
</ul>
<p>&nbsp;</p>
<p>A continuaci&oacute;n, se incluye informaci&oacute;n detallada sobre c&oacute;mo usamos sus datos (que pueden contener informaci&oacute;n personal).</p>
<p>&nbsp;</p>
<ul>
    <li>Podemos utilizar el v&iacute;deo almacenado en la memoria intermedia en la nube para ofrecer funciones de alarma y detecci&oacute;n de movimiento a nuestros usuarios.</li>
    <li>Podemos usar los v&iacute;deos de visi&oacute;n remota para ofrecerle funciones de v&iacute;deo a distancia en tiempo real o de reproducci&oacute;n de v&iacute;</li>
    <li>Podemos usar los datos relativos al dispositivo para contabilizar la cantidad de dispositivos activados y que est&aacute;n en l&iacute;nea , analizar la distribuci&oacute;n de la versi&oacute;n de firmware &nbsp;para &nbsp;consultar el estado de funcionamiento de un dispositivo en particular y &nbsp;asegurarnos de que el acceso a su dispositivo est&aacute; autorizado y protegido.</li>
    <li>Podemos utilizar la informaci&oacute;n de red para analizar el estado de red de los dispositivos y as&iacute; poder ayudarle a resolver problemas de uso. Tambi&eacute;n podemos utilizar informaci&oacute;n de IP solo para realizar una distribuci&oacute;n geogr&aacute;fica y estad&iacute;stica aproximada de los dispositivos en l&iacute;nea. En ning&uacute;n caso se divulgar&aacute; otra informaci&oacute;n sobre usted, como la informaci&oacute;n geogr&aacute;fica.</li>
    <li>Podemos usar el n&uacute;mero de cuenta de Xiaomi para consultar qu&eacute; dispositivos est&aacute;n vinculados a dicha cuenta para asegurar que el acceso al dispositivo est&aacute; autorizado.</li>
</ul>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&iquest;CON QUI&Eacute;N COMPARTIMOS SU INFORMACI&Oacute;N?</p>
<p>&nbsp;</p>
<p>No vendemos ninguna informaci&oacute;n personal a terceros.</p>
<p>&nbsp;</p>
<p>Puede que en ocasiones revelemos su informaci&oacute;n personal a terceros (como se describe a continuaci&oacute;n) para ofrecer los productos o servicios solicitados.</p>
<p>&nbsp;</p>
<p>La revelaci&oacute;n puede hacerse a los proveedores de servicios externos y las empresas filiales que aparecen en la secci&oacute;n siguiente. En cada uno de los casos descritos en esta secci&oacute;n, ZM le garantiza que solo compartir&aacute; su informaci&oacute;n personal con su consentimiento. Cuando ZM comparta su informaci&oacute;n personal con un Proveedor de servicios, en cualquiera de los casos descritos en esta secci&oacute;n, ZM especificar&aacute; contractualmente que dicho tercero queda sujeto a las pr&aacute;cticas y obligaciones que exijan las leyes de protecci&oacute;n de datos locales. ZM garantizar&aacute; mediante contrato el cumplimiento de las normas de privacidad aplicables en la jurisdicci&oacute;n del Usuario por parte de cualquier Proveedor de servicios.</p>
<p>&nbsp;</p>
<p>COMPARTIR CON NUESTRO GRUPO Y LOS PROVEEDORES DE SERVICIOS EXTERNOS</p>
<p>&nbsp;</p>
<p>Con el fin de facilitar nuestra actividad empresarial a la hora de brindarle nuestros productos y servicios completos, ocasionalmente podemos revelar sus datos personales a otras empresas afiliadas de ZM (sectores de comunicaciones, redes sociales, tecnolog&iacute;a o negocios en la nube) o a nuestros Proveedores de servicios, que son empresas de reparto de correspondencia, proveedores de servicios de mensajer&iacute;a, empresas de telecomunicaciones, centros de datos, centros de almacenamiento de datos, proveedores de atenci&oacute;n al cliente, proveedores de servicios de publicidad y marketing, y representantes de ZM. Dichos Proveedores de servicios procesar&aacute;n sus datos personales en nombre de ZM o para uno o varios de los fines mencionados anteriormente. Si desea revocar su autorizaci&oacute;n para que compartamos esta informaci&oacute;n, p&oacute;ngase en contacto con nosotros en la direcci&oacute;n zmi_privacy@zimiker.com.</p>
<p>&nbsp;</p>
<p>COMPARTIR CON LAS EMPRESAS DEL ECOSISTEMA DE NUESTRO GRUPO</p>
<p>&nbsp;</p>
<p>Xiaomi &nbsp;trabaja con un excelente grupo de empresas, que juntas conforman el ecosistema de Mi. Las empresas del ecosistema de Mi son entidades independientes, en las que Xiaomi ha invertido y estimulado su crecimiento, y son expertos en sus campos. ZM puede revelar sus datos personales a Xiaomi o a otras empresas de Mi Ecosystem para proporcionarle los fant&aacute;sticos productos y servicios (hardware y software) de Mi Ecosystem, as&iacute; como para mejorarlos. Algunos de estos productos y servicios se comercializan bajo la marca ZM, pero otros usan una marca propia. Si ZM participase en una fusi&oacute;n, adquisici&oacute;n o cesi&oacute;n de activos de todos o parte de nuestros activos, le notificaremos por correo electr&oacute;nico o mediante un aviso destacado en nuestro sitio web cualquier cambio de propiedad, en el uso de su informaci&oacute;n personal y en las opciones relativas a su informaci&oacute;n personal que tiene a su disposici&oacute;n.</p>
<p>&nbsp;</p>
<p>COMPARTIR CON OTROS USUARIOS</p>
<p>&nbsp;</p>
<p>ZM puede revelar su informaci&oacute;n personal sin necesidad de obtener su consentimiento cuando la ley aplicable as&iacute; lo exija.</p>
<p>&nbsp;</p>
<p>INFORMACI&Oacute;N QUE NO REQUIERE CONSENTIMIENTO</p>
<p>&nbsp;</p>
<p>Podemos compartir informaci&oacute;n y estad&iacute;sticas anonimizadas de forma agregada con terceros con fines comerciales (por ejemplo, podemos compartir con anunciantes de nuestro sitio web tendencias sobre el uso general de nuestros servicios, como el n&uacute;mero de clientes de determinados grupos demogr&aacute;ficos que hayan comprado determinados productos o que hayan realizado determinadas transacciones).</p>
<p>ZM puede recopilar, usar o revelar su informaci&oacute;n personal sin su consentimiento cuando y en la medida en que las leyes de protecci&oacute;n de datos locales lo permitan de forma expl&iacute;cita. Esta revelaci&oacute;n puede deberse a la necesidad de proteger nuestros derechos, garantizar la seguridad de usted y otras personas y cumplir con los requisitos de la administraci&oacute;n local para facilitar las investigaciones de actividades ilegales.</p>
<p>&nbsp;</p>
<p>GARANT&Iacute;AS EN MATERIA DE SEGURIDAD</p>
<p>&nbsp;</p>
<p>MEDIDAS DE SEGURIDAD DE ZM</p>
<p>&nbsp;</p>
<p>Nos comprometemos a garantizar la seguridad de su informaci&oacute;n personal. Con objeto de impedir el acceso o la divulgaci&oacute;n no autorizados, as&iacute; como otros riesgos similares, hemos puesto en marcha los procedimientos f&iacute;sicos, electr&oacute;nicos y administrativos razonables para proteger la informaci&oacute;n que recopilamos del uso de los productos y servicios de Mi Home Security Camera. Realizaremos todos los esfuerzos razonables para proteger su informaci&oacute;n personal.</p>
<p>&nbsp;</p>
<p>Por ejemplo, cuando acceda a su cuenta Mi, puede usar nuestro proceso de verificaci&oacute;n en dos pasos para mayor seguridad. Cuando se transmiten datos entre su dispositivo ZM y nuestros servidores, nos aseguramos de que est&aacute;n cifrados mediante Capa de sockets seguros (SSL) y otros algoritmos.</p>
<p>&nbsp;</p>
<p>Toda su informaci&oacute;n personal se almacena en servidores seguros que est&aacute;n protegidos en instalaciones controladas. Clasificamos sus datos por importancia y confidencialidad, y nos aseguramos de que su informaci&oacute;n personal tiene el m&aacute;ximo nivel de seguridad. Nos aseguramos de que nuestros empleados y proveedores de servicios externos con acceso a la informaci&oacute;n para ayudar a facilitar al usuario nuestros productos y servicios est&eacute;n sujetos a estrictas obligaciones contractuales en materia de confidencialidad y pueden ser sancionados o se les puede rescindir el contrato en caso de que no cumplan dichas obligaciones. Tambi&eacute;n disponemos de controles de acceso especiales para el almacenamiento de datos basado en la nube. En definitiva, revisamos de forma peri&oacute;dica nuestros procedimientos de recopilaci&oacute;n, almacenamiento y procesamiento de informaci&oacute;n, incluidas las medidas de seguridad f&iacute;sica, para protegerla de cualquier acceso o uso no autorizados.</p>
<p>&nbsp;</p>
<p>Adoptaremos todas las medidas posibles para proteger su informaci&oacute;n personal. Sin embargo, debe tener en cuenta que el uso de Internet no es del todo seguro y, por eso, no podemos garantizar la seguridad e integridad de ninguna informaci&oacute;n personal que transfiera o le sea transferida por Internet.</p>
<p>&nbsp;</p>
<p>LO QUE PUEDE HACER</p>
<p>&nbsp;</p>
<ul>
    <li>Puede contribuir a proteger su informaci&oacute;n personal no revelando la contrase&ntilde;a de inicio de sesi&oacute;n ni informaci&oacute;n de la cuenta a nadie, salvo que esa persona est&eacute; debidamente autorizada por usted. Cuando inicie sesi&oacute;n como usuario de Mi Account en los productos y servicios de Mi Home Security Camera, sobre todo en el ordenador de otra persona o en terminales p&uacute;blicos de Internet, no se olvide de cerrar su sesi&oacute;n al terminar.</li>
    <li>ZM no se hace responsable de ning&uacute;n fallo en la seguridad provocado por el acceso de terceros a su informaci&oacute;n personal si usted no ha preservado su privacidad. Sin perjuicio de todo lo anterior, debe notificarnos inmediatamente si existe un uso no autorizado de su cuenta por parte de otro usuario de Internet o cualquier otra infracci&oacute;n de la seguridad.</li>
    <li>Su colaboraci&oacute;n nos ayudar&aacute; a proteger la privacidad de su informaci&oacute;n personal.</li>
</ul>
<p>&nbsp;</p>
<p>POL&Iacute;TICA DE RETENCI&Oacute;N</p>
<p>&nbsp;</p>
<p>La informaci&oacute;n personal se retendr&aacute; durante el tiempo que sea necesario para que cumpla el fin para el que se ha recopilado, o cuando as&iacute; lo requiera o permita la legislaci&oacute;n vigente. Dejaremos de retener la informaci&oacute;n personal, o quitaremos los medios por los que la informaci&oacute;n personal puede asociarse a determinadas personas, en cuanto sea razonable suponer que la finalidad por la cual se ha recopilado la informaci&oacute;n personal ya no se satisface con la retenci&oacute;n de la informaci&oacute;n personal, incluidos los casos en que la informaci&oacute;n personal ya no se requiere para resolver conflictos legales, aplicar nuestros Acuerdos o lograr nuestros objetivos comerciales.</p>
<p>&nbsp;</p>
<p>ACCEDER A OTRAS CARACTER&Iacute;STICAS EN EL DISPOSITIVO</p>
<p>&nbsp;</p>
<p>Es posible que nuestras aplicaciones tengan que acceder a determinadas caracter&iacute;sticas en el dispositivo, como el env&iacute;o de correos electr&oacute;nicos a contactos, el almacenamiento de SMS y el estado de la red Wi-Fi, adem&aacute;s de otras caracter&iacute;sticas. Esta informaci&oacute;n se usa para permitir que las aplicaciones se ejecuten en el dispositivo y permitirle que interact&uacute;e con las aplicaciones. Puede revocar sus permisos en cualquier momento desactiv&aacute;ndolos en el dispositivo o envi&aacute;ndonos un mensaje a zmi_privacy@zimiker.com.</p>
<p>&nbsp;</p>
<p>TIENE EL CONTROL DE SU INFORMACI&Oacute;N.</p>
<p>&nbsp;</p>
<p>CONTROLAR LA CONFIGURACI&Oacute;N</p>
<p>&nbsp;</p>
<p>ZM es consciente de que el concepto de privacidad var&iacute;a de una persona a otra. Por este motivo, incluimos algunos ejemplos de opciones que ZM pone a disposici&oacute;n del Usuario para que decida c&oacute;mo se recopila, usa, revela o trata su informaci&oacute;n personal y que controle su configuraci&oacute;n de privacidad:</p>
<p>&nbsp;</p>
<ul>
    <li>Aceptar/rechazar cuando aparece una ventana de privacidad</li>
    <li>Activar/desactivar la transmisi&oacute;n de v&iacute;deo</li>
    <li>Activar/desactivar la alarma de detecci&oacute;n de movimiento</li>
    <li>Revocar/aceptar, si el usuario confirma querer hacerlo, que todos los datos locales y de la nube se eliminar&aacute;n y el dispositivo se restaurar&aacute; para restablecer el modo</li>
</ul>
<p>Puede obtener m&aacute;s informaci&oacute;n relacionada con el estado de seguridad de su dispositivo en el centro de seguridad de MIUI.</p>
<p>&nbsp;</p>
<p>Si ha aceptado que su informaci&oacute;n personal se utilice para los fines &nbsp;anteriormente mencionados y en alg&uacute;n momento cambia de opini&oacute;n, env&iacute;enos un correo electr&oacute;nico a zmi_privacy@zimiker.com.</p>
<p>&nbsp;</p>
<p>ACCESO, ACTUALIZACI&Oacute;N, CORRECCI&Oacute;N O ELIMINACI&Oacute;N DE SU INFORMACI&Oacute;N PERSONAL</p>
<p>&nbsp;</p>
<ul>
    <li>Tiene derecho a solicitar el acceso o la correcci&oacute;n de cualquier otra informaci&oacute;n personal que obre en nuestro poder. Cuando actualice su informaci&oacute;n personal, se le pedir&aacute; que verifique su identidad antes de que sigamos con su solicitud. Cuando hayamos obtenido suficiente informaci&oacute;n para atender su solicitud de acceso o correcci&oacute;n de la informaci&oacute;n personal, procederemos a dar respuesta a su solicitud en el plazo indicado en las leyes de protecci&oacute;n de datos vigente.</li>
    <li>Normalmente, ofrecemos estos servicios de forma gratuita, pero nos reservamos el derecho a cobrar un precio razonable por la solicitud de acceso a sus datos.</li>
    <li>Si quiere solicitar acceso a sus datos personales en nuestro poder o cree que cualquier informaci&oacute;n que tengamos sobre usted es incorrecta o est&aacute; incompleta, o bien considera que es inadecuada o excesiva, escr&iacute;banos o env&iacute;enos un correo electr&oacute;nico lo antes posible a la direcci&oacute;n de correo electr&oacute;nico siguiente. Correo electr&oacute;nico: zmi_privacy@zimiker.com.</li>
    <li>Para conocer los detalles sobre la informaci&oacute;n personal de su cuenta Mi, puede obtener acceso y cambiarla en http://account.mi.com, o bien puede iniciar sesi&oacute;n en su cuenta en el dispositivo.</li>
</ul>
<p>&nbsp;</p>
<p>REVOCACI&Oacute;N DEL CONSENTIMIENTO</p>
<p>&nbsp;</p>
<ul>
    <li>Puede revocar el consentimiento de recopilaci&oacute;n, uso o revelaci&oacute;n de su informaci&oacute;n personal en nuestro poder o control enviando una solicitud. Podr&aacute; hacerlo retirando el consentimiento de privacidad y del acuerdo en los ajustes generales. Procesaremos su solicitud en un plazo prudencial a partir del momento en que se haya realizado la solicitud y, a partir de ese momento, dejaremos de recopilar, usar o revelar su informaci&oacute;n personal en relaci&oacute;n con su solicitud.</li>
    <li>Reconozca que la revocaci&oacute;n del consentimiento podr&iacute;a tener determinados efectos jur&iacute;dicos. En funci&oacute;n del alcance de su revocaci&oacute;n del consentimiento para el tratamiento de su informaci&oacute;n personal, es posible que despu&eacute;s no pueda disfrutar de los productos y servicios de Mi Home Security Camera .</li>
</ul>
<p>&nbsp;</p>
<p>TRANSFERENCIA DE INFORMACI&Oacute;N PERSONAL FUERA DE SU JURISDICCI&Oacute;N</p>
<p>&nbsp;</p>
<p>En la medida en que tengamos que transferir informaci&oacute;n personal fuera de su jurisdicci&oacute;n, ya sea a nuestras empresas filiales (que se encuentran en el &aacute;mbito de las comunicaciones, las redes sociales, la tecnolog&iacute;a y la nube) o a nuestros proveedores de servicios externos, lo haremos de conformidad con la legislaci&oacute;n vigente. En particular, garantizamos que todas las transferencias se realizar&aacute;n de conformidad con los requisitos de las leyes de protecci&oacute;n de datos local vigente poniendo en pr&aacute;ctica las garant&iacute;as adecuadas.</p>
<p>&nbsp;</p>
<p>ZM puede usar centros extranjeros operados y controlados por ZM para el tratamiento o copia de seguridad de su informaci&oacute;n personal. En la actualidad, ZM cuenta con centros de datos en Pek&iacute;n, Estados Unidos, Singapur y Francia. Es posible que estas jurisdicciones extranjeras cuenten o no con leyes de protecci&oacute;n de datos que sean sustancialmente similares a las de su jurisdicci&oacute;n local. Podemos transferir y almacenar su informaci&oacute;n personal en nuestras instalaciones en el extranjero. No obstante, esto no cambia ninguno de nuestros compromisos en defensa de su informaci&oacute;n personal de conformidad con esta Pol&iacute;tica de privacidad.</p>
<p>&nbsp;</p>
<p>DISPOSICIONES DIVERSAS</p>
<p>&nbsp;</p>
<p>MENORES</p>
<p>&nbsp;</p>
<p>Consideramos que es responsabilidad de los padres supervisar el uso que hagan sus hijos de nuestros productos y servicios. A pesar de ello, nuestra pol&iacute;tica consiste en no exigir informaci&oacute;n personal de menores ni ofrecer o enviar materiales promocionales a personas englobadas en esa categor&iacute;a.</p>
<p>ZM no solicita ni pretende recibir informaci&oacute;n personal de menores. Si un padre o tutor tiene motivos para creer que un menor ha proporcionado a ZM informaci&oacute;n personal sin su consentimiento, puede ponerse en contacto con nosotros para que eliminemos dicha informaci&oacute;n personal y cancelemos la suscripci&oacute;n del menor a cualquiera de los servicios de ZM aplicables.</p>
<p>&nbsp;</p>
<p>ORDEN DE PRECEDENCIA</p>
<p>&nbsp;</p>
<p>Si ha aceptado nuestros Acuerdos de usuario vigentes, en caso de incoherencia entre esos Acuerdos de usuario y esta Pol&iacute;tica de privacidad, prevalecer&aacute;n los Acuerdos de usuario.</p>
<p>&nbsp;</p>
<p>LEGISLACI&Oacute;N VIGENTE</p>
<p>&nbsp;</p>
<p>[Esta Pol&iacute;tica de privacidad se regir&aacute; por la legislaci&oacute;n de Singapur.] No hemos indicado ni garantizado que esta Pol&iacute;tica de privacidad cumpla las leyes de privacidad de ninguna jurisdicci&oacute;n. Por consiguiente, no debe interpretar esta Pol&iacute;tica de privacidad de conformidad con esta legislaci&oacute;n o con ninguna otra.</p>
<p>&nbsp;</p>
<p>ACTUALIZACIONES DE LA POL&Iacute;TICA DE PRIVACIDAD</p>
<p>&nbsp;</p>
<p>Mantenemos nuestra Pol&iacute;tica de privacidad en constante revisi&oacute;n y podemos actualizarla para que refleje cambios efectuados en nuestros procedimientos informativos. Si hacemos alguna modificaci&oacute;n fundamental en nuestra Pol&iacute;tica de Privacidad, le informaremos por correo electr&oacute;nico (usaremos la direcci&oacute;n de correo electr&oacute;nico que consta en su cuenta) o publicaremos los cambios en todos los sitios web de ZM o en nuestros dispositivos m&oacute;viles, de modo que sepa qu&eacute; informaci&oacute;n recopilamos y c&oacute;mo la usamos. Esas modificaciones de nuestra Pol&iacute;tica de privacidad se aplicar&aacute;n a partir de la fecha de entrada en vigor indicada en el aviso o en el sitio web. Le recomendamos que revise de forma peri&oacute;dica esta p&aacute;gina para ver la informaci&oacute;n m&aacute;s reciente sobre nuestros procedimientos de privacidad. El uso continuado de productos y servicios por su parte en los sitios web, los tel&eacute;fonos m&oacute;viles o cualquier otro dispositivo se interpretar&aacute; como la aceptaci&oacute;n de la Pol&iacute;tica de privacidad actualizada. Pediremos su consentimiento reciente antes de recopilar m&aacute;s informaci&oacute;n personal de usted o si queremos usar o revelar su informaci&oacute;n personal con nuevos fines.</p>
<p>&nbsp;</p>
<p>&iquest;TENGO QUE ACEPTAR LOS T&Eacute;RMINOS Y CONDICIONES DE ALG&Uacute;N TERCERO?</p>
<p>&nbsp;</p>
<p>Nuestra Pol&iacute;tica de Privacidad no se aplica a productos y servicios ofrecidos por un tercero. Los productos y servicios de &nbsp;Mi Home Security Camera pueden incluir productos, servicios y enlaces de terceros a sitios web de terceros. Es posible que estos terceros tambi&eacute;n recopilen su informaci&oacute;n cuando use esos productos o servicios. Por ello, insistimos en recomendarle que lea la pol&iacute;tica de privacidad del tercero, del mismo modo que se ha tomado un tiempo para leer la nuestra. No somos responsables de la forma en que los terceros usan la informaci&oacute;n personal que recopilan de usted ni podemos controlarlo. Nuestra Pol&iacute;tica de privacidad no se aplica a otros sitios vinculados desde nuestros servicios.</p>
<p>&nbsp;</p>
<p>CONTACTO</p>
<p>&nbsp;</p>
<p>Si tiene alg&uacute;n comentario o pregunta acerca de la presente Pol&iacute;tica de privacidad o relacionados con la recopilaci&oacute;n, uso o divulgaci&oacute;n de informaci&oacute;n personal por parte de ZM, p&oacute;ngase en contacto con nuestro responsable de protecci&oacute;n de datos en la direcci&oacute;n que aparece debajo y mencione la referencia &laquo;Pol&iacute;tica de Privacidad&raquo;:</p>
<p>&nbsp;</p>
<p>Zimi corporation.</p>
<p>Sala A913, Chengjiang Road N.&ordm; 159,</p>
<p>Jiangyin, Provincia de Jiangsu, Rep&uacute;blica Popular China</p>
<p>Correo electr&oacute;nico: zmi_privacy@zimiker.com</p>
<p>&nbsp;</p>
<p>Gracias por tomarse el tiempo para comprender nuestra Pol&iacute;tica de privacidad.</p>