<p>POLITIQUE DE CONFIDENTIALIT&Eacute;</p>
<p>&nbsp;</p>
<p>Mise &agrave; jour&nbsp;!</p>
<p>&nbsp;</p>
<p>Notre Politique de confidentialit&eacute; a &eacute;t&eacute; mise &agrave; jour le 1er&nbsp;novembre&nbsp;2017. Nous avons enti&egrave;rement r&eacute;vis&eacute; notre Politique de confidentialit&eacute; de sorte &agrave; vous informer sur la fa&ccedil;on dont nous g&eacute;rons vos informations &agrave; caract&egrave;re personnel en ce qui concerne les produits et services de la cam&eacute;ra de s&eacute;curit&eacute; Mi&nbsp;Home.</p>
<p>&nbsp;</p>
<p>Veuillez prendre le temps de vous familiariser avec nos pratiques en mati&egrave;re de confidentialit&eacute; et n&rsquo;h&eacute;sitez pas &agrave; nous contacter en cas de doute.</p>
<p>&nbsp;</p>
<p>NOTRE ENGAGEMENT ENVERS VOUS</p>
<p>&nbsp;</p>
<p>La pr&eacute;sente Politique de confidentialit&eacute; d&eacute;finit comment Zimi corporation Inc. et ses soci&eacute;t&eacute;s affili&eacute;es au sein du groupe Zimi corporation&nbsp;Group (&laquo;&nbsp;ZM&nbsp;&raquo;, &laquo;&nbsp;nous&nbsp;&raquo;, &laquo;&nbsp;notre&nbsp;&raquo;, &laquo;&nbsp;n&ocirc;tre&nbsp;&raquo; ou &laquo;&nbsp;nos&nbsp;&raquo;) recueillent, utilisent, divulguent, traitent et prot&egrave;gent les informations que vous nous transmettez d&egrave;s lors que vous utilisez les produits et services des cam&eacute;ras de s&eacute;curit&eacute; Mi&nbsp;Home. Si nous sommes amen&eacute;s &agrave; vous demander de fournir des informations qui vous identifient lorsque vous utilisez les produits et services des cam&eacute;ras de s&eacute;curit&eacute; Mi&nbsp;Home, ces derni&egrave;res ne seront utilis&eacute;es qu&rsquo;en vertu de la pr&eacute;sente Politique de confidentialit&eacute; et/ou de nos conditions g&eacute;n&eacute;rales pour les utilisateurs.</p>
<p>&nbsp;</p>
<p>La Politique de confidentialit&eacute; a &eacute;t&eacute; &eacute;labor&eacute;e en tenant compte de vos besoins, c&rsquo;est pourquoi il est important que vous compreniez nos pratiques en mati&egrave;re de collecte et d&rsquo;utilisation des informations &agrave; caract&egrave;re personnel, et que vous soyez conscient du contr&ocirc;le que vous exercez sur les informations que vous transmettez &agrave; ZM.</p>
<p>&nbsp;</p>
<p>Dans la pr&eacute;sente Politique de confidentialit&eacute;, l&rsquo;expression &laquo;&nbsp;informations &agrave; caract&egrave;re personnel&nbsp;&raquo; d&eacute;signe les informations pouvant &ecirc;tre utilis&eacute;es &agrave; des fins d&rsquo;identification d&rsquo;une personne, soit uniquement &agrave; partir de ces informations, soit en les associant &agrave; d&rsquo;autres, auxquelles ZM a acc&egrave;s. Lesdites informations peuvent inclure vos nom, adresse, num&eacute;ro de t&eacute;l&eacute;phone et adresse e-mail.</p>
<p>&nbsp;</p>
<p>En utilisant les produits et services des cam&eacute;ras de s&eacute;curit&eacute; Mi&nbsp;Home, vous &ecirc;tes r&eacute;put&eacute; avoir lu et accept&eacute; toutes les dispositions &eacute;nonc&eacute;es aux pr&eacute;sentes, y compris toute modification que nous pourrions y apporter de fa&ccedil;on ponctuelle. Nous nous sommes engag&eacute;s &agrave; prot&eacute;ger la confidentialit&eacute; et la s&eacute;curit&eacute; de vos informations &agrave; caract&egrave;re personnel, dans le respect des lois en vigueur, notamment conform&eacute;ment &agrave; votre l&eacute;gislation locale en mati&egrave;re de protection des donn&eacute;es. Nous sommes tout autant engag&eacute;s &agrave; veiller &agrave; ce que nos agents et employ&eacute;s respectent ces obligations.</p>
<p>&nbsp;</p>
<p>En fin de compte, nous souhaitons surtout proposer ce qu&rsquo;il y a de mieux &agrave; chacun de nos utilisateurs. En cas de doute quant &agrave; nos pratiques en mati&egrave;re de gestion des donn&eacute;es, telles qu&rsquo;elles sont r&eacute;sum&eacute;es dans la pr&eacute;sente Politique de confidentialit&eacute;, veuillez contacter notre Responsable de la protection des donn&eacute;es &agrave; l&rsquo;adresse suivante&nbsp;: zmi_privacy@zimiker.com pour lui faire part des questions que vous vous posez. Nous serons ravis d&rsquo;y r&eacute;pondre directement.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>QUELLES SONT LES INFORMATIONS RECUEILLIES ET COMMENT LES UTILISONS-NOUS&nbsp;?</p>
<p>&nbsp;</p>
<p>TYPES D&rsquo;INFORMATIONS RECUEILLIES</p>
<p>&nbsp;</p>
<p>Afin de vous proposer nos services, nous vous demandons de nous fournir des informations &agrave; caract&egrave;re personnel pour que vous puissiez b&eacute;n&eacute;ficier de ces services. Si vous ne nous transmettez pas lesdites informations, nous pourrions ne pas &ecirc;tre en mesure de vous proposer nos produits ou services.</p>
<p>&nbsp;</p>
<p>Nous pouvons &ecirc;tre amen&eacute;s &agrave; recueillir les types d&rsquo;informations suivants (qui peuvent &ecirc;tre &agrave; caract&egrave;re personnel ou non)&nbsp;:</p>
<p>&nbsp;</p>
<p><strong>Donn&eacute;es relatives &agrave; l&rsquo;appareil&nbsp;: </strong>&nbsp;donn&eacute;es relatives au mat&eacute;riel, aux performances, &agrave; l&rsquo;&eacute;tat de votre appareil, etc. Par exemple&nbsp;: Version du syst&egrave;me, informations relatives au fabricant de l&rsquo;appareil, nom du mod&egrave;le, num&eacute;ro d&rsquo;identification de l&rsquo;appareil et de la carte m&egrave;re, utilisation du processeur<a href="http://www.baidu.com/link?url=CIIdEw9qLNBCvOLBr54F8RQR80b3ZV9ELZvwCR7N-F0XeEiBnTFFDV1NSPeHtcQ9I07aVQoNYpWt5B-baph2SIlC54_SJOEGz5EMEhOoiNO&amp;wd=&amp;eqid=dc2f5476000023ef0000000559bf8d7a">pulsation</a>, etc.</p>
<p><strong>Informations sur le r</strong><strong>&eacute;</strong><strong>seau&nbsp;: </strong>SSID WIFI, RSSI, IP, etc.</p>
<p><strong>Donn&eacute;es que nous avons d&eacute;termin&eacute;es et vous concernant</strong>&nbsp;: il est possible que nous recueillions votre num&eacute;ro de compte Xiaomi et d&rsquo;autres donn&eacute;es et que nous les utilisions.</p>
<p><strong>Vid&eacute;o en cache sur le cloud&nbsp;: </strong>lorsque le param&egrave;tre &laquo;&nbsp;Alarme de la vid&eacute;o sur le cloud&nbsp;&raquo; est activ&eacute;, une vid&eacute;o d&rsquo;environ 10&nbsp;secondes sera charg&eacute;e sur le serveur. La vid&eacute;o restera 7&nbsp;jours sur le serveur et peut &ecirc;tre consult&eacute;e par les utilisateurs sur leur t&eacute;l&eacute;phone portable.</p>
<p><strong>Vid&eacute;o avec visionnage &agrave; distance&nbsp;: </strong>lorsque les utilisateurs regardent une vid&eacute;o en temps r&eacute;el ou en rediffusion sur leur t&eacute;l&eacute;phone portable, la transmission vid&eacute;o est chiffr&eacute;e et transf&eacute;r&eacute;e via le serveur, mais n&rsquo;y est pas sauvegard&eacute;e.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>UTILISATION DES INFORMATIONS &Agrave; CARACT&Egrave;RE PERSONNEL</p>
<p>&nbsp;</p>
<p>Les informations &agrave; caract&egrave;re personnel sont recueillies &agrave; des fins de prestation de services et/ou de fourniture de produits &agrave; votre intention, ainsi qu&rsquo;&agrave; des fins de conformit&eacute; juridique aux lois en vigueur pour notre part. Vous consentez par les pr&eacute;sentes &agrave; ce que nous traitions et transmettions des informations &agrave; caract&egrave;re personnel &agrave; nos soci&eacute;t&eacute;s affili&eacute;es (entreprises dont les activit&eacute;s sont li&eacute;es &agrave; la communication, aux r&eacute;seaux sociaux, &agrave; la technologie ou aux services cloud), ainsi qu&rsquo;&agrave; nos Prestataires de services tiers (d&eacute;finis ci-apr&egrave;s) aux fins &eacute;tablies dans la pr&eacute;sente Politique de confidentialit&eacute;.</p>
<p>&nbsp;</p>
<p>Nous pouvons utiliser vos informations &agrave; caract&egrave;re personnel aux fins suivantes&nbsp;:</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<ul>
    <li>Communiquer avec vous au sujet de votre appareil, service ou de toute demande d&rsquo;ordre g&eacute;n&eacute;ral, comme les mises &agrave; jour, le service d&rsquo;assistance client, les informations concernant nos &eacute;v&eacute;nements, avis, etc.</li>
    <li>Analyser et d&eacute;velopper des informations statistiques sur l&rsquo;utilisation de nos produits et services, dans le but de les am&eacute;liorer.</li>
</ul>
<p>&nbsp;</p>
<p>Vous trouverez ici davantage de renseignements sur notre utilisation de vos informations (pouvant &ecirc;tre &agrave; caract&egrave;re personnel).</p>
<p>&nbsp;</p>
<ul>
    <li>Nous pourrions avoir recours &agrave; la vid&eacute;o en cache sur le cloud afin de vous proposer une fonctionnalit&eacute; d&rsquo;alarme en cas de d&eacute;tection de mouvements.</li>
    <li>Nous pourrions avoir recours &agrave; la vid&eacute;o avec visionnage &agrave; distance afin de vous proposer des fonctionnalit&eacute;s de rediffusion de la vid&eacute;o ou de visionnage en temps r&eacute;el &agrave;</li>
    <li>Nous pourrions utiliser les donn&eacute;es li&eacute;es aux appareils afin de comptabiliser le nombre d&rsquo;appareils activ&eacute;s et le nombre d&rsquo;appareils connect&eacute;s, d&rsquo;analyser la distribution de la version du micrologiciel dans le but de v&eacute;rifier l&rsquo;&eacute;tat de fonctionnement d&rsquo;un appareil donn&eacute; et de veiller &agrave; ce que l&rsquo;acc&egrave;s &agrave; votre appareil soit autoris&eacute; et s&eacute;curis&eacute;.</li>
    <li>Nous pouvons &ecirc;tre amen&eacute;s &agrave; utiliser des informations de r&eacute;seau dans le but d&rsquo;analyser l&rsquo;&eacute;tat de r&eacute;seau des appareils et ainsi vous aider &agrave; r&eacute;soudre vos probl&egrave;mes d&rsquo;utilisation. En outre, les informations IP peuvent &ecirc;tre utilis&eacute;es uniquement &agrave; des fins d&rsquo;&eacute;tude statistique de la distribution g&eacute;ographique des appareils connect&eacute;s, ce qui n&rsquo;est aucunement susceptible de divulguer tout autre type d&rsquo;informations &agrave; votre sujet, comme votre localisation.</li>
    <li>Le num&eacute;ro de compte&nbsp;Xiaomi peut aussi &ecirc;tre utilis&eacute; afin de rechercher les appareils li&eacute;s audit compte et ainsi veiller &agrave; ce que l&rsquo;acc&egrave;s &agrave; chacun des appareils soit autoris&eacute;.</li>
</ul>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>AVEC QUI PARTAGEONS-NOUS VOS INFORMATIONS&nbsp;?</p>
<p>&nbsp;</p>
<p>Nous ne vendons aucune information &agrave; caract&egrave;re personnel &agrave; des tiers.</p>
<p>&nbsp;</p>
<p>Nous pouvons &ecirc;tre amen&eacute;s &agrave; transmettre vos informations &agrave; caract&egrave;re personnel de temps &agrave; autre &agrave; des tiers (tels que d&eacute;finis ci-apr&egrave;s), dans le but de vous fournir les produits ou services que vous avez demand&eacute;s.</p>
<p>&nbsp;</p>
<p>Ladite transmission d&rsquo;informations peut avoir lieu avec des Prestataires de services tiers et des soci&eacute;t&eacute;s affili&eacute;es, mentionn&eacute;s dans la section ci-dessous. Pour chacun des cas d&eacute;crits dans la pr&eacute;sente section, vous pouvez &ecirc;tre certain que ZM ne partagera vos informations &agrave; caract&egrave;re personnel que si votre accord a &eacute;t&eacute; donn&eacute;. D&egrave;s lors que ZM partage vos informations &agrave; caract&egrave;re personnel avec un Prestataire de services tiers au titre de l&rsquo;une quelconque des situations d&eacute;crites dans la pr&eacute;sente section, ZM devra indiquer contractuellement que le tiers r&eacute;pond &agrave; des pratiques et obligations en conformit&eacute; aux lois locales applicables en mati&egrave;re de protection des donn&eacute;es. ZM veillera, &agrave; titre contractuel, au respect par tout Prestataire de services tiers des normes en mati&egrave;re de confidentialit&eacute; en vigueur au sein de votre juridiction locale.</p>
<p>&nbsp;</p>
<p>PARTAGE AVEC NOTRE GROUPE ET LES PRESTATAIRES DE SERVICES TIERS.</p>
<p>&nbsp;</p>
<p>Afin de veiller au bon d&eacute;roulement des op&eacute;rations commerciales lorsque nous vous offrons l&rsquo;ensemble des fonctionnalit&eacute;s de nos produits et services, nous pouvons &ecirc;tre amen&eacute;s &agrave; partager vos informations &agrave; caract&egrave;re personnel de fa&ccedil;on ponctuelle, avec d&rsquo;autres soci&eacute;t&eacute;s affili&eacute;es de ZM (entreprises dont les activit&eacute;s sont li&eacute;es &agrave; la communication, aux r&eacute;seaux sociaux, &agrave; la technologie ou aux services cloud), ou avec des prestataires de services tiers comme les agences de publicit&eacute; directe, les prestataires de services de livraison, les entreprises de t&eacute;l&eacute;communication, les centres de donn&eacute;es, les installations de stockage de donn&eacute;es, les prestataires de services client, de publicit&eacute; et de marketing, ainsi que les repr&eacute;sentants de ZM. Lesdits Prestataires de services tiers traitent alors vos informations &agrave; caract&egrave;re personnel au nom de ZM ou au titre de l&rsquo;une des finalit&eacute;s susmentionn&eacute;es, voire plusieurs d&rsquo;entre elles. Si vous ne souhaitez plus nous autoriser &agrave; partager ces informations, veuillez nous contacter &agrave; l&rsquo;adresse suivante&nbsp;: zmi_privacy@zimiker.com.</p>
<p>&nbsp;</p>
<p>PARTAGE AVEC L&rsquo;&Eacute;COSYST&Egrave;ME D&rsquo;ENTREPRISES DE NOTRE GROUPE</p>
<p>&nbsp;</p>
<p>Xiaomi collabore avec un certain nombre d&rsquo;entreprises de qualit&eacute;, qui, ensemble, forment l&rsquo;&Eacute;cosyst&egrave;me&nbsp;Mi. Les entreprises de l&rsquo;&Eacute;cosyst&egrave;me&nbsp;Mi sont des entit&eacute;s ind&eacute;pendantes, expertes dans leur domaine d&rsquo;activit&eacute;, et dans lesquelles Xiaomi est investie. ZM peut divulguer vos donn&eacute;es personnelles aux soci&eacute;t&eacute;s de Xiaomi ou de l&rsquo;&Eacute;cosyst&egrave;me&nbsp;Mi afin de vous apporter des produits et des services int&eacute;ressants (aussi bien des logiciels que du mat&eacute;riel) de l&rsquo;&Eacute;cosyst&egrave;me&nbsp;Mi, et de les am&eacute;liorer. Certains de ces produits et services resteront sous l&rsquo;&eacute;gide de la marque ZM, tandis que d&rsquo;autres peuvent utiliser leur propre marque. Si ZM est impliqu&eacute;e dans une op&eacute;ration de fusion, acquisition ou vente de tout ou partie de nos actifs, vous serez inform&eacute; par e-mail et/ou par un avis bien visible sur notre site&nbsp;Web en cas de changement de propri&eacute;taire, d&rsquo;utilisation de vos informations &agrave; caract&egrave;re personnel ou de choix dont vous pourriez faire part quant &agrave; ces derni&egrave;res.</p>
<p>&nbsp;</p>
<p>PARTAGE AVEC DES TIERS</p>
<p>&nbsp;</p>
<p>Lorsque la loi en vigueur l&rsquo;exige, ZM peut &ecirc;tre amen&eacute;e &agrave; partager vos informations &agrave; caract&egrave;re personnel sans accord suppl&eacute;mentaire.</p>
<p>&nbsp;</p>
<p>INFORMATIONS NE N&Eacute;CESSITANT PAS D&rsquo;ACCORD PR&Eacute;ALABLE</p>
<p>&nbsp;</p>
<p>Nous pouvons &ecirc;tre amen&eacute;s &agrave; partager des statistiques et des informations rendues anonymes sous la forme de donn&eacute;es globales avec des tiers, &agrave; des fins commerciales, par exemple avec des annonceurs sur notre site&nbsp;Web. Nous sommes susceptibles de partager des tendances quant &agrave; l&rsquo;utilisation g&eacute;n&eacute;rale de nos services, comme le nombre de clients au sein de quelques groupes d&eacute;mographiques ayant fait l&rsquo;acquisition de certains produits ou r&eacute;alis&eacute; des transactions.</p>
<p>Afin de lever toute ambigu&iuml;t&eacute;, ZM peut recueillir, utiliser ou divulguer vos informations &agrave; caract&egrave;re personnel sans votre accord, mais uniquement dans le cadre autoris&eacute; par les lois locales en vigueur en mati&egrave;re de protection des donn&eacute;es, et conform&eacute;ment &agrave; ces derni&egrave;res. Le fait de divulguer vos informations peut survenir en raison de la n&eacute;cessit&eacute; de prot&eacute;ger nos droits, ou afin de garantir votre s&eacute;curit&eacute; et celle d&rsquo;autres personnes, ou encore de veiller &agrave; notre conformit&eacute; aux exigences des gouvernements locaux et ainsi faciliter les enqu&ecirc;tes au titre d&rsquo;activit&eacute;s ill&eacute;gales.</p>
<p>&nbsp;</p>
<p>MESURES DE PROTECTION</p>
<p>&nbsp;</p>
<p>MESURES DE S&Eacute;CURIT&Eacute; DE ZM</p>
<p>&nbsp;</p>
<p>Nous tenons &agrave; garantir la s&eacute;curit&eacute; de vos informations &agrave; caract&egrave;re personnel. Afin de pr&eacute;venir tout acc&egrave;s, divulgation ou autre risque du m&ecirc;me ordre non autoris&eacute;s, nous avons mis en place des proc&eacute;dures physiques, &eacute;lectroniques et d&rsquo;encadrement, afin de prot&eacute;ger et de s&eacute;curiser les donn&eacute;es que nous recueillons d&eacute;coulant de votre utilisation des produits et services de la cam&eacute;ra de s&eacute;curit&eacute; Mi&nbsp;Home. Nous mettrons tout en &oelig;uvre pour prot&eacute;ger vos informations &agrave; caract&egrave;re personnel.</p>
<p>&nbsp;</p>
<p>&Agrave; titre d&rsquo;exemple, lorsque vous vous connectez &agrave; votre compte Mi, vous pouvez opter pour une v&eacute;rification &agrave; deux&nbsp;&eacute;tapes, pour une s&eacute;curit&eacute; renforc&eacute;e. Lorsque vous envoyez des donn&eacute;es depuis votre appareil ZM vers nos serveurs, ou lorsque vous en recevez, nous veillons &agrave; ce que celles-ci soient chiffr&eacute;es, gr&acirc;ce au protocole &laquo;&nbsp;SSL&nbsp;&raquo; et &agrave; d&rsquo;autres algorithmes.</p>
<p>&nbsp;</p>
<p>Toutes vos informations &agrave; caract&egrave;re personnel sont stock&eacute;es sur nos serveurs s&eacute;curis&eacute;s, eux-m&ecirc;mes prot&eacute;g&eacute;s dans des enceintes sous contr&ocirc;le. Nous classons vos donn&eacute;es en fonction de leur importance et de leur caract&egrave;re sensible, et veillons &agrave; ce que vos informations &agrave; caract&egrave;re personnel jouissent du plus haut niveau de s&eacute;curit&eacute; possible. Nous veillons &agrave; ce que nos employ&eacute;s et les Prestataires de services tiers ayant acc&egrave;s aux informations dans le but de vous fournir les produits et services soient soumis &agrave; des obligations contractuelles strictes en mati&egrave;re de confidentialit&eacute;. Ils peuvent &eacute;galement faire l&rsquo;objet de mesures disciplinaires ou de r&eacute;siliation en cas de manquement auxdites obligations. Nous disposons &eacute;galement de contr&ocirc;les d&rsquo;acc&egrave;s sp&eacute;ciaux pour le stockage des donn&eacute;es bas&eacute;es sur le cloud. Dans l&rsquo;ensemble, nous r&eacute;visons r&eacute;guli&egrave;rement nos pratiques ayant trait au traitement, au stockage et &agrave; la collecte d&rsquo;informations, y compris les mesures de s&eacute;curit&eacute; physiques, afin de nous pr&eacute;munir contre un acc&egrave;s et une utilisation non autoris&eacute;s.</p>
<p>&nbsp;</p>
<p>Nous mettrons tout en &oelig;uvre pour prot&eacute;ger vos informations &agrave; caract&egrave;re personnel. Toutefois, l&rsquo;utilisation d&rsquo;Internet n&rsquo;est pas sans risque. C&rsquo;est pourquoi nous ne pouvons garantir la s&eacute;curit&eacute; ni l&rsquo;int&eacute;grit&eacute; de toute information &agrave; caract&egrave;re personnel qui vous est transmise ou que vous nous transmettez par Internet.</p>
<p>&nbsp;</p>
<p>CE QUE VOUS POUVEZ FAIRE</p>
<p>&nbsp;</p>
<ul>
    <li>Vous pouvez &ecirc;tre acteur de la protection de vos informations, en ne r&eacute;v&eacute;lant &agrave; personne vos informations de compte ni votre mot de passe, &agrave; moins que vous n&rsquo;ayez d&ucirc;ment autoris&eacute; cette personne &agrave; y avoir acc&egrave;s. D&egrave;s lors que vous vous connectez &agrave; votre compte utilisateur&nbsp;Mi depuis les produits et services de la cam&eacute;ra de s&eacute;curit&eacute; Mi&nbsp;Home, en particulier depuis l&rsquo;ordinateur d&rsquo;un tiers ou de terminaux Internet publics, veillez &agrave; toujours vous d&eacute;connecter au terme de votre session.</li>
    <li>ZM ne peut &ecirc;tre tenue responsable des failles de s&eacute;curit&eacute; d&eacute;coulant des acc&egrave;s de tiers &agrave; vos informations &agrave; caract&egrave;re personnel en raison de votre manquement &agrave; en pr&eacute;server la confidentialit&eacute;. Nonobstant ce qui pr&eacute;c&egrave;de, vous &ecirc;tes tenu de nous informer imm&eacute;diatement en cas d&rsquo;utilisation non autoris&eacute;e de votre compte par tout utilisateur Internet ou en cas de toute autre atteinte &agrave; la s&eacute;curit&eacute;.</li>
    <li>Votre collaboration nous aidera &agrave; prot&eacute;ger la confidentialit&eacute; de vos informations &agrave; caract&egrave;re personnel.</li>
</ul>
<p>&nbsp;</p>
<p>POLITIQUE DE CONSERVATION</p>
<p>&nbsp;</p>
<p>Les informations &agrave; caract&egrave;re personnel seront conserv&eacute;es aussi longtemps que besoin est, afin de r&eacute;pondre &agrave; la finalit&eacute; pour laquelle elles ont &eacute;t&eacute; recueillies, ou conform&eacute;ment &agrave; ce que les lois en vigueur exigent ou autorisent. Nous cesserons de conserver les informations &agrave; caract&egrave;re personnel ou supprimerons les moyens qui permettent de les associer &agrave; une personne donn&eacute;e, d&egrave;s lors qu&rsquo;il semble raisonnable de supposer que leur conservation ne r&eacute;pond plus &agrave; la finalit&eacute; en vertu de laquelle elles ont &eacute;t&eacute; recueillies, y compris lorsqu&rsquo;elles ne sont plus requises dans le cadre de la r&eacute;solution de litiges, de l&rsquo;application de nos Contrats ou dans le but d&rsquo;atteindre nos objectifs commerciaux.</p>
<p>&nbsp;</p>
<p>ACC&Egrave;S &Agrave; D&rsquo;AUTRES FONCTIONNALIT&Eacute;S SUR VOTRE APPAREIL</p>
<p>&nbsp;</p>
<p>Nos applications peuvent n&eacute;cessiter l&rsquo;acc&egrave;s &agrave; certaines fonctionnalit&eacute;s sur votre appareil, comme l&rsquo;activation d&rsquo;envoi d&rsquo;e-mails aux contacts, du stockage de SMS et de l&rsquo;&eacute;tat du r&eacute;seau Wi-Fi, ainsi que d&rsquo;autres fonctionnalit&eacute;s. Ces informations sont utilis&eacute;es pour permettre aux applications de s&rsquo;ex&eacute;cuter sur votre appareil et vous permettre d&rsquo;interagir avec celles-ci. Vous pouvez r&eacute;voquer ces permissions &agrave; tout moment en les d&eacute;sactivant au niveau de votre appareil ou en nous contactant &agrave; l&rsquo;adresse suivante&nbsp;: zmi_privacy@zimiker.com.</p>
<p>&nbsp;</p>
<p>VOUS AVEZ LE CONTR&Ocirc;LE DE VOS INFORMATIONS&nbsp;!</p>
<p>&nbsp;</p>
<p>PARAM&Egrave;TRES DE CONTR&Ocirc;LE</p>
<p>&nbsp;</p>
<p>La soci&eacute;t&eacute; ZM est consciente que les inqui&eacute;tudes en mati&egrave;re de confidentialit&eacute; varient d&rsquo;un individu &agrave; l&rsquo;autre. Par cons&eacute;quent, nous fournissons des exemples quant &agrave; la mani&egrave;re dont ZM met &agrave; votre disposition le choix de restreindre la collecte, l&rsquo;utilisation, la divulgation ou le traitement de vos informations &agrave; caract&egrave;re personnel et de contr&ocirc;ler vos param&egrave;tres de confidentialit&eacute;&nbsp;:</p>
<p>&nbsp;</p>
<ul>
    <li>Accepter/D&eacute;cliner lorsque la fen&ecirc;tre contextuelle de confidentialit&eacute; appara&icirc;t</li>
    <li>Activer/D&eacute;sactiver le flux vid&eacute;o</li>
    <li>Activer/D&eacute;sactiver l&rsquo;alarme de d&eacute;tection de mouvements</li>
    <li>R&eacute;voquer l&rsquo;accord&nbsp;: si l&rsquo;utilisateur choisit de le faire, toutes les donn&eacute;es locales et pr&eacute;sentes sur le cloud seront effac&eacute;es et l&rsquo;appareil sera r&eacute;initialis&eacute;</li>
</ul>
<p>Vous pouvez &eacute;galement obtenir davantage de renseignements sur l&rsquo;&eacute;tat de s&eacute;curit&eacute; de votre appareil aupr&egrave;s du Centre de s&eacute;curit&eacute; MIUI.</p>
<p>&nbsp;</p>
<p>Si vous avez pr&eacute;alablement consenti &agrave; ce que nous utilisions vos informations &agrave; caract&egrave;re personnel aux fins susmentionn&eacute;es, vous avez la possibilit&eacute; de changer d&rsquo;avis en nous contactant par courrier ou par e-mail &agrave; l&rsquo;adresse suivante&nbsp;: zmi_privacy@zimiker.com.</p>
<p>&nbsp;</p>
<p>ACC&Egrave;S, MISE &Agrave; JOUR, RECTIFICATION OU SUPPRESSION DE VOS INFORMATIONS &Agrave; CARACT&Egrave;RE PERSONNEL</p>
<p>&nbsp;</p>
<ul>
    <li>Vous avez le droit de demander l&rsquo;acc&egrave;s &agrave; toute autre information &agrave; caract&egrave;re personnel en notre possession, ou d&rsquo;en demander la rectification. Lorsque vous mettez &agrave; jour vos informations &agrave; caract&egrave;re personnel, il vous sera demand&eacute; de v&eacute;rifier votre identit&eacute; avant que nous ne traitions votre demande. Une fois que nous d&eacute;tenons suffisamment d&rsquo;informations pour r&eacute;pondre &agrave; votre demande d&rsquo;acc&egrave;s &agrave; vos informations &agrave; caract&egrave;re personnel ou de rectification de ces derni&egrave;res, nous la traiterons dans les d&eacute;lais pr&eacute;vus par vos lois locales en vigueur en mati&egrave;re de protection des donn&eacute;es.</li>
    <li>G&eacute;n&eacute;ralement, nous proposons ces services gratuitement, mais nous nous r&eacute;servons le droit de vous facturer des frais raisonnables au titre de votre demande d&rsquo;acc&egrave;s &agrave; vos donn&eacute;es.</li>
    <li>Si vous souhaitez avoir acc&egrave;s &agrave; vos donn&eacute;es personnelles en notre possession ou si vous pensez que l&rsquo;une quelconque des informations que nous d&eacute;tenons &agrave; votre sujet est incorrecte, incompl&egrave;te, inappropri&eacute;e ou excessive, veuillez nous contacter par &eacute;crit ou par e-mail d&egrave;s que possible &agrave; l&rsquo;adresse ci-dessous. E-mail&nbsp;: zmi_privacy@zimiker.com.</li>
    <li>Pour de plus amples renseignements concernant les informations &agrave; caract&egrave;re personnel pr&eacute;sentes sur votre compte Mi, vous pouvez &eacute;galement y avoir acc&egrave;s et les modifier en vous rendant &agrave; l&rsquo;adresse suivante&nbsp;:http://account.mi.com ou en vous connectant &agrave; votre compte sur votre appareil.</li>
</ul>
<p>&nbsp;</p>
<p>R&Eacute;TRACTATION</p>
<p>&nbsp;</p>
<ul>
    <li>Vous disposez d&rsquo;un droit de r&eacute;tractation au titre de la collecte, de l&rsquo;utilisation et/ou de la divulgation de vos informations &agrave; caract&egrave;re personnel en notre possession ou sous notre contr&ocirc;le, sur demande. Il est possible de le faire en r&eacute;voquant l&rsquo;accord octroy&eacute; au titre de la confidentialit&eacute; et de l&rsquo;accord dans les param&egrave;tres g&eacute;n&eacute; Nous traiterons votre demande dans un d&eacute;lai raisonnable &agrave; compter du moment o&ugrave; la demande a &eacute;t&eacute; &eacute;mise, et par cons&eacute;quent, nous ne recueillerons, n&rsquo;utiliserons, ni ne divulguerons vos informations &agrave; caract&egrave;re personnel, conform&eacute;ment &agrave; votre demande.</li>
    <li>Vous reconnaissez que votre r&eacute;tractation peut entra&icirc;ner certaines cons&eacute;quences juridiques. En fonction de la port&eacute;e de votre r&eacute;tractation quant &agrave; notre traitement de vos informations &agrave; caract&egrave;re personnel, vous pourriez ne pas &ecirc;tre en mesure de b&eacute;n&eacute;ficier des produits et services de la cam&eacute;ra de s&eacute;curit&eacute; Mi&nbsp;Home.</li>
</ul>
<p>&nbsp;</p>
<p>TRANSFERT DES INFORMATIONS &Agrave; CARACT&Egrave;RE PERSONNEL EN DEHORS DE VOTRE JURIDICTION</p>
<p>&nbsp;</p>
<p>Si nous &eacute;tions amen&eacute;s &agrave; transf&eacute;rer vos informations &agrave; caract&egrave;re personnel en dehors de votre juridiction, vers nos soci&eacute;t&eacute;s affili&eacute;es (entreprises dont les activit&eacute;s sont li&eacute;es &agrave; la communication, aux r&eacute;seaux sociaux, &agrave; la technologie ou aux services cloud) ou vers des Prestataires de services tiers, nous le ferons conform&eacute;ment aux lois en vigueur. Plus particuli&egrave;rement, nous veillerons &agrave; ce que tous les transferts s&rsquo;effectuent conform&eacute;ment aux crit&egrave;res &eacute;tablis par vos lois locales en vigueur en mati&egrave;re de protection des donn&eacute;es, en mettant en place des mesures de s&eacute;curit&eacute; appropri&eacute;es.</p>
<p>&nbsp;</p>
<p>La soci&eacute;t&eacute; ZM peut avoir recours &agrave; des installations outre-mer g&eacute;r&eacute;es ou contr&ocirc;l&eacute;es par ZM &agrave; des fins de traitement ou de sauvegarde de vos informations &agrave; caract&egrave;re personnel. ZM dispose actuellement de centres de donn&eacute;es &agrave; Beijing (Chine), aux &Eacute;tats-Unis, &agrave; Singapour et en France. Ces juridictions d&rsquo;outre-mer peuvent ou non disposer de lois en mati&egrave;re de protection des donn&eacute;es, largement semblables &agrave; celles en vigueur dans votre juridiction locale. Nous sommes susceptibles de transf&eacute;rer vos informations &agrave; caract&egrave;re personnel vers nos installations d&rsquo;outre-mer et de les y conserver. Toutefois, cela ne modifie en rien l&rsquo;un quelconque de nos engagements envers vous quant au fait de prot&eacute;ger vos informations, conform&eacute;ment &agrave; la pr&eacute;sente Politique de confidentialit&eacute;.</p>
<p>&nbsp;</p>
<p>G&Eacute;N&Eacute;RALIT&Eacute;S</p>
<p>&nbsp;</p>
<p>MINEURS</p>
<p>&nbsp;</p>
<p>Nous estimons que les parents sont tenus de surveiller l&rsquo;utilisation que font leurs enfants de nos produits et services. N&eacute;anmoins, notre politique nous engage &agrave; ne pas solliciter d&rsquo;informations &agrave; caract&egrave;re personnel aupr&egrave;s des mineurs, ni &agrave; leur proposer l&rsquo;envoi de supports promotionnels.</p>
<p>ZM ne cherche et ne cherchera pas &agrave; obtenir d&rsquo;informations &agrave; caract&egrave;re personnel provenant de mineurs. Si un parent ou tuteur a des raisons de croire qu&rsquo;un mineur a fourni &agrave; ZM des informations &agrave; caract&egrave;re personnel sans son accord pr&eacute;alable, nous l&rsquo;invitons &agrave; nous contacter afin de garantir leur suppression et la d&eacute;sinscription du mineur de tout service applicable de ZM.</p>
<p>&nbsp;</p>
<p>ORDRE DE PR&Eacute;S&Eacute;ANCE</p>
<p>&nbsp;</p>
<p>Si vous avez consenti &agrave; nos Contrats d&rsquo;utilisation applicables, en cas d&rsquo;incoh&eacute;rence entre ces derniers et la pr&eacute;sente Politique de confidentialit&eacute;, lesdits Contrats d&rsquo;utilisation pr&eacute;vaudront.</p>
<p>&nbsp;</p>
<p>DROIT APPLICABLE</p>
<p>&nbsp;</p>
<p>[La pr&eacute;sente Politique de confidentialit&eacute; est r&eacute;gie par le droit de Singapour.] Nous n&rsquo;avons &eacute;mis aucune garantie ni aucune d&eacute;claration quant &agrave; la conformit&eacute; de la pr&eacute;sente Politique de confidentialit&eacute; avec les lois en mati&egrave;re de confidentialit&eacute; de toute juridiction. Par cons&eacute;quent, vous ne devez pas interpr&eacute;ter la pr&eacute;sente Politique de confidentialit&eacute; conform&eacute;ment &agrave; ceci ou &agrave; toute autre loi.</p>
<p>&nbsp;</p>
<p>MISES &Agrave; JOUR DE LA POLITIQUE DE CONFIDENTIALIT&Eacute;</p>
<p>&nbsp;</p>
<p>Nous r&eacute;visons de fa&ccedil;on r&eacute;guli&egrave;re notre Politique de confidentialit&eacute; et sommes susceptibles de la mettre &agrave; jour afin de refl&eacute;ter les changements apport&eacute;s &agrave; nos pratiques en mati&egrave;re d&rsquo;informations. Si nous apportons des modifications importantes &agrave; notre Politique de confidentialit&eacute;, nous vous en informerons par e-mail (&agrave; l&rsquo;adresse e-mail indiqu&eacute;e dans votre compte) ou publierons les modifications sur tous les sites Web de ZM ou par l&rsquo;entremise de nos appareils mobiles, afin que vous ayez connaissance des informations que nous recueillons et de la fa&ccedil;on dont nous les utilisons. Lesdites modifications apport&eacute;es &agrave; notre Politique de confidentialit&eacute; s&rsquo;appliqueront &agrave; compter de la date d&rsquo;entr&eacute;e en vigueur pr&eacute;vue dans l&rsquo;avis ou sur le site&nbsp;Web. Nous vous encourageons &agrave; consulter cette page de fa&ccedil;on r&eacute;guli&egrave;re pour conna&icirc;tre les informations les plus r&eacute;centes concernant les pratiques en mati&egrave;re de confidentialit&eacute;. Votre utilisation continue des produits et services depuis les sites&nbsp;Web, les t&eacute;l&eacute;phones mobiles et/ou tout autre appareil sera consid&eacute;r&eacute;e comme une acceptation de la mise &agrave; jour de la Politique de confidentialit&eacute;. Nous chercherons &agrave; obtenir votre nouvel accord avant de recueillir davantage d&rsquo;informations &agrave; caract&egrave;re personnel &agrave; votre sujet ou lorsque nous avons l&rsquo;intention de les utiliser ou de les divulguer &agrave; des fins nouvelles.</p>
<p>&nbsp;</p>
<p>DOIS-JE CONSENTIR AUX CONDITIONS G&Eacute;N&Eacute;RALES DE TOUT TIERS&nbsp;?</p>
<p>&nbsp;</p>
<p>Notre Politique de confidentialit&eacute; ne s&rsquo;applique pas aux produits et services propos&eacute;s par un tiers. Les produits et services de la cam&eacute;ra de surveillance Mi&nbsp;Home peuvent inclure des produits, services ou liens vers les sites&nbsp;Web de tiers. D&egrave;s lors que vous utilisez lesdits services ou produits, ces tiers sont &eacute;galement susceptibles de recueillir vos informations. Par cons&eacute;quent, nous vous recommandons vivement de lire la politique de confidentialit&eacute; de ces tiers, tout comme vous avez pris le temps de lire la n&ocirc;tre. Nous ne pourrions en aucun cas &ecirc;tre tenus responsables de l&rsquo;utilisation des informations &agrave; caract&egrave;re personnel que les tiers recueillent &agrave; votre sujet et ne pouvons pas contr&ocirc;ler leurs agissements. Notre Politique de confidentialit&eacute; ne s&rsquo;applique pas &agrave; d&rsquo;autres sites associ&eacute;s &agrave; nos services.</p>
<p>&nbsp;</p>
<p>CONTACTEZ-NOUS</p>
<p>&nbsp;</p>
<p>Pour toute question ou remarque concernant la pr&eacute;sente Politique de confidentialit&eacute; ou pour toute question portant sur la collecte, l&rsquo;utilisation ou la divulgation de la part de ZM de vos informations &agrave; caract&egrave;re personnel, veuillez contacter notre Responsable de la protection des donn&eacute;es &agrave; l&rsquo;adresse indiqu&eacute;e ci-dessous, avec pour objet &laquo;&nbsp;Politique de confidentialit&eacute;&nbsp;&raquo;&nbsp;:</p>
<p>&nbsp;</p>
<p>Zimi&nbsp;corporation.</p>
<p>Room A913, No.159 Chengjiang Road,</p>
<p>Jiangyin City, Jiangsu Province, R&eacute;publique populaire de Chine</p>
<p>E-mail&nbsp;: zmi_privacy@zimiker.com</p>
<p>&nbsp;</p>
<p>Nous vous remercions du temps que vous avez accord&eacute; &agrave; la lecture de notre Politique de confidentialit&eacute;&nbsp;!</p>