var citys = {
    "北京": {
        "father": "",
        "id": "101010600",
        "name": "北京",
        "child": [
            {
                "name": "北京",
                "id": "101010600",
                "child": [
                    {
                        "name": "北京",
                        "id": "101010100",
                        "child": {}
                    },
                    {
                        "name": "海淀",
                        "id": "101010200",
                        "child": {}
                    },
                    {
                        "name": "朝阳",
                        "id": "101010300",
                        "child": {}
                    },
                    {
                        "name": "顺义",
                        "id": "101010400",
                        "child": {}
                    },
                    {
                        "name": "怀柔",
                        "id": "101010500",
                        "child": {}
                    },
                    {
                        "name": "通州",
                        "id": "101010600",
                        "child": {}
                    },
                    {
                        "name": "昌平",
                        "id": "101010700",
                        "child": {}
                    },
                    {
                        "name": "延庆",
                        "id": "101010800",
                        "child": {}
                    },
                    {
                        "name": "丰台",
                        "id": "101010900",
                        "child": {}
                    },
                    {
                        "name": "石景山",
                        "id": "101011000",
                        "child": {}
                    },
                    {
                        "name": "大兴",
                        "id": "101011100",
                        "child": {}
                    },
                    {
                        "name": "房山",
                        "id": "101011200",
                        "child": {}
                    },
                    {
                        "name": "密云",
                        "id": "101011300",
                        "child": {}
                    },
                    {
                        "name": "门头沟",
                        "id": "101011400",
                        "child": {}
                    },
                    {
                        "name": "平谷",
                        "id": "101011500",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "上海": {
        "father": "",
        "id": "101020900",
        "name": "上海",
        "child": [
            {
                "name": "上海",
                "id": "101020900",
                "child": [
                    {
                        "name": "上海",
                        "id": "101020100",
                        "child": {}
                    },
                    {
                        "name": "闵行",
                        "id": "101020200",
                        "child": {}
                    },
                    {
                        "name": "宝山",
                        "id": "101020300",
                        "child": {}
                    },
                    {
                        "name": "嘉定",
                        "id": "101020500",
                        "child": {}
                    },
                    {
                        "name": "浦东新区",
                        "id": "101020600",
                        "child": {}
                    },
                    {
                        "name": "金山",
                        "id": "101020700",
                        "child": {}
                    },
                    {
                        "name": "青浦",
                        "id": "101020800",
                        "child": {}
                    },
                    {
                        "name": "松江",
                        "id": "101020900",
                        "child": {}
                    },
                    {
                        "name": "奉贤",
                        "id": "101021000",
                        "child": {}
                    },
                    {
                        "name": "崇明",
                        "id": "101021100",
                        "child": {}
                    },
                    {
                        "name": "徐汇",
                        "id": "101021200",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "天津": {
        "father": "",
        "id": "101030800",
        "name": "天津",
        "child": [
            {
                "name": "天津",
                "id": "101030800",
                "child": [
                    {
                        "name": "天津",
                        "id": "101030100",
                        "child": {}
                    },
                    {
                        "name": "武清",
                        "id": "101030200",
                        "child": {}
                    },
                    {
                        "name": "宝坻",
                        "id": "101030300",
                        "child": {}
                    },
                    {
                        "name": "东丽",
                        "id": "101030400",
                        "child": {}
                    },
                    {
                        "name": "西青",
                        "id": "101030500",
                        "child": {}
                    },
                    {
                        "name": "北辰",
                        "id": "101030600",
                        "child": {}
                    },
                    {
                        "name": "宁河",
                        "id": "101030700",
                        "child": {}
                    },
                    {
                        "name": "汉沽",
                        "id": "101030800",
                        "child": {}
                    },
                    {
                        "name": "静海",
                        "id": "101030900",
                        "child": {}
                    },
                    {
                        "name": "津南",
                        "id": "101031000",
                        "child": {}
                    },
                    {
                        "name": "塘沽",
                        "id": "101031100",
                        "child": {}
                    },
                    {
                        "name": "大港",
                        "id": "101031200",
                        "child": {}
                    },
                    {
                        "name": "蓟县",
                        "id": "101031400",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "重庆": {
        "father": "",
        "id": "101042400",
        "name": "重庆",
        "child": [
            {
                "name": "重庆",
                "id": "101042400",
                "child": [
                    {
                        "name": "重庆",
                        "id": "101040100",
                        "child": {}
                    },
                    {
                        "name": "永川",
                        "id": "101040200",
                        "child": {}
                    },
                    {
                        "name": "合川",
                        "id": "101040300",
                        "child": {}
                    },
                    {
                        "name": "南川",
                        "id": "101040400",
                        "child": {}
                    },
                    {
                        "name": "江津",
                        "id": "101040500",
                        "child": {}
                    },
                    {
                        "name": "万盛",
                        "id": "101040600",
                        "child": {}
                    },
                    {
                        "name": "渝北",
                        "id": "101040700",
                        "child": {}
                    },
                    {
                        "name": "北碚",
                        "id": "101040800",
                        "child": {}
                    },
                    {
                        "name": "巴南",
                        "id": "101040900",
                        "child": {}
                    },
                    {
                        "name": "长寿",
                        "id": "101041000",
                        "child": {}
                    },
                    {
                        "name": "黔江",
                        "id": "101041100",
                        "child": {}
                    },
                    {
                        "name": "万州",
                        "id": "101041300",
                        "child": {}
                    },
                    {
                        "name": "涪陵",
                        "id": "101041400",
                        "child": {}
                    },
                    {
                        "name": "开县",
                        "id": "101041500",
                        "child": {}
                    },
                    {
                        "name": "城口",
                        "id": "101041600",
                        "child": {}
                    },
                    {
                        "name": "云阳",
                        "id": "101041700",
                        "child": {}
                    },
                    {
                        "name": "巫溪",
                        "id": "101041800",
                        "child": {}
                    },
                    {
                        "name": "奉节",
                        "id": "101041900",
                        "child": {}
                    },
                    {
                        "name": "巫山",
                        "id": "101042000",
                        "child": {}
                    },
                    {
                        "name": "潼南",
                        "id": "101042100",
                        "child": {}
                    },
                    {
                        "name": "垫江",
                        "id": "101042200",
                        "child": {}
                    },
                    {
                        "name": "梁平",
                        "id": "101042300",
                        "child": {}
                    },
                    {
                        "name": "忠县",
                        "id": "101042400",
                        "child": {}
                    },
                    {
                        "name": "石柱",
                        "id": "101042500",
                        "child": {}
                    },
                    {
                        "name": "大足",
                        "id": "101042600",
                        "child": {}
                    },
                    {
                        "name": "荣昌",
                        "id": "101042700",
                        "child": {}
                    },
                    {
                        "name": "铜梁",
                        "id": "101042800",
                        "child": {}
                    },
                    {
                        "name": "璧山",
                        "id": "101042900",
                        "child": {}
                    },
                    {
                        "name": "丰都",
                        "id": "101043000",
                        "child": {}
                    },
                    {
                        "name": "武隆",
                        "id": "101043100",
                        "child": {}
                    },
                    {
                        "name": "彭水",
                        "id": "101043200",
                        "child": {}
                    },
                    {
                        "name": "綦江",
                        "id": "101043300",
                        "child": {}
                    },
                    {
                        "name": "酉阳",
                        "id": "101043400",
                        "child": {}
                    },
                    {
                        "name": "秀山",
                        "id": "101043600",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "黑龙江": {
        "father": "",
        "id": "101050303",
        "name": "黑龙江",
        "child": [
            {
                "name": "哈尔滨",
                "id": "101050104",
                "child": [
                    {
                        "name": "哈尔滨",
                        "id": "101050101",
                        "child": {}
                    },
                    {
                        "name": "双城",
                        "id": "101050102",
                        "child": {}
                    },
                    {
                        "name": "呼兰",
                        "id": "101050103",
                        "child": {}
                    },
                    {
                        "name": "阿城",
                        "id": "101050104",
                        "child": {}
                    },
                    {
                        "name": "宾县",
                        "id": "101050105",
                        "child": {}
                    },
                    {
                        "name": "依兰",
                        "id": "101050106",
                        "child": {}
                    },
                    {
                        "name": "巴彦",
                        "id": "101050107",
                        "child": {}
                    },
                    {
                        "name": "通河",
                        "id": "101050108",
                        "child": {}
                    },
                    {
                        "name": "方正",
                        "id": "101050109",
                        "child": {}
                    },
                    {
                        "name": "延寿",
                        "id": "101050110",
                        "child": {}
                    },
                    {
                        "name": "尚志",
                        "id": "101050111",
                        "child": {}
                    },
                    {
                        "name": "五常",
                        "id": "101050112",
                        "child": {}
                    },
                    {
                        "name": "木兰",
                        "id": "101050113",
                        "child": {}
                    }
                ]
            },
            {
                "name": "齐齐哈尔",
                "id": "101050209",
                "child": [
                    {
                        "name": "齐齐哈尔",
                        "id": "101050201",
                        "child": {}
                    },
                    {
                        "name": "讷河",
                        "id": "101050202",
                        "child": {}
                    },
                    {
                        "name": "龙江",
                        "id": "101050203",
                        "child": {}
                    },
                    {
                        "name": "甘南",
                        "id": "101050204",
                        "child": {}
                    },
                    {
                        "name": "富裕",
                        "id": "101050205",
                        "child": {}
                    },
                    {
                        "name": "依安",
                        "id": "101050206",
                        "child": {}
                    },
                    {
                        "name": "拜泉",
                        "id": "101050207",
                        "child": {}
                    },
                    {
                        "name": "克山",
                        "id": "101050208",
                        "child": {}
                    },
                    {
                        "name": "克东",
                        "id": "101050209",
                        "child": {}
                    },
                    {
                        "name": "泰来",
                        "id": "101050210",
                        "child": {}
                    }
                ]
            },
            {
                "name": "牡丹江",
                "id": "101050303",
                "child": [
                    {
                        "name": "牡丹江",
                        "id": "101050301",
                        "child": {}
                    },
                    {
                        "name": "海林",
                        "id": "101050302",
                        "child": {}
                    },
                    {
                        "name": "穆棱",
                        "id": "101050303",
                        "child": {}
                    },
                    {
                        "name": "林口",
                        "id": "101050304",
                        "child": {}
                    },
                    {
                        "name": "绥芬河",
                        "id": "101050305",
                        "child": {}
                    },
                    {
                        "name": "宁安",
                        "id": "101050306",
                        "child": {}
                    },
                    {
                        "name": "东宁",
                        "id": "101050307",
                        "child": {}
                    }
                ]
            },
            {
                "name": "佳木斯",
                "id": "101050405",
                "child": [
                    {
                        "name": "佳木斯",
                        "id": "101050401",
                        "child": {}
                    },
                    {
                        "name": "汤原",
                        "id": "101050402",
                        "child": {}
                    },
                    {
                        "name": "抚远",
                        "id": "101050403",
                        "child": {}
                    },
                    {
                        "name": "桦川",
                        "id": "101050404",
                        "child": {}
                    },
                    {
                        "name": "桦南",
                        "id": "101050405",
                        "child": {}
                    },
                    {
                        "name": "同江",
                        "id": "101050406",
                        "child": {}
                    },
                    {
                        "name": "富锦",
                        "id": "101050407",
                        "child": {}
                    }
                ]
            },
            {
                "name": "绥化",
                "id": "101050502",
                "child": [
                    {
                        "name": "绥化",
                        "id": "101050501",
                        "child": {}
                    },
                    {
                        "name": "肇东",
                        "id": "101050502",
                        "child": {}
                    },
                    {
                        "name": "安达",
                        "id": "101050503",
                        "child": {}
                    },
                    {
                        "name": "海伦",
                        "id": "101050504",
                        "child": {}
                    },
                    {
                        "name": "明水",
                        "id": "101050505",
                        "child": {}
                    },
                    {
                        "name": "望奎",
                        "id": "101050506",
                        "child": {}
                    },
                    {
                        "name": "兰西",
                        "id": "101050507",
                        "child": {}
                    },
                    {
                        "name": "青冈",
                        "id": "101050508",
                        "child": {}
                    },
                    {
                        "name": "庆安",
                        "id": "101050509",
                        "child": {}
                    },
                    {
                        "name": "绥棱",
                        "id": "101050510",
                        "child": {}
                    }
                ]
            },
            {
                "name": "黑河",
                "id": "101050606",
                "child": [
                    {
                        "name": "黑河",
                        "id": "101050601",
                        "child": {}
                    },
                    {
                        "name": "嫩江",
                        "id": "101050602",
                        "child": {}
                    },
                    {
                        "name": "孙吴",
                        "id": "101050603",
                        "child": {}
                    },
                    {
                        "name": "逊克",
                        "id": "101050604",
                        "child": {}
                    },
                    {
                        "name": "五大连池",
                        "id": "101050605",
                        "child": {}
                    },
                    {
                        "name": "北安",
                        "id": "101050606",
                        "child": {}
                    }
                ]
            },
            {
                "name": "大兴安岭",
                "id": "101050705",
                "child": [
                    {
                        "name": "大兴安岭",
                        "id": "101050701",
                        "child": {}
                    },
                    {
                        "name": "塔河",
                        "id": "101050702",
                        "child": {}
                    },
                    {
                        "name": "漠河",
                        "id": "101050703",
                        "child": {}
                    },
                    {
                        "name": "呼玛",
                        "id": "101050704",
                        "child": {}
                    },
                    {
                        "name": "呼中",
                        "id": "101050705",
                        "child": {}
                    },
                    {
                        "name": "新林",
                        "id": "101050706",
                        "child": {}
                    },
                    {
                        "name": "加格达奇",
                        "id": "101050708",
                        "child": {}
                    }
                ]
            },
            {
                "name": "伊春",
                "id": "101050804",
                "child": [
                    {
                        "name": "伊春",
                        "id": "101050801",
                        "child": {}
                    },
                    {
                        "name": "乌伊岭",
                        "id": "101050802",
                        "child": {}
                    },
                    {
                        "name": "五营",
                        "id": "101050803",
                        "child": {}
                    },
                    {
                        "name": "铁力",
                        "id": "101050804",
                        "child": {}
                    },
                    {
                        "name": "嘉荫",
                        "id": "101050805",
                        "child": {}
                    }
                ]
            },
            {
                "name": "大庆",
                "id": "101050903",
                "child": [
                    {
                        "name": "大庆",
                        "id": "101050901",
                        "child": {}
                    },
                    {
                        "name": "林甸",
                        "id": "101050902",
                        "child": {}
                    },
                    {
                        "name": "肇州",
                        "id": "101050903",
                        "child": {}
                    },
                    {
                        "name": "肇源",
                        "id": "101050904",
                        "child": {}
                    },
                    {
                        "name": "杜尔伯特",
                        "id": "101050905",
                        "child": {}
                    }
                ]
            },
            {
                "name": "七台河",
                "id": "101051003",
                "child": [
                    {
                        "name": "七台河",
                        "id": "101051002",
                        "child": {}
                    },
                    {
                        "name": "勃利",
                        "id": "101051003",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鸡西",
                "id": "101051102",
                "child": [
                    {
                        "name": "鸡西",
                        "id": "101051101",
                        "child": {}
                    },
                    {
                        "name": "虎林",
                        "id": "101051102",
                        "child": {}
                    },
                    {
                        "name": "密山",
                        "id": "101051103",
                        "child": {}
                    },
                    {
                        "name": "鸡东",
                        "id": "101051104",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鹤岗",
                "id": "101051203",
                "child": [
                    {
                        "name": "鹤岗",
                        "id": "101051201",
                        "child": {}
                    },
                    {
                        "name": "绥滨",
                        "id": "101051202",
                        "child": {}
                    },
                    {
                        "name": "萝北",
                        "id": "101051203",
                        "child": {}
                    }
                ]
            },
            {
                "name": "双鸭山",
                "id": "101051302",
                "child": [
                    {
                        "name": "双鸭山",
                        "id": "101051301",
                        "child": {}
                    },
                    {
                        "name": "集贤",
                        "id": "101051302",
                        "child": {}
                    },
                    {
                        "name": "宝清",
                        "id": "101051303",
                        "child": {}
                    },
                    {
                        "name": "饶河",
                        "id": "101051304",
                        "child": {}
                    },
                    {
                        "name": "友谊",
                        "id": "101051305",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "吉林": {
        "father": "",
        "id": "101060701",
        "name": "吉林",
        "child": [
            {
                "name": "长春",
                "id": "101060101",
                "child": [
                    {
                        "name": "长春",
                        "id": "101060101",
                        "child": {}
                    },
                    {
                        "name": "农安",
                        "id": "101060102",
                        "child": {}
                    },
                    {
                        "name": "德惠",
                        "id": "101060103",
                        "child": {}
                    },
                    {
                        "name": "九台",
                        "id": "101060104",
                        "child": {}
                    },
                    {
                        "name": "榆树",
                        "id": "101060105",
                        "child": {}
                    },
                    {
                        "name": "双阳",
                        "id": "101060106",
                        "child": {}
                    }
                ]
            },
            {
                "name": "吉林",
                "id": "101060206",
                "child": [
                    {
                        "name": "吉林",
                        "id": "101060201",
                        "child": {}
                    },
                    {
                        "name": "舒兰",
                        "id": "101060202",
                        "child": {}
                    },
                    {
                        "name": "永吉",
                        "id": "101060203",
                        "child": {}
                    },
                    {
                        "name": "蛟河",
                        "id": "101060204",
                        "child": {}
                    },
                    {
                        "name": "磐石",
                        "id": "101060205",
                        "child": {}
                    },
                    {
                        "name": "桦甸",
                        "id": "101060206",
                        "child": {}
                    }
                ]
            },
            {
                "name": "延吉",
                "id": "101060307",
                "child": [
                    {
                        "name": "延吉",
                        "id": "101060301",
                        "child": {}
                    },
                    {
                        "name": "敦化",
                        "id": "101060302",
                        "child": {}
                    },
                    {
                        "name": "安图",
                        "id": "101060303",
                        "child": {}
                    },
                    {
                        "name": "汪清",
                        "id": "101060304",
                        "child": {}
                    },
                    {
                        "name": "和龙",
                        "id": "101060305",
                        "child": {}
                    },
                    {
                        "name": "龙井",
                        "id": "101060307",
                        "child": {}
                    },
                    {
                        "name": "珲春",
                        "id": "101060308",
                        "child": {}
                    },
                    {
                        "name": "图们",
                        "id": "101060309",
                        "child": {}
                    }
                ]
            },
            {
                "name": "四平",
                "id": "101060401",
                "child": [
                    {
                        "name": "四平",
                        "id": "101060401",
                        "child": {}
                    },
                    {
                        "name": "双辽",
                        "id": "101060402",
                        "child": {}
                    },
                    {
                        "name": "梨树",
                        "id": "101060403",
                        "child": {}
                    },
                    {
                        "name": "公主岭",
                        "id": "101060404",
                        "child": {}
                    },
                    {
                        "name": "伊通",
                        "id": "101060405",
                        "child": {}
                    }
                ]
            },
            {
                "name": "通化",
                "id": "101060506",
                "child": [
                    {
                        "name": "通化",
                        "id": "101060501",
                        "child": {}
                    },
                    {
                        "name": "梅河口",
                        "id": "101060502",
                        "child": {}
                    },
                    {
                        "name": "柳河",
                        "id": "101060503",
                        "child": {}
                    },
                    {
                        "name": "辉南",
                        "id": "101060504",
                        "child": {}
                    },
                    {
                        "name": "集安",
                        "id": "101060505",
                        "child": {}
                    },
                    {
                        "name": "通化县",
                        "id": "101060506",
                        "child": {}
                    }
                ]
            },
            {
                "name": "白城",
                "id": "101060603",
                "child": [
                    {
                        "name": "白城",
                        "id": "101060601",
                        "child": {}
                    },
                    {
                        "name": "洮南",
                        "id": "101060602",
                        "child": {}
                    },
                    {
                        "name": "大安",
                        "id": "101060603",
                        "child": {}
                    },
                    {
                        "name": "镇赉",
                        "id": "101060604",
                        "child": {}
                    },
                    {
                        "name": "通榆",
                        "id": "101060605",
                        "child": {}
                    }
                ]
            },
            {
                "name": "辽源",
                "id": "101060701",
                "child": [
                    {
                        "name": "辽源",
                        "id": "101060701",
                        "child": {}
                    },
                    {
                        "name": "东丰",
                        "id": "101060702",
                        "child": {}
                    }
                ]
            },
            {
                "name": "松原",
                "id": "101060804",
                "child": [
                    {
                        "name": "松原",
                        "id": "101060801",
                        "child": {}
                    },
                    {
                        "name": "乾安",
                        "id": "101060802",
                        "child": {}
                    },
                    {
                        "name": "前郭",
                        "id": "101060803",
                        "child": {}
                    },
                    {
                        "name": "长岭",
                        "id": "101060804",
                        "child": {}
                    },
                    {
                        "name": "扶余",
                        "id": "101060805",
                        "child": {}
                    }
                ]
            },
            {
                "name": "白山",
                "id": "101060905",
                "child": [
                    {
                        "name": "白山",
                        "id": "101060901",
                        "child": {}
                    },
                    {
                        "name": "靖宇",
                        "id": "101060902",
                        "child": {}
                    },
                    {
                        "name": "临江",
                        "id": "101060903",
                        "child": {}
                    },
                    {
                        "name": "东岗",
                        "id": "101060904",
                        "child": {}
                    },
                    {
                        "name": "长白",
                        "id": "101060905",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "辽宁": {
        "father": "",
        "id": "101070501",
        "name": "辽宁",
        "child": [
            {
                "name": "沈阳",
                "id": "101070104",
                "child": [
                    {
                        "name": "沈阳",
                        "id": "101070101",
                        "child": {}
                    },
                    {
                        "name": "辽中",
                        "id": "101070103",
                        "child": {}
                    },
                    {
                        "name": "康平",
                        "id": "101070104",
                        "child": {}
                    },
                    {
                        "name": "法库",
                        "id": "101070105",
                        "child": {}
                    },
                    {
                        "name": "新民",
                        "id": "101070106",
                        "child": {}
                    }
                ]
            },
            {
                "name": "大连",
                "id": "101070204",
                "child": [
                    {
                        "name": "大连",
                        "id": "101070201",
                        "child": {}
                    },
                    {
                        "name": "瓦房店",
                        "id": "101070202",
                        "child": {}
                    },
                    {
                        "name": "金州",
                        "id": "101070203",
                        "child": {}
                    },
                    {
                        "name": "普兰店",
                        "id": "101070204",
                        "child": {}
                    },
                    {
                        "name": "旅顺",
                        "id": "101070205",
                        "child": {}
                    },
                    {
                        "name": "长海",
                        "id": "101070206",
                        "child": {}
                    },
                    {
                        "name": "庄河",
                        "id": "101070207",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鞍山",
                "id": "101070302",
                "child": [
                    {
                        "name": "鞍山",
                        "id": "101070301",
                        "child": {}
                    },
                    {
                        "name": "台安",
                        "id": "101070302",
                        "child": {}
                    },
                    {
                        "name": "岫岩",
                        "id": "101070303",
                        "child": {}
                    },
                    {
                        "name": "海城",
                        "id": "101070304",
                        "child": {}
                    }
                ]
            },
            {
                "name": "抚顺",
                "id": "101070403",
                "child": [
                    {
                        "name": "抚顺",
                        "id": "101070401",
                        "child": {}
                    },
                    {
                        "name": "新宾",
                        "id": "101070402",
                        "child": {}
                    },
                    {
                        "name": "清原",
                        "id": "101070403",
                        "child": {}
                    },
                    {
                        "name": "章党",
                        "id": "101070404",
                        "child": {}
                    }
                ]
            },
            {
                "name": "本溪",
                "id": "101070501",
                "child": [
                    {
                        "name": "本溪",
                        "id": "101070501",
                        "child": {}
                    },
                    {
                        "name": "本溪县",
                        "id": "101070502",
                        "child": {}
                    },
                    {
                        "name": "桓仁",
                        "id": "101070504",
                        "child": {}
                    }
                ]
            },
            {
                "name": "丹东",
                "id": "101070603",
                "child": [
                    {
                        "name": "丹东",
                        "id": "101070601",
                        "child": {}
                    },
                    {
                        "name": "凤城",
                        "id": "101070602",
                        "child": {}
                    },
                    {
                        "name": "宽甸",
                        "id": "101070603",
                        "child": {}
                    },
                    {
                        "name": "东港",
                        "id": "101070604",
                        "child": {}
                    }
                ]
            },
            {
                "name": "锦州",
                "id": "101070706",
                "child": [
                    {
                        "name": "锦州",
                        "id": "101070701",
                        "child": {}
                    },
                    {
                        "name": "凌海",
                        "id": "101070702",
                        "child": {}
                    },
                    {
                        "name": "义县",
                        "id": "101070704",
                        "child": {}
                    },
                    {
                        "name": "黑山",
                        "id": "101070705",
                        "child": {}
                    },
                    {
                        "name": "北镇",
                        "id": "101070706",
                        "child": {}
                    }
                ]
            },
            {
                "name": "营口",
                "id": "101070801",
                "child": [
                    {
                        "name": "营口",
                        "id": "101070801",
                        "child": {}
                    },
                    {
                        "name": "大石桥",
                        "id": "101070802",
                        "child": {}
                    },
                    {
                        "name": "盖州",
                        "id": "101070803",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阜新",
                "id": "101070902",
                "child": [
                    {
                        "name": "阜新",
                        "id": "101070901",
                        "child": {}
                    },
                    {
                        "name": "彰武",
                        "id": "101070902",
                        "child": {}
                    }
                ]
            },
            {
                "name": "辽阳",
                "id": "101071002",
                "child": [
                    {
                        "name": "辽阳",
                        "id": "101071001",
                        "child": {}
                    },
                    {
                        "name": "辽阳县",
                        "id": "101071002",
                        "child": {}
                    },
                    {
                        "name": "灯塔",
                        "id": "101071003",
                        "child": {}
                    },
                    {
                        "name": "弓长岭",
                        "id": "101071004",
                        "child": {}
                    }
                ]
            },
            {
                "name": "铁岭",
                "id": "101071103",
                "child": [
                    {
                        "name": "铁岭",
                        "id": "101071101",
                        "child": {}
                    },
                    {
                        "name": "开原",
                        "id": "101071102",
                        "child": {}
                    },
                    {
                        "name": "昌图",
                        "id": "101071103",
                        "child": {}
                    },
                    {
                        "name": "西丰",
                        "id": "101071104",
                        "child": {}
                    },
                    {
                        "name": "铁法",
                        "id": "101071105",
                        "child": {}
                    }
                ]
            },
            {
                "name": "朝阳",
                "id": "101071205",
                "child": [
                    {
                        "name": "朝阳",
                        "id": "101071201",
                        "child": {}
                    },
                    {
                        "name": "凌源",
                        "id": "101071203",
                        "child": {}
                    },
                    {
                        "name": "喀左",
                        "id": "101071204",
                        "child": {}
                    },
                    {
                        "name": "北票",
                        "id": "101071205",
                        "child": {}
                    },
                    {
                        "name": "建平县",
                        "id": "101071207",
                        "child": {}
                    }
                ]
            },
            {
                "name": "盘锦",
                "id": "101071302",
                "child": [
                    {
                        "name": "盘锦",
                        "id": "101071301",
                        "child": {}
                    },
                    {
                        "name": "大洼",
                        "id": "101071302",
                        "child": {}
                    },
                    {
                        "name": "盘山",
                        "id": "101071303",
                        "child": {}
                    }
                ]
            },
            {
                "name": "葫芦岛",
                "id": "101071403",
                "child": [
                    {
                        "name": "葫芦岛",
                        "id": "101071401",
                        "child": {}
                    },
                    {
                        "name": "建昌",
                        "id": "101071402",
                        "child": {}
                    },
                    {
                        "name": "绥中",
                        "id": "101071403",
                        "child": {}
                    },
                    {
                        "name": "兴城",
                        "id": "101071404",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "内蒙古": {
        "father": "",
        "id": "101080913",
        "name": "内蒙古",
        "child": [
            {
                "name": "呼和浩特",
                "id": "101080102",
                "child": [
                    {
                        "name": "呼和浩特",
                        "id": "101080101",
                        "child": {}
                    },
                    {
                        "name": "土左旗",
                        "id": "101080102",
                        "child": {}
                    },
                    {
                        "name": "托县",
                        "id": "101080103",
                        "child": {}
                    },
                    {
                        "name": "和林",
                        "id": "101080104",
                        "child": {}
                    },
                    {
                        "name": "清水河",
                        "id": "101080105",
                        "child": {}
                    },
                    {
                        "name": "呼市郊区",
                        "id": "101080106",
                        "child": {}
                    },
                    {
                        "name": "武川",
                        "id": "101080107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "包头",
                "id": "101080206",
                "child": [
                    {
                        "name": "包头",
                        "id": "101080201",
                        "child": {}
                    },
                    {
                        "name": "白云鄂博",
                        "id": "101080202",
                        "child": {}
                    },
                    {
                        "name": "满都拉",
                        "id": "101080203",
                        "child": {}
                    },
                    {
                        "name": "土右旗",
                        "id": "101080204",
                        "child": {}
                    },
                    {
                        "name": "固阳",
                        "id": "101080205",
                        "child": {}
                    },
                    {
                        "name": "达茂旗",
                        "id": "101080206",
                        "child": {}
                    }
                ]
            },
            {
                "name": "乌海",
                "id": "101080301",
                "child": [
                    {
                        "name": "乌海",
                        "id": "101080301",
                        "child": {}
                    }
                ]
            },
            {
                "name": "集宁",
                "id": "101080409",
                "child": [
                    {
                        "name": "集宁",
                        "id": "101080401",
                        "child": {}
                    },
                    {
                        "name": "卓资",
                        "id": "101080402",
                        "child": {}
                    },
                    {
                        "name": "化德",
                        "id": "101080403",
                        "child": {}
                    },
                    {
                        "name": "商都",
                        "id": "101080404",
                        "child": {}
                    },
                    {
                        "name": "兴和",
                        "id": "101080406",
                        "child": {}
                    },
                    {
                        "name": "凉城",
                        "id": "101080407",
                        "child": {}
                    },
                    {
                        "name": "察右前旗",
                        "id": "101080408",
                        "child": {}
                    },
                    {
                        "name": "察右中旗",
                        "id": "101080409",
                        "child": {}
                    },
                    {
                        "name": "察右后旗",
                        "id": "101080410",
                        "child": {}
                    },
                    {
                        "name": "四子王旗",
                        "id": "101080411",
                        "child": {}
                    },
                    {
                        "name": "丰镇",
                        "id": "101080412",
                        "child": {}
                    }
                ]
            },
            {
                "name": "通辽",
                "id": "101080504",
                "child": [
                    {
                        "name": "通辽",
                        "id": "101080501",
                        "child": {}
                    },
                    {
                        "name": "舍伯吐",
                        "id": "101080502",
                        "child": {}
                    },
                    {
                        "name": "科左中旗",
                        "id": "101080503",
                        "child": {}
                    },
                    {
                        "name": "科左后旗",
                        "id": "101080504",
                        "child": {}
                    },
                    {
                        "name": "青龙山",
                        "id": "101080505",
                        "child": {}
                    },
                    {
                        "name": "开鲁",
                        "id": "101080506",
                        "child": {}
                    },
                    {
                        "name": "库伦",
                        "id": "101080507",
                        "child": {}
                    },
                    {
                        "name": "奈曼",
                        "id": "101080508",
                        "child": {}
                    },
                    {
                        "name": "扎鲁特",
                        "id": "101080509",
                        "child": {}
                    },
                    {
                        "name": "高力板",
                        "id": "101080510",
                        "child": {}
                    },
                    {
                        "name": "巴雅尔吐胡硕",
                        "id": "101080511",
                        "child": {}
                    }
                ]
            },
            {
                "name": "赤峰",
                "id": "101080610",
                "child": [
                    {
                        "name": "赤峰",
                        "id": "101080601",
                        "child": {}
                    },
                    {
                        "name": "阿鲁旗",
                        "id": "101080603",
                        "child": {}
                    },
                    {
                        "name": "浩尔吐",
                        "id": "101080604",
                        "child": {}
                    },
                    {
                        "name": "巴林左旗",
                        "id": "101080605",
                        "child": {}
                    },
                    {
                        "name": "巴林右旗",
                        "id": "101080606",
                        "child": {}
                    },
                    {
                        "name": "林西",
                        "id": "101080607",
                        "child": {}
                    },
                    {
                        "name": "克什克腾",
                        "id": "101080608",
                        "child": {}
                    },
                    {
                        "name": "翁牛特",
                        "id": "101080609",
                        "child": {}
                    },
                    {
                        "name": "岗子",
                        "id": "101080610",
                        "child": {}
                    },
                    {
                        "name": "喀喇沁",
                        "id": "101080611",
                        "child": {}
                    },
                    {
                        "name": "八里罕",
                        "id": "101080612",
                        "child": {}
                    },
                    {
                        "name": "宁城",
                        "id": "101080613",
                        "child": {}
                    },
                    {
                        "name": "敖汉",
                        "id": "101080614",
                        "child": {}
                    },
                    {
                        "name": "宝国吐",
                        "id": "101080615",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鄂尔多斯",
                "id": "101080704",
                "child": [
                    {
                        "name": "鄂尔多斯",
                        "id": "101080701",
                        "child": {}
                    },
                    {
                        "name": "达拉特",
                        "id": "101080703",
                        "child": {}
                    },
                    {
                        "name": "准格尔",
                        "id": "101080704",
                        "child": {}
                    },
                    {
                        "name": "鄂前旗",
                        "id": "101080705",
                        "child": {}
                    },
                    {
                        "name": "河南",
                        "id": "101080706",
                        "child": {}
                    },
                    {
                        "name": "伊克乌素",
                        "id": "101080707",
                        "child": {}
                    },
                    {
                        "name": "鄂托克",
                        "id": "101080708",
                        "child": {}
                    },
                    {
                        "name": "杭锦旗",
                        "id": "101080709",
                        "child": {}
                    },
                    {
                        "name": "乌审旗",
                        "id": "101080710",
                        "child": {}
                    },
                    {
                        "name": "伊金霍洛",
                        "id": "101080711",
                        "child": {}
                    },
                    {
                        "name": "乌审召",
                        "id": "101080712",
                        "child": {}
                    },
                    {
                        "name": "东胜",
                        "id": "101080713",
                        "child": {}
                    }
                ]
            },
            {
                "name": "临河",
                "id": "101080804",
                "child": [
                    {
                        "name": "临河",
                        "id": "101080801",
                        "child": {}
                    },
                    {
                        "name": "五原",
                        "id": "101080802",
                        "child": {}
                    },
                    {
                        "name": "磴口",
                        "id": "101080803",
                        "child": {}
                    },
                    {
                        "name": "乌前旗",
                        "id": "101080804",
                        "child": {}
                    },
                    {
                        "name": "大佘太",
                        "id": "101080805",
                        "child": {}
                    },
                    {
                        "name": "乌中旗",
                        "id": "101080806",
                        "child": {}
                    },
                    {
                        "name": "乌后旗",
                        "id": "101080807",
                        "child": {}
                    },
                    {
                        "name": "海力素",
                        "id": "101080808",
                        "child": {}
                    },
                    {
                        "name": "那仁宝力格",
                        "id": "101080809",
                        "child": {}
                    },
                    {
                        "name": "杭锦后旗",
                        "id": "101080810",
                        "child": {}
                    }
                ]
            },
            {
                "name": "锡林浩特",
                "id": "101080913",
                "child": [
                    {
                        "name": "锡林浩特",
                        "id": "101080901",
                        "child": {}
                    },
                    {
                        "name": "二连浩特",
                        "id": "101080903",
                        "child": {}
                    },
                    {
                        "name": "阿巴嘎",
                        "id": "101080904",
                        "child": {}
                    },
                    {
                        "name": "苏左旗",
                        "id": "101080906",
                        "child": {}
                    },
                    {
                        "name": "苏右旗",
                        "id": "101080907",
                        "child": {}
                    },
                    {
                        "name": "朱日和",
                        "id": "101080908",
                        "child": {}
                    },
                    {
                        "name": "东乌旗",
                        "id": "101080909",
                        "child": {}
                    },
                    {
                        "name": "西乌旗",
                        "id": "101080910",
                        "child": {}
                    },
                    {
                        "name": "太仆寺",
                        "id": "101080911",
                        "child": {}
                    },
                    {
                        "name": "镶黄旗",
                        "id": "101080912",
                        "child": {}
                    },
                    {
                        "name": "正镶白旗",
                        "id": "101080913",
                        "child": {}
                    },
                    {
                        "name": "正蓝旗",
                        "id": "101080914",
                        "child": {}
                    },
                    {
                        "name": "多伦",
                        "id": "101080915",
                        "child": {}
                    },
                    {
                        "name": "博克图",
                        "id": "101080916",
                        "child": {}
                    },
                    {
                        "name": "乌拉盖",
                        "id": "101080917",
                        "child": {}
                    }
                ]
            },
            {
                "name": "海拉尔",
                "id": "101081002",
                "child": [
                    {
                        "name": "海拉尔",
                        "id": "101081001",
                        "child": {}
                    },
                    {
                        "name": "小二沟",
                        "id": "101081002",
                        "child": {}
                    },
                    {
                        "name": "阿荣旗",
                        "id": "101081003",
                        "child": {}
                    },
                    {
                        "name": "莫力达瓦",
                        "id": "101081004",
                        "child": {}
                    },
                    {
                        "name": "鄂伦春旗",
                        "id": "101081005",
                        "child": {}
                    },
                    {
                        "name": "鄂温克旗",
                        "id": "101081006",
                        "child": {}
                    },
                    {
                        "name": "陈旗",
                        "id": "101081007",
                        "child": {}
                    },
                    {
                        "name": "新左旗",
                        "id": "101081008",
                        "child": {}
                    },
                    {
                        "name": "新右旗",
                        "id": "101081009",
                        "child": {}
                    },
                    {
                        "name": "满洲里",
                        "id": "101081010",
                        "child": {}
                    },
                    {
                        "name": "牙克石",
                        "id": "101081011",
                        "child": {}
                    },
                    {
                        "name": "扎兰屯",
                        "id": "101081012",
                        "child": {}
                    },
                    {
                        "name": "额尔古纳",
                        "id": "101081014",
                        "child": {}
                    },
                    {
                        "name": "根河",
                        "id": "101081015",
                        "child": {}
                    },
                    {
                        "name": "图里河",
                        "id": "101081016",
                        "child": {}
                    }
                ]
            },
            {
                "name": "乌兰浩特",
                "id": "101081106",
                "child": [
                    {
                        "name": "乌兰浩特",
                        "id": "101081101",
                        "child": {}
                    },
                    {
                        "name": "阿尔山",
                        "id": "101081102",
                        "child": {}
                    },
                    {
                        "name": "科右中旗",
                        "id": "101081103",
                        "child": {}
                    },
                    {
                        "name": "胡尔勒",
                        "id": "101081104",
                        "child": {}
                    },
                    {
                        "name": "扎赉特",
                        "id": "101081105",
                        "child": {}
                    },
                    {
                        "name": "索伦",
                        "id": "101081106",
                        "child": {}
                    },
                    {
                        "name": "突泉",
                        "id": "101081107",
                        "child": {}
                    },
                    {
                        "name": "霍林郭勒",
                        "id": "101081108",
                        "child": {}
                    },
                    {
                        "name": "科右前旗",
                        "id": "101081109",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿左旗",
                "id": "101081205",
                "child": [
                    {
                        "name": "阿左旗",
                        "id": "101081201",
                        "child": {}
                    },
                    {
                        "name": "阿右旗",
                        "id": "101081202",
                        "child": {}
                    },
                    {
                        "name": "额济纳",
                        "id": "101081203",
                        "child": {}
                    },
                    {
                        "name": "拐子湖",
                        "id": "101081204",
                        "child": {}
                    },
                    {
                        "name": "吉兰太",
                        "id": "101081205",
                        "child": {}
                    },
                    {
                        "name": "锡林高勒",
                        "id": "101081206",
                        "child": {}
                    },
                    {
                        "name": "头道湖",
                        "id": "101081207",
                        "child": {}
                    },
                    {
                        "name": "中泉子",
                        "id": "101081208",
                        "child": {}
                    },
                    {
                        "name": "诺尔公",
                        "id": "101081209",
                        "child": {}
                    },
                    {
                        "name": "雅布赖",
                        "id": "101081210",
                        "child": {}
                    },
                    {
                        "name": "乌斯泰",
                        "id": "101081211",
                        "child": {}
                    },
                    {
                        "name": "孪井滩",
                        "id": "101081212",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "河北": {
        "father": "",
        "id": "101090601",
        "name": "河北",
        "child": [
            {
                "name": "石家庄",
                "id": "101090103",
                "child": [
                    {
                        "name": "石家庄",
                        "id": "101090101",
                        "child": {}
                    },
                    {
                        "name": "井陉",
                        "id": "101090102",
                        "child": {}
                    },
                    {
                        "name": "正定",
                        "id": "101090103",
                        "child": {}
                    },
                    {
                        "name": "栾城",
                        "id": "101090104",
                        "child": {}
                    },
                    {
                        "name": "行唐",
                        "id": "101090105",
                        "child": {}
                    },
                    {
                        "name": "灵寿",
                        "id": "101090106",
                        "child": {}
                    },
                    {
                        "name": "高邑",
                        "id": "101090107",
                        "child": {}
                    },
                    {
                        "name": "深泽",
                        "id": "101090108",
                        "child": {}
                    },
                    {
                        "name": "赞皇",
                        "id": "101090109",
                        "child": {}
                    },
                    {
                        "name": "无极",
                        "id": "101090110",
                        "child": {}
                    },
                    {
                        "name": "平山",
                        "id": "101090111",
                        "child": {}
                    },
                    {
                        "name": "元氏",
                        "id": "101090112",
                        "child": {}
                    },
                    {
                        "name": "赵县",
                        "id": "101090113",
                        "child": {}
                    },
                    {
                        "name": "辛集",
                        "id": "101090114",
                        "child": {}
                    },
                    {
                        "name": "藁城",
                        "id": "101090115",
                        "child": {}
                    },
                    {
                        "name": "晋州",
                        "id": "101090116",
                        "child": {}
                    },
                    {
                        "name": "新乐",
                        "id": "101090117",
                        "child": {}
                    },
                    {
                        "name": "鹿泉",
                        "id": "101090118",
                        "child": {}
                    }
                ]
            },
            {
                "name": "保定",
                "id": "101090221",
                "child": [
                    {
                        "name": "保定",
                        "id": "101090201",
                        "child": {}
                    },
                    {
                        "name": "满城",
                        "id": "101090202",
                        "child": {}
                    },
                    {
                        "name": "阜平",
                        "id": "101090203",
                        "child": {}
                    },
                    {
                        "name": "徐水",
                        "id": "101090204",
                        "child": {}
                    },
                    {
                        "name": "唐县",
                        "id": "101090205",
                        "child": {}
                    },
                    {
                        "name": "高阳",
                        "id": "101090206",
                        "child": {}
                    },
                    {
                        "name": "容城",
                        "id": "101090207",
                        "child": {}
                    },
                    {
                        "name": "涞源",
                        "id": "101090209",
                        "child": {}
                    },
                    {
                        "name": "望都",
                        "id": "101090210",
                        "child": {}
                    },
                    {
                        "name": "安新",
                        "id": "101090211",
                        "child": {}
                    },
                    {
                        "name": "易县",
                        "id": "101090212",
                        "child": {}
                    },
                    {
                        "name": "曲阳",
                        "id": "101090214",
                        "child": {}
                    },
                    {
                        "name": "蠡县",
                        "id": "101090215",
                        "child": {}
                    },
                    {
                        "name": "顺平",
                        "id": "101090216",
                        "child": {}
                    },
                    {
                        "name": "雄县",
                        "id": "101090217",
                        "child": {}
                    },
                    {
                        "name": "涿州",
                        "id": "101090218",
                        "child": {}
                    },
                    {
                        "name": "定州",
                        "id": "101090219",
                        "child": {}
                    },
                    {
                        "name": "安国",
                        "id": "101090220",
                        "child": {}
                    },
                    {
                        "name": "高碑店",
                        "id": "101090221",
                        "child": {}
                    },
                    {
                        "name": "涞水",
                        "id": "101090222",
                        "child": {}
                    },
                    {
                        "name": "定兴",
                        "id": "101090223",
                        "child": {}
                    },
                    {
                        "name": "清苑",
                        "id": "101090224",
                        "child": {}
                    },
                    {
                        "name": "博野",
                        "id": "101090225",
                        "child": {}
                    }
                ]
            },
            {
                "name": "张家口",
                "id": "101090307",
                "child": [
                    {
                        "name": "张家口",
                        "id": "101090301",
                        "child": {}
                    },
                    {
                        "name": "宣化",
                        "id": "101090302",
                        "child": {}
                    },
                    {
                        "name": "张北",
                        "id": "101090303",
                        "child": {}
                    },
                    {
                        "name": "康保",
                        "id": "101090304",
                        "child": {}
                    },
                    {
                        "name": "沽源",
                        "id": "101090305",
                        "child": {}
                    },
                    {
                        "name": "尚义",
                        "id": "101090306",
                        "child": {}
                    },
                    {
                        "name": "蔚县",
                        "id": "101090307",
                        "child": {}
                    },
                    {
                        "name": "阳原",
                        "id": "101090308",
                        "child": {}
                    },
                    {
                        "name": "怀安",
                        "id": "101090309",
                        "child": {}
                    },
                    {
                        "name": "万全",
                        "id": "101090310",
                        "child": {}
                    },
                    {
                        "name": "怀来",
                        "id": "101090311",
                        "child": {}
                    },
                    {
                        "name": "涿鹿",
                        "id": "101090312",
                        "child": {}
                    },
                    {
                        "name": "赤城",
                        "id": "101090313",
                        "child": {}
                    },
                    {
                        "name": "崇礼",
                        "id": "101090314",
                        "child": {}
                    }
                ]
            },
            {
                "name": "承德",
                "id": "101090406",
                "child": [
                    {
                        "name": "承德",
                        "id": "101090402",
                        "child": {}
                    },
                    {
                        "name": "承德县",
                        "id": "101090403",
                        "child": {}
                    },
                    {
                        "name": "兴隆",
                        "id": "101090404",
                        "child": {}
                    },
                    {
                        "name": "平泉",
                        "id": "101090405",
                        "child": {}
                    },
                    {
                        "name": "滦平",
                        "id": "101090406",
                        "child": {}
                    },
                    {
                        "name": "隆化",
                        "id": "101090407",
                        "child": {}
                    },
                    {
                        "name": "丰宁",
                        "id": "101090408",
                        "child": {}
                    },
                    {
                        "name": "宽城",
                        "id": "101090409",
                        "child": {}
                    },
                    {
                        "name": "围场",
                        "id": "101090410",
                        "child": {}
                    }
                ]
            },
            {
                "name": "唐山",
                "id": "101090504",
                "child": [
                    {
                        "name": "唐山",
                        "id": "101090501",
                        "child": {}
                    },
                    {
                        "name": "丰南",
                        "id": "101090502",
                        "child": {}
                    },
                    {
                        "name": "丰润",
                        "id": "101090503",
                        "child": {}
                    },
                    {
                        "name": "滦县",
                        "id": "101090504",
                        "child": {}
                    },
                    {
                        "name": "滦南",
                        "id": "101090505",
                        "child": {}
                    },
                    {
                        "name": "乐亭",
                        "id": "101090506",
                        "child": {}
                    },
                    {
                        "name": "迁西",
                        "id": "101090507",
                        "child": {}
                    },
                    {
                        "name": "玉田",
                        "id": "101090508",
                        "child": {}
                    },
                    {
                        "name": "唐海",
                        "id": "101090509",
                        "child": {}
                    },
                    {
                        "name": "遵化",
                        "id": "101090510",
                        "child": {}
                    },
                    {
                        "name": "迁安",
                        "id": "101090511",
                        "child": {}
                    },
                    {
                        "name": "曹妃甸",
                        "id": "101090512",
                        "child": {}
                    }
                ]
            },
            {
                "name": "廊坊",
                "id": "101090601",
                "child": [
                    {
                        "name": "廊坊",
                        "id": "101090601",
                        "child": {}
                    },
                    {
                        "name": "固安",
                        "id": "101090602",
                        "child": {}
                    },
                    {
                        "name": "永清",
                        "id": "101090603",
                        "child": {}
                    },
                    {
                        "name": "香河",
                        "id": "101090604",
                        "child": {}
                    },
                    {
                        "name": "大城",
                        "id": "101090605",
                        "child": {}
                    },
                    {
                        "name": "文安",
                        "id": "101090606",
                        "child": {}
                    },
                    {
                        "name": "大厂",
                        "id": "101090607",
                        "child": {}
                    },
                    {
                        "name": "霸州",
                        "id": "101090608",
                        "child": {}
                    },
                    {
                        "name": "三河",
                        "id": "101090609",
                        "child": {}
                    }
                ]
            },
            {
                "name": "沧州",
                "id": "101090703",
                "child": [
                    {
                        "name": "沧州",
                        "id": "101090701",
                        "child": {}
                    },
                    {
                        "name": "青县",
                        "id": "101090702",
                        "child": {}
                    },
                    {
                        "name": "东光",
                        "id": "101090703",
                        "child": {}
                    },
                    {
                        "name": "海兴",
                        "id": "101090704",
                        "child": {}
                    },
                    {
                        "name": "盐山",
                        "id": "101090705",
                        "child": {}
                    },
                    {
                        "name": "肃宁",
                        "id": "101090706",
                        "child": {}
                    },
                    {
                        "name": "南皮",
                        "id": "101090707",
                        "child": {}
                    },
                    {
                        "name": "吴桥",
                        "id": "101090708",
                        "child": {}
                    },
                    {
                        "name": "献县",
                        "id": "101090709",
                        "child": {}
                    },
                    {
                        "name": "孟村",
                        "id": "101090710",
                        "child": {}
                    },
                    {
                        "name": "泊头",
                        "id": "101090711",
                        "child": {}
                    },
                    {
                        "name": "任丘",
                        "id": "101090712",
                        "child": {}
                    },
                    {
                        "name": "黄骅",
                        "id": "101090713",
                        "child": {}
                    },
                    {
                        "name": "河间",
                        "id": "101090714",
                        "child": {}
                    },
                    {
                        "name": "沧县",
                        "id": "101090716",
                        "child": {}
                    }
                ]
            },
            {
                "name": "衡水",
                "id": "101090808",
                "child": [
                    {
                        "name": "衡水",
                        "id": "101090801",
                        "child": {}
                    },
                    {
                        "name": "枣强",
                        "id": "101090802",
                        "child": {}
                    },
                    {
                        "name": "武邑",
                        "id": "101090803",
                        "child": {}
                    },
                    {
                        "name": "武强",
                        "id": "101090804",
                        "child": {}
                    },
                    {
                        "name": "饶阳",
                        "id": "101090805",
                        "child": {}
                    },
                    {
                        "name": "安平",
                        "id": "101090806",
                        "child": {}
                    },
                    {
                        "name": "故城",
                        "id": "101090807",
                        "child": {}
                    },
                    {
                        "name": "景县",
                        "id": "101090808",
                        "child": {}
                    },
                    {
                        "name": "阜城",
                        "id": "101090809",
                        "child": {}
                    },
                    {
                        "name": "冀州",
                        "id": "101090810",
                        "child": {}
                    },
                    {
                        "name": "深州",
                        "id": "101090811",
                        "child": {}
                    }
                ]
            },
            {
                "name": "邢台",
                "id": "101090907",
                "child": [
                    {
                        "name": "邢台",
                        "id": "101090901",
                        "child": {}
                    },
                    {
                        "name": "临城",
                        "id": "101090902",
                        "child": {}
                    },
                    {
                        "name": "内丘",
                        "id": "101090904",
                        "child": {}
                    },
                    {
                        "name": "柏乡",
                        "id": "101090905",
                        "child": {}
                    },
                    {
                        "name": "隆尧",
                        "id": "101090906",
                        "child": {}
                    },
                    {
                        "name": "南和",
                        "id": "101090907",
                        "child": {}
                    },
                    {
                        "name": "宁晋",
                        "id": "101090908",
                        "child": {}
                    },
                    {
                        "name": "巨鹿",
                        "id": "101090909",
                        "child": {}
                    },
                    {
                        "name": "新河",
                        "id": "101090910",
                        "child": {}
                    },
                    {
                        "name": "广宗",
                        "id": "101090911",
                        "child": {}
                    },
                    {
                        "name": "平乡",
                        "id": "101090912",
                        "child": {}
                    },
                    {
                        "name": "威县",
                        "id": "101090913",
                        "child": {}
                    },
                    {
                        "name": "清河",
                        "id": "101090914",
                        "child": {}
                    },
                    {
                        "name": "临西",
                        "id": "101090915",
                        "child": {}
                    },
                    {
                        "name": "南宫",
                        "id": "101090916",
                        "child": {}
                    },
                    {
                        "name": "沙河",
                        "id": "101090917",
                        "child": {}
                    },
                    {
                        "name": "任县",
                        "id": "101090918",
                        "child": {}
                    }
                ]
            },
            {
                "name": "邯郸",
                "id": "101091012",
                "child": [
                    {
                        "name": "邯郸",
                        "id": "101091001",
                        "child": {}
                    },
                    {
                        "name": "峰峰",
                        "id": "101091002",
                        "child": {}
                    },
                    {
                        "name": "临漳",
                        "id": "101091003",
                        "child": {}
                    },
                    {
                        "name": "成安",
                        "id": "101091004",
                        "child": {}
                    },
                    {
                        "name": "大名",
                        "id": "101091005",
                        "child": {}
                    },
                    {
                        "name": "涉县",
                        "id": "101091006",
                        "child": {}
                    },
                    {
                        "name": "磁县",
                        "id": "101091007",
                        "child": {}
                    },
                    {
                        "name": "肥乡",
                        "id": "101091008",
                        "child": {}
                    },
                    {
                        "name": "永年",
                        "id": "101091009",
                        "child": {}
                    },
                    {
                        "name": "邱县",
                        "id": "101091010",
                        "child": {}
                    },
                    {
                        "name": "鸡泽",
                        "id": "101091011",
                        "child": {}
                    },
                    {
                        "name": "广平",
                        "id": "101091012",
                        "child": {}
                    },
                    {
                        "name": "馆陶",
                        "id": "101091013",
                        "child": {}
                    },
                    {
                        "name": "魏县",
                        "id": "101091014",
                        "child": {}
                    },
                    {
                        "name": "曲周",
                        "id": "101091015",
                        "child": {}
                    },
                    {
                        "name": "武安",
                        "id": "101091016",
                        "child": {}
                    }
                ]
            },
            {
                "name": "秦皇岛",
                "id": "101091101",
                "child": [
                    {
                        "name": "秦皇岛",
                        "id": "101091101",
                        "child": {}
                    },
                    {
                        "name": "青龙",
                        "id": "101091102",
                        "child": {}
                    },
                    {
                        "name": "昌黎",
                        "id": "101091103",
                        "child": {}
                    },
                    {
                        "name": "抚宁",
                        "id": "101091104",
                        "child": {}
                    },
                    {
                        "name": "卢龙",
                        "id": "101091105",
                        "child": {}
                    },
                    {
                        "name": "北戴河",
                        "id": "101091106",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "山西": {
        "father": "",
        "id": "101100302",
        "name": "山西",
        "child": [
            {
                "name": "太原",
                "id": "101100107",
                "child": [
                    {
                        "name": "太原",
                        "id": "101100101",
                        "child": {}
                    },
                    {
                        "name": "清徐",
                        "id": "101100102",
                        "child": {}
                    },
                    {
                        "name": "阳曲",
                        "id": "101100103",
                        "child": {}
                    },
                    {
                        "name": "娄烦",
                        "id": "101100104",
                        "child": {}
                    },
                    {
                        "name": "古交",
                        "id": "101100105",
                        "child": {}
                    },
                    {
                        "name": "尖草坪区",
                        "id": "101100106",
                        "child": {}
                    },
                    {
                        "name": "小店区",
                        "id": "101100107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "大同",
                "id": "101100208",
                "child": [
                    {
                        "name": "大同",
                        "id": "101100201",
                        "child": {}
                    },
                    {
                        "name": "阳高",
                        "id": "101100202",
                        "child": {}
                    },
                    {
                        "name": "大同县",
                        "id": "101100203",
                        "child": {}
                    },
                    {
                        "name": "天镇",
                        "id": "101100204",
                        "child": {}
                    },
                    {
                        "name": "广灵",
                        "id": "101100205",
                        "child": {}
                    },
                    {
                        "name": "灵丘",
                        "id": "101100206",
                        "child": {}
                    },
                    {
                        "name": "浑源",
                        "id": "101100207",
                        "child": {}
                    },
                    {
                        "name": "左云",
                        "id": "101100208",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阳泉",
                "id": "101100302",
                "child": [
                    {
                        "name": "阳泉",
                        "id": "101100301",
                        "child": {}
                    },
                    {
                        "name": "盂县",
                        "id": "101100302",
                        "child": {}
                    },
                    {
                        "name": "平定",
                        "id": "101100303",
                        "child": {}
                    }
                ]
            },
            {
                "name": "晋中",
                "id": "101100410",
                "child": [
                    {
                        "name": "晋中",
                        "id": "101100401",
                        "child": {}
                    },
                    {
                        "name": "榆次",
                        "id": "101100402",
                        "child": {}
                    },
                    {
                        "name": "榆社",
                        "id": "101100403",
                        "child": {}
                    },
                    {
                        "name": "左权",
                        "id": "101100404",
                        "child": {}
                    },
                    {
                        "name": "和顺",
                        "id": "101100405",
                        "child": {}
                    },
                    {
                        "name": "昔阳",
                        "id": "101100406",
                        "child": {}
                    },
                    {
                        "name": "寿阳",
                        "id": "101100407",
                        "child": {}
                    },
                    {
                        "name": "太谷",
                        "id": "101100408",
                        "child": {}
                    },
                    {
                        "name": "祁县",
                        "id": "101100409",
                        "child": {}
                    },
                    {
                        "name": "平遥",
                        "id": "101100410",
                        "child": {}
                    },
                    {
                        "name": "灵石",
                        "id": "101100411",
                        "child": {}
                    },
                    {
                        "name": "介休",
                        "id": "101100412",
                        "child": {}
                    }
                ]
            },
            {
                "name": "长治",
                "id": "101100504",
                "child": [
                    {
                        "name": "长治",
                        "id": "101100501",
                        "child": {}
                    },
                    {
                        "name": "黎城",
                        "id": "101100502",
                        "child": {}
                    },
                    {
                        "name": "屯留",
                        "id": "101100503",
                        "child": {}
                    },
                    {
                        "name": "潞城",
                        "id": "101100504",
                        "child": {}
                    },
                    {
                        "name": "襄垣",
                        "id": "101100505",
                        "child": {}
                    },
                    {
                        "name": "平顺",
                        "id": "101100506",
                        "child": {}
                    },
                    {
                        "name": "武乡",
                        "id": "101100507",
                        "child": {}
                    },
                    {
                        "name": "沁县",
                        "id": "101100508",
                        "child": {}
                    },
                    {
                        "name": "长子",
                        "id": "101100509",
                        "child": {}
                    },
                    {
                        "name": "沁源",
                        "id": "101100510",
                        "child": {}
                    },
                    {
                        "name": "壶关",
                        "id": "101100511",
                        "child": {}
                    }
                ]
            },
            {
                "name": "晋城",
                "id": "101100603",
                "child": [
                    {
                        "name": "晋城",
                        "id": "101100601",
                        "child": {}
                    },
                    {
                        "name": "沁水",
                        "id": "101100602",
                        "child": {}
                    },
                    {
                        "name": "阳城",
                        "id": "101100603",
                        "child": {}
                    },
                    {
                        "name": "陵川",
                        "id": "101100604",
                        "child": {}
                    },
                    {
                        "name": "高平",
                        "id": "101100605",
                        "child": {}
                    },
                    {
                        "name": "泽州",
                        "id": "101100606",
                        "child": {}
                    }
                ]
            },
            {
                "name": "临汾",
                "id": "101100705",
                "child": [
                    {
                        "name": "临汾",
                        "id": "101100701",
                        "child": {}
                    },
                    {
                        "name": "曲沃",
                        "id": "101100702",
                        "child": {}
                    },
                    {
                        "name": "永和",
                        "id": "101100703",
                        "child": {}
                    },
                    {
                        "name": "隰县",
                        "id": "101100704",
                        "child": {}
                    },
                    {
                        "name": "大宁",
                        "id": "101100705",
                        "child": {}
                    },
                    {
                        "name": "吉县",
                        "id": "101100706",
                        "child": {}
                    },
                    {
                        "name": "襄汾",
                        "id": "101100707",
                        "child": {}
                    },
                    {
                        "name": "蒲县",
                        "id": "101100708",
                        "child": {}
                    },
                    {
                        "name": "汾西",
                        "id": "101100709",
                        "child": {}
                    },
                    {
                        "name": "洪洞",
                        "id": "101100710",
                        "child": {}
                    },
                    {
                        "name": "霍州",
                        "id": "101100711",
                        "child": {}
                    },
                    {
                        "name": "乡宁",
                        "id": "101100712",
                        "child": {}
                    },
                    {
                        "name": "翼城",
                        "id": "101100713",
                        "child": {}
                    },
                    {
                        "name": "侯马",
                        "id": "101100714",
                        "child": {}
                    },
                    {
                        "name": "浮山",
                        "id": "101100715",
                        "child": {}
                    },
                    {
                        "name": "安泽",
                        "id": "101100716",
                        "child": {}
                    },
                    {
                        "name": "古县",
                        "id": "101100717",
                        "child": {}
                    }
                ]
            },
            {
                "name": "运城",
                "id": "101100803",
                "child": [
                    {
                        "name": "运城",
                        "id": "101100801",
                        "child": {}
                    },
                    {
                        "name": "临猗",
                        "id": "101100802",
                        "child": {}
                    },
                    {
                        "name": "稷山",
                        "id": "101100803",
                        "child": {}
                    },
                    {
                        "name": "万荣",
                        "id": "101100804",
                        "child": {}
                    },
                    {
                        "name": "河津",
                        "id": "101100805",
                        "child": {}
                    },
                    {
                        "name": "新绛",
                        "id": "101100806",
                        "child": {}
                    },
                    {
                        "name": "绛县",
                        "id": "101100807",
                        "child": {}
                    },
                    {
                        "name": "闻喜",
                        "id": "101100808",
                        "child": {}
                    },
                    {
                        "name": "垣曲",
                        "id": "101100809",
                        "child": {}
                    },
                    {
                        "name": "永济",
                        "id": "101100810",
                        "child": {}
                    },
                    {
                        "name": "芮城",
                        "id": "101100811",
                        "child": {}
                    },
                    {
                        "name": "夏县",
                        "id": "101100812",
                        "child": {}
                    },
                    {
                        "name": "平陆",
                        "id": "101100813",
                        "child": {}
                    }
                ]
            },
            {
                "name": "朔州",
                "id": "101100904",
                "child": [
                    {
                        "name": "朔州",
                        "id": "101100901",
                        "child": {}
                    },
                    {
                        "name": "平鲁",
                        "id": "101100902",
                        "child": {}
                    },
                    {
                        "name": "山阴",
                        "id": "101100903",
                        "child": {}
                    },
                    {
                        "name": "右玉",
                        "id": "101100904",
                        "child": {}
                    },
                    {
                        "name": "应县",
                        "id": "101100905",
                        "child": {}
                    },
                    {
                        "name": "怀仁",
                        "id": "101100906",
                        "child": {}
                    }
                ]
            },
            {
                "name": "忻州",
                "id": "101101004",
                "child": [
                    {
                        "name": "忻州",
                        "id": "101101001",
                        "child": {}
                    },
                    {
                        "name": "定襄",
                        "id": "101101002",
                        "child": {}
                    },
                    {
                        "name": "五台县",
                        "id": "101101003",
                        "child": {}
                    },
                    {
                        "name": "河曲",
                        "id": "101101004",
                        "child": {}
                    },
                    {
                        "name": "偏关",
                        "id": "101101005",
                        "child": {}
                    },
                    {
                        "name": "神池",
                        "id": "101101006",
                        "child": {}
                    },
                    {
                        "name": "宁武",
                        "id": "101101007",
                        "child": {}
                    },
                    {
                        "name": "代县",
                        "id": "101101008",
                        "child": {}
                    },
                    {
                        "name": "繁峙",
                        "id": "101101009",
                        "child": {}
                    },
                    {
                        "name": "五台山",
                        "id": "101101010",
                        "child": {}
                    },
                    {
                        "name": "保德",
                        "id": "101101011",
                        "child": {}
                    },
                    {
                        "name": "静乐",
                        "id": "101101012",
                        "child": {}
                    },
                    {
                        "name": "岢岚",
                        "id": "101101013",
                        "child": {}
                    },
                    {
                        "name": "五寨",
                        "id": "101101014",
                        "child": {}
                    },
                    {
                        "name": "原平",
                        "id": "101101015",
                        "child": {}
                    }
                ]
            },
            {
                "name": "吕梁",
                "id": "101101105",
                "child": [
                    {
                        "name": "吕梁",
                        "id": "101101100",
                        "child": {}
                    },
                    {
                        "name": "离石",
                        "id": "101101101",
                        "child": {}
                    },
                    {
                        "name": "临县",
                        "id": "101101102",
                        "child": {}
                    },
                    {
                        "name": "兴县",
                        "id": "101101103",
                        "child": {}
                    },
                    {
                        "name": "岚县",
                        "id": "101101104",
                        "child": {}
                    },
                    {
                        "name": "柳林",
                        "id": "101101105",
                        "child": {}
                    },
                    {
                        "name": "石楼",
                        "id": "101101106",
                        "child": {}
                    },
                    {
                        "name": "方山",
                        "id": "101101107",
                        "child": {}
                    },
                    {
                        "name": "交口",
                        "id": "101101108",
                        "child": {}
                    },
                    {
                        "name": "中阳",
                        "id": "101101109",
                        "child": {}
                    },
                    {
                        "name": "孝义",
                        "id": "101101110",
                        "child": {}
                    },
                    {
                        "name": "汾阳",
                        "id": "101101111",
                        "child": {}
                    },
                    {
                        "name": "文水",
                        "id": "101101112",
                        "child": {}
                    },
                    {
                        "name": "交城",
                        "id": "101101113",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "陕西": {
        "father": "",
        "id": "101110804",
        "name": "陕西",
        "child": [
            {
                "name": "西安",
                "id": "101110106",
                "child": [
                    {
                        "name": "西安",
                        "id": "101110101",
                        "child": {}
                    },
                    {
                        "name": "长安",
                        "id": "101110102",
                        "child": {}
                    },
                    {
                        "name": "临潼",
                        "id": "101110103",
                        "child": {}
                    },
                    {
                        "name": "蓝田",
                        "id": "101110104",
                        "child": {}
                    },
                    {
                        "name": "周至",
                        "id": "101110105",
                        "child": {}
                    },
                    {
                        "name": "户县",
                        "id": "101110106",
                        "child": {}
                    },
                    {
                        "name": "高陵",
                        "id": "101110107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "咸阳",
                "id": "101110201",
                "child": [
                    {
                        "name": "咸阳",
                        "id": "101110200",
                        "child": {}
                    },
                    {
                        "name": "三原",
                        "id": "101110201",
                        "child": {}
                    },
                    {
                        "name": "礼泉",
                        "id": "101110202",
                        "child": {}
                    },
                    {
                        "name": "永寿",
                        "id": "101110203",
                        "child": {}
                    },
                    {
                        "name": "淳化",
                        "id": "101110204",
                        "child": {}
                    },
                    {
                        "name": "泾阳",
                        "id": "101110205",
                        "child": {}
                    },
                    {
                        "name": "武功",
                        "id": "101110206",
                        "child": {}
                    },
                    {
                        "name": "乾县",
                        "id": "101110207",
                        "child": {}
                    },
                    {
                        "name": "彬县",
                        "id": "101110208",
                        "child": {}
                    },
                    {
                        "name": "长武",
                        "id": "101110209",
                        "child": {}
                    },
                    {
                        "name": "旬邑",
                        "id": "101110210",
                        "child": {}
                    },
                    {
                        "name": "兴平",
                        "id": "101110211",
                        "child": {}
                    }
                ]
            },
            {
                "name": "延安",
                "id": "101110308",
                "child": [
                    {
                        "name": "延安",
                        "id": "101110300",
                        "child": {}
                    },
                    {
                        "name": "延长",
                        "id": "101110301",
                        "child": {}
                    },
                    {
                        "name": "延川",
                        "id": "101110302",
                        "child": {}
                    },
                    {
                        "name": "子长",
                        "id": "101110303",
                        "child": {}
                    },
                    {
                        "name": "宜川",
                        "id": "101110304",
                        "child": {}
                    },
                    {
                        "name": "富县",
                        "id": "101110305",
                        "child": {}
                    },
                    {
                        "name": "志丹",
                        "id": "101110306",
                        "child": {}
                    },
                    {
                        "name": "安塞",
                        "id": "101110307",
                        "child": {}
                    },
                    {
                        "name": "甘泉",
                        "id": "101110308",
                        "child": {}
                    },
                    {
                        "name": "洛川",
                        "id": "101110309",
                        "child": {}
                    },
                    {
                        "name": "黄陵",
                        "id": "101110310",
                        "child": {}
                    },
                    {
                        "name": "黄龙",
                        "id": "101110311",
                        "child": {}
                    },
                    {
                        "name": "吴起",
                        "id": "101110312",
                        "child": {}
                    }
                ]
            },
            {
                "name": "榆林",
                "id": "101110404",
                "child": [
                    {
                        "name": "榆林",
                        "id": "101110401",
                        "child": {}
                    },
                    {
                        "name": "府谷",
                        "id": "101110402",
                        "child": {}
                    },
                    {
                        "name": "神木",
                        "id": "101110403",
                        "child": {}
                    },
                    {
                        "name": "佳县",
                        "id": "101110404",
                        "child": {}
                    },
                    {
                        "name": "定边",
                        "id": "101110405",
                        "child": {}
                    },
                    {
                        "name": "靖边",
                        "id": "101110406",
                        "child": {}
                    },
                    {
                        "name": "横山",
                        "id": "101110407",
                        "child": {}
                    },
                    {
                        "name": "米脂",
                        "id": "101110408",
                        "child": {}
                    },
                    {
                        "name": "子洲",
                        "id": "101110409",
                        "child": {}
                    },
                    {
                        "name": "绥德",
                        "id": "101110410",
                        "child": {}
                    },
                    {
                        "name": "清涧",
                        "id": "101110412",
                        "child": {}
                    },
                    {
                        "name": "榆阳",
                        "id": "101110413",
                        "child": {}
                    }
                ]
            },
            {
                "name": "渭南",
                "id": "101110508",
                "child": [
                    {
                        "name": "渭南",
                        "id": "101110501",
                        "child": {}
                    },
                    {
                        "name": "华县",
                        "id": "101110502",
                        "child": {}
                    },
                    {
                        "name": "潼关",
                        "id": "101110503",
                        "child": {}
                    },
                    {
                        "name": "大荔",
                        "id": "101110504",
                        "child": {}
                    },
                    {
                        "name": "白水",
                        "id": "101110505",
                        "child": {}
                    },
                    {
                        "name": "富平",
                        "id": "101110506",
                        "child": {}
                    },
                    {
                        "name": "蒲城",
                        "id": "101110507",
                        "child": {}
                    },
                    {
                        "name": "澄城",
                        "id": "101110508",
                        "child": {}
                    },
                    {
                        "name": "合阳",
                        "id": "101110509",
                        "child": {}
                    },
                    {
                        "name": "韩城",
                        "id": "101110510",
                        "child": {}
                    },
                    {
                        "name": "华阴",
                        "id": "101110511",
                        "child": {}
                    }
                ]
            },
            {
                "name": "商洛",
                "id": "101110604",
                "child": [
                    {
                        "name": "商洛",
                        "id": "101110601",
                        "child": {}
                    },
                    {
                        "name": "洛南",
                        "id": "101110602",
                        "child": {}
                    },
                    {
                        "name": "柞水",
                        "id": "101110603",
                        "child": {}
                    },
                    {
                        "name": "商州",
                        "id": "101110604",
                        "child": {}
                    },
                    {
                        "name": "镇安",
                        "id": "101110605",
                        "child": {}
                    },
                    {
                        "name": "丹凤",
                        "id": "101110606",
                        "child": {}
                    },
                    {
                        "name": "商南",
                        "id": "101110607",
                        "child": {}
                    },
                    {
                        "name": "山阳",
                        "id": "101110608",
                        "child": {}
                    }
                ]
            },
            {
                "name": "安康",
                "id": "101110703",
                "child": [
                    {
                        "name": "安康",
                        "id": "101110701",
                        "child": {}
                    },
                    {
                        "name": "紫阳",
                        "id": "101110702",
                        "child": {}
                    },
                    {
                        "name": "石泉",
                        "id": "101110703",
                        "child": {}
                    },
                    {
                        "name": "汉阴",
                        "id": "101110704",
                        "child": {}
                    },
                    {
                        "name": "旬阳",
                        "id": "101110705",
                        "child": {}
                    },
                    {
                        "name": "岚皋",
                        "id": "101110706",
                        "child": {}
                    },
                    {
                        "name": "平利",
                        "id": "101110707",
                        "child": {}
                    },
                    {
                        "name": "白河",
                        "id": "101110708",
                        "child": {}
                    },
                    {
                        "name": "镇坪",
                        "id": "101110709",
                        "child": {}
                    },
                    {
                        "name": "宁陕",
                        "id": "101110710",
                        "child": {}
                    }
                ]
            },
            {
                "name": "汉中",
                "id": "101110804",
                "child": [
                    {
                        "name": "汉中",
                        "id": "101110801",
                        "child": {}
                    },
                    {
                        "name": "略阳",
                        "id": "101110802",
                        "child": {}
                    },
                    {
                        "name": "勉县",
                        "id": "101110803",
                        "child": {}
                    },
                    {
                        "name": "留坝",
                        "id": "101110804",
                        "child": {}
                    },
                    {
                        "name": "洋县",
                        "id": "101110805",
                        "child": {}
                    },
                    {
                        "name": "城固",
                        "id": "101110806",
                        "child": {}
                    },
                    {
                        "name": "西乡",
                        "id": "101110807",
                        "child": {}
                    },
                    {
                        "name": "佛坪",
                        "id": "101110808",
                        "child": {}
                    },
                    {
                        "name": "宁强",
                        "id": "101110809",
                        "child": {}
                    },
                    {
                        "name": "南郑",
                        "id": "101110810",
                        "child": {}
                    },
                    {
                        "name": "镇巴",
                        "id": "101110811",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宝鸡",
                "id": "101110901",
                "child": [
                    {
                        "name": "宝鸡",
                        "id": "101110901",
                        "child": {}
                    },
                    {
                        "name": "千阳",
                        "id": "101110903",
                        "child": {}
                    },
                    {
                        "name": "麟游",
                        "id": "101110904",
                        "child": {}
                    },
                    {
                        "name": "岐山",
                        "id": "101110905",
                        "child": {}
                    },
                    {
                        "name": "凤翔",
                        "id": "101110906",
                        "child": {}
                    },
                    {
                        "name": "扶风",
                        "id": "101110907",
                        "child": {}
                    },
                    {
                        "name": "眉县",
                        "id": "101110908",
                        "child": {}
                    },
                    {
                        "name": "太白",
                        "id": "101110909",
                        "child": {}
                    },
                    {
                        "name": "凤县",
                        "id": "101110910",
                        "child": {}
                    },
                    {
                        "name": "陇县",
                        "id": "101110911",
                        "child": {}
                    },
                    {
                        "name": "陈仓",
                        "id": "101110912",
                        "child": {}
                    }
                ]
            },
            {
                "name": "铜川",
                "id": "101111002",
                "child": [
                    {
                        "name": "铜川",
                        "id": "101111001",
                        "child": {}
                    },
                    {
                        "name": "耀县",
                        "id": "101111002",
                        "child": {}
                    },
                    {
                        "name": "宜君",
                        "id": "101111003",
                        "child": {}
                    },
                    {
                        "name": "耀州",
                        "id": "101111004",
                        "child": {}
                    }
                ]
            },
            {
                "name": "杨凌",
                "id": "101111101",
                "child": [
                    {
                        "name": "杨凌",
                        "id": "101111101",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "山东": {
        "father": "",
        "id": "101120507",
        "name": "山东",
        "child": [
            {
                "name": "济南",
                "id": "101120104",
                "child": [
                    {
                        "name": "济南",
                        "id": "101120101",
                        "child": {}
                    },
                    {
                        "name": "长清",
                        "id": "101120102",
                        "child": {}
                    },
                    {
                        "name": "商河",
                        "id": "101120103",
                        "child": {}
                    },
                    {
                        "name": "章丘",
                        "id": "101120104",
                        "child": {}
                    },
                    {
                        "name": "平阴",
                        "id": "101120105",
                        "child": {}
                    },
                    {
                        "name": "济阳",
                        "id": "101120106",
                        "child": {}
                    }
                ]
            },
            {
                "name": "青岛",
                "id": "101120206",
                "child": [
                    {
                        "name": "青岛",
                        "id": "101120201",
                        "child": {}
                    },
                    {
                        "name": "崂山",
                        "id": "101120202",
                        "child": {}
                    },
                    {
                        "name": "即墨",
                        "id": "101120204",
                        "child": {}
                    },
                    {
                        "name": "胶州",
                        "id": "101120205",
                        "child": {}
                    },
                    {
                        "name": "黄岛",
                        "id": "101120206",
                        "child": {}
                    },
                    {
                        "name": "莱西",
                        "id": "101120207",
                        "child": {}
                    },
                    {
                        "name": "平度",
                        "id": "101120208",
                        "child": {}
                    }
                ]
            },
            {
                "name": "淄博",
                "id": "101120304",
                "child": [
                    {
                        "name": "淄博",
                        "id": "101120301",
                        "child": {}
                    },
                    {
                        "name": "淄川",
                        "id": "101120302",
                        "child": {}
                    },
                    {
                        "name": "博山",
                        "id": "101120303",
                        "child": {}
                    },
                    {
                        "name": "高青",
                        "id": "101120304",
                        "child": {}
                    },
                    {
                        "name": "周村",
                        "id": "101120305",
                        "child": {}
                    },
                    {
                        "name": "沂源",
                        "id": "101120306",
                        "child": {}
                    },
                    {
                        "name": "桓台",
                        "id": "101120307",
                        "child": {}
                    },
                    {
                        "name": "临淄",
                        "id": "101120308",
                        "child": {}
                    }
                ]
            },
            {
                "name": "德州",
                "id": "101120406",
                "child": [
                    {
                        "name": "德州",
                        "id": "101120401",
                        "child": {}
                    },
                    {
                        "name": "武城",
                        "id": "101120402",
                        "child": {}
                    },
                    {
                        "name": "临邑",
                        "id": "101120403",
                        "child": {}
                    },
                    {
                        "name": "陵县",
                        "id": "101120404",
                        "child": {}
                    },
                    {
                        "name": "齐河",
                        "id": "101120405",
                        "child": {}
                    },
                    {
                        "name": "乐陵",
                        "id": "101120406",
                        "child": {}
                    },
                    {
                        "name": "庆云",
                        "id": "101120407",
                        "child": {}
                    },
                    {
                        "name": "平原",
                        "id": "101120408",
                        "child": {}
                    },
                    {
                        "name": "宁津",
                        "id": "101120409",
                        "child": {}
                    },
                    {
                        "name": "夏津",
                        "id": "101120410",
                        "child": {}
                    },
                    {
                        "name": "禹城",
                        "id": "101120411",
                        "child": {}
                    }
                ]
            },
            {
                "name": "烟台",
                "id": "101120507",
                "child": [
                    {
                        "name": "烟台",
                        "id": "101120501",
                        "child": {}
                    },
                    {
                        "name": "莱州",
                        "id": "101120502",
                        "child": {}
                    },
                    {
                        "name": "长岛",
                        "id": "101120503",
                        "child": {}
                    },
                    {
                        "name": "蓬莱",
                        "id": "101120504",
                        "child": {}
                    },
                    {
                        "name": "龙口",
                        "id": "101120505",
                        "child": {}
                    },
                    {
                        "name": "招远",
                        "id": "101120506",
                        "child": {}
                    },
                    {
                        "name": "栖霞",
                        "id": "101120507",
                        "child": {}
                    },
                    {
                        "name": "福山",
                        "id": "101120508",
                        "child": {}
                    },
                    {
                        "name": "牟平",
                        "id": "101120509",
                        "child": {}
                    },
                    {
                        "name": "莱阳",
                        "id": "101120510",
                        "child": {}
                    },
                    {
                        "name": "海阳",
                        "id": "101120511",
                        "child": {}
                    }
                ]
            },
            {
                "name": "潍坊",
                "id": "101120606",
                "child": [
                    {
                        "name": "潍坊",
                        "id": "101120601",
                        "child": {}
                    },
                    {
                        "name": "青州",
                        "id": "101120602",
                        "child": {}
                    },
                    {
                        "name": "寿光",
                        "id": "101120603",
                        "child": {}
                    },
                    {
                        "name": "临朐",
                        "id": "101120604",
                        "child": {}
                    },
                    {
                        "name": "昌乐",
                        "id": "101120605",
                        "child": {}
                    },
                    {
                        "name": "昌邑",
                        "id": "101120606",
                        "child": {}
                    },
                    {
                        "name": "安丘",
                        "id": "101120607",
                        "child": {}
                    },
                    {
                        "name": "高密",
                        "id": "101120608",
                        "child": {}
                    },
                    {
                        "name": "诸城",
                        "id": "101120609",
                        "child": {}
                    }
                ]
            },
            {
                "name": "济宁",
                "id": "101120701",
                "child": [
                    {
                        "name": "济宁",
                        "id": "101120701",
                        "child": {}
                    },
                    {
                        "name": "嘉祥",
                        "id": "101120702",
                        "child": {}
                    },
                    {
                        "name": "微山",
                        "id": "101120703",
                        "child": {}
                    },
                    {
                        "name": "鱼台",
                        "id": "101120704",
                        "child": {}
                    },
                    {
                        "name": "兖州",
                        "id": "101120705",
                        "child": {}
                    },
                    {
                        "name": "金乡",
                        "id": "101120706",
                        "child": {}
                    },
                    {
                        "name": "汶上",
                        "id": "101120707",
                        "child": {}
                    },
                    {
                        "name": "泗水",
                        "id": "101120708",
                        "child": {}
                    },
                    {
                        "name": "梁山",
                        "id": "101120709",
                        "child": {}
                    },
                    {
                        "name": "曲阜",
                        "id": "101120710",
                        "child": {}
                    },
                    {
                        "name": "邹城",
                        "id": "101120711",
                        "child": {}
                    }
                ]
            },
            {
                "name": "泰安",
                "id": "101120801",
                "child": [
                    {
                        "name": "泰安",
                        "id": "101120801",
                        "child": {}
                    },
                    {
                        "name": "新泰",
                        "id": "101120802",
                        "child": {}
                    },
                    {
                        "name": "肥城",
                        "id": "101120804",
                        "child": {}
                    },
                    {
                        "name": "东平",
                        "id": "101120805",
                        "child": {}
                    },
                    {
                        "name": "宁阳",
                        "id": "101120806",
                        "child": {}
                    }
                ]
            },
            {
                "name": "临沂",
                "id": "101120907",
                "child": [
                    {
                        "name": "临沂",
                        "id": "101120901",
                        "child": {}
                    },
                    {
                        "name": "莒南",
                        "id": "101120902",
                        "child": {}
                    },
                    {
                        "name": "沂南",
                        "id": "101120903",
                        "child": {}
                    },
                    {
                        "name": "兰陵",
                        "id": "101120904",
                        "child": {}
                    },
                    {
                        "name": "临沭",
                        "id": "101120905",
                        "child": {}
                    },
                    {
                        "name": "郯城",
                        "id": "101120906",
                        "child": {}
                    },
                    {
                        "name": "蒙阴",
                        "id": "101120907",
                        "child": {}
                    },
                    {
                        "name": "平邑",
                        "id": "101120908",
                        "child": {}
                    },
                    {
                        "name": "费县",
                        "id": "101120909",
                        "child": {}
                    },
                    {
                        "name": "沂水",
                        "id": "101120910",
                        "child": {}
                    }
                ]
            },
            {
                "name": "菏泽",
                "id": "101121001",
                "child": [
                    {
                        "name": "菏泽",
                        "id": "101121001",
                        "child": {}
                    },
                    {
                        "name": "鄄城",
                        "id": "101121002",
                        "child": {}
                    },
                    {
                        "name": "郓城",
                        "id": "101121003",
                        "child": {}
                    },
                    {
                        "name": "东明",
                        "id": "101121004",
                        "child": {}
                    },
                    {
                        "name": "定陶",
                        "id": "101121005",
                        "child": {}
                    },
                    {
                        "name": "巨野",
                        "id": "101121006",
                        "child": {}
                    },
                    {
                        "name": "曹县",
                        "id": "101121007",
                        "child": {}
                    },
                    {
                        "name": "成武",
                        "id": "101121008",
                        "child": {}
                    },
                    {
                        "name": "单县",
                        "id": "101121009",
                        "child": {}
                    }
                ]
            },
            {
                "name": "滨州",
                "id": "101121105",
                "child": [
                    {
                        "name": "滨州",
                        "id": "101121101",
                        "child": {}
                    },
                    {
                        "name": "博兴",
                        "id": "101121102",
                        "child": {}
                    },
                    {
                        "name": "无棣",
                        "id": "101121103",
                        "child": {}
                    },
                    {
                        "name": "阳信",
                        "id": "101121104",
                        "child": {}
                    },
                    {
                        "name": "惠民",
                        "id": "101121105",
                        "child": {}
                    },
                    {
                        "name": "沾化",
                        "id": "101121106",
                        "child": {}
                    },
                    {
                        "name": "邹平",
                        "id": "101121107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "东营",
                "id": "101121203",
                "child": [
                    {
                        "name": "东营",
                        "id": "101121201",
                        "child": {}
                    },
                    {
                        "name": "河口",
                        "id": "101121202",
                        "child": {}
                    },
                    {
                        "name": "垦利",
                        "id": "101121203",
                        "child": {}
                    },
                    {
                        "name": "利津",
                        "id": "101121204",
                        "child": {}
                    },
                    {
                        "name": "广饶",
                        "id": "101121205",
                        "child": {}
                    }
                ]
            },
            {
                "name": "威海",
                "id": "101121305",
                "child": [
                    {
                        "name": "威海",
                        "id": "101121301",
                        "child": {}
                    },
                    {
                        "name": "文登",
                        "id": "101121302",
                        "child": {}
                    },
                    {
                        "name": "荣成",
                        "id": "101121303",
                        "child": {}
                    },
                    {
                        "name": "乳山",
                        "id": "101121304",
                        "child": {}
                    },
                    {
                        "name": "成山头",
                        "id": "101121305",
                        "child": {}
                    },
                    {
                        "name": "石岛",
                        "id": "101121306",
                        "child": {}
                    }
                ]
            },
            {
                "name": "枣庄",
                "id": "101121405",
                "child": [
                    {
                        "name": "枣庄",
                        "id": "101121401",
                        "child": {}
                    },
                    {
                        "name": "薛城",
                        "id": "101121402",
                        "child": {}
                    },
                    {
                        "name": "峄城",
                        "id": "101121403",
                        "child": {}
                    },
                    {
                        "name": "台儿庄",
                        "id": "101121404",
                        "child": {}
                    },
                    {
                        "name": "滕州",
                        "id": "101121405",
                        "child": {}
                    }
                ]
            },
            {
                "name": "日照",
                "id": "101121502",
                "child": [
                    {
                        "name": "日照",
                        "id": "101121501",
                        "child": {}
                    },
                    {
                        "name": "五莲",
                        "id": "101121502",
                        "child": {}
                    },
                    {
                        "name": "莒县",
                        "id": "101121503",
                        "child": {}
                    }
                ]
            },
            {
                "name": "莱芜",
                "id": "101121601",
                "child": [
                    {
                        "name": "莱芜",
                        "id": "101121601",
                        "child": {}
                    }
                ]
            },
            {
                "name": "聊城",
                "id": "101121706",
                "child": [
                    {
                        "name": "聊城",
                        "id": "101121701",
                        "child": {}
                    },
                    {
                        "name": "冠县",
                        "id": "101121702",
                        "child": {}
                    },
                    {
                        "name": "阳谷",
                        "id": "101121703",
                        "child": {}
                    },
                    {
                        "name": "高唐",
                        "id": "101121704",
                        "child": {}
                    },
                    {
                        "name": "茌平",
                        "id": "101121705",
                        "child": {}
                    },
                    {
                        "name": "东阿",
                        "id": "101121706",
                        "child": {}
                    },
                    {
                        "name": "临清",
                        "id": "101121707",
                        "child": {}
                    },
                    {
                        "name": "莘县",
                        "id": "101121709",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "新疆": {
        "father": "",
        "id": "101131201",
        "name": "新疆",
        "child": [
            {
                "name": "乌鲁木齐",
                "id": "101130109",
                "child": [
                    {
                        "name": "乌鲁木齐",
                        "id": "101130101",
                        "child": {}
                    },
                    {
                        "name": "小渠子",
                        "id": "101130103",
                        "child": {}
                    },
                    {
                        "name": "达坂城",
                        "id": "101130105",
                        "child": {}
                    },
                    {
                        "name": "乌鲁木齐牧试站",
                        "id": "101130108",
                        "child": {}
                    },
                    {
                        "name": "天池",
                        "id": "101130109",
                        "child": {}
                    },
                    {
                        "name": "白杨沟",
                        "id": "101130110",
                        "child": {}
                    }
                ]
            },
            {
                "name": "克拉玛依",
                "id": "101130202",
                "child": [
                    {
                        "name": "克拉玛依",
                        "id": "101130201",
                        "child": {}
                    },
                    {
                        "name": "乌尔禾",
                        "id": "101130202",
                        "child": {}
                    },
                    {
                        "name": "白碱滩",
                        "id": "101130203",
                        "child": {}
                    }
                ]
            },
            {
                "name": "石河子",
                "id": "101130303",
                "child": [
                    {
                        "name": "石河子",
                        "id": "101130301",
                        "child": {}
                    },
                    {
                        "name": "炮台",
                        "id": "101130302",
                        "child": {}
                    },
                    {
                        "name": "莫索湾",
                        "id": "101130303",
                        "child": {}
                    }
                ]
            },
            {
                "name": "昌吉",
                "id": "101130404",
                "child": [
                    {
                        "name": "昌吉",
                        "id": "101130401",
                        "child": {}
                    },
                    {
                        "name": "呼图壁",
                        "id": "101130402",
                        "child": {}
                    },
                    {
                        "name": "米泉",
                        "id": "101130403",
                        "child": {}
                    },
                    {
                        "name": "阜康",
                        "id": "101130404",
                        "child": {}
                    },
                    {
                        "name": "吉木萨尔",
                        "id": "101130405",
                        "child": {}
                    },
                    {
                        "name": "奇台",
                        "id": "101130406",
                        "child": {}
                    },
                    {
                        "name": "玛纳斯",
                        "id": "101130407",
                        "child": {}
                    },
                    {
                        "name": "木垒",
                        "id": "101130408",
                        "child": {}
                    },
                    {
                        "name": "蔡家湖",
                        "id": "101130409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "吐鲁番",
                "id": "101130504",
                "child": [
                    {
                        "name": "吐鲁番",
                        "id": "101130501",
                        "child": {}
                    },
                    {
                        "name": "托克逊",
                        "id": "101130502",
                        "child": {}
                    },
                    {
                        "name": "鄯善",
                        "id": "101130504",
                        "child": {}
                    }
                ]
            },
            {
                "name": "库尔勒",
                "id": "101130606",
                "child": [
                    {
                        "name": "库尔勒",
                        "id": "101130601",
                        "child": {}
                    },
                    {
                        "name": "轮台",
                        "id": "101130602",
                        "child": {}
                    },
                    {
                        "name": "尉犁",
                        "id": "101130603",
                        "child": {}
                    },
                    {
                        "name": "若羌",
                        "id": "101130604",
                        "child": {}
                    },
                    {
                        "name": "且末",
                        "id": "101130605",
                        "child": {}
                    },
                    {
                        "name": "和静",
                        "id": "101130606",
                        "child": {}
                    },
                    {
                        "name": "焉耆",
                        "id": "101130607",
                        "child": {}
                    },
                    {
                        "name": "和硕",
                        "id": "101130608",
                        "child": {}
                    },
                    {
                        "name": "巴音布鲁克",
                        "id": "101130610",
                        "child": {}
                    },
                    {
                        "name": "铁干里克",
                        "id": "101130611",
                        "child": {}
                    },
                    {
                        "name": "博湖",
                        "id": "101130612",
                        "child": {}
                    },
                    {
                        "name": "塔中",
                        "id": "101130613",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿拉尔",
                "id": "101130701",
                "child": [
                    {
                        "name": "阿拉尔",
                        "id": "101130701",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿克苏",
                "id": "101130808",
                "child": [
                    {
                        "name": "阿克苏",
                        "id": "101130801",
                        "child": {}
                    },
                    {
                        "name": "乌什",
                        "id": "101130802",
                        "child": {}
                    },
                    {
                        "name": "温宿",
                        "id": "101130803",
                        "child": {}
                    },
                    {
                        "name": "拜城",
                        "id": "101130804",
                        "child": {}
                    },
                    {
                        "name": "新和",
                        "id": "101130805",
                        "child": {}
                    },
                    {
                        "name": "沙雅",
                        "id": "101130806",
                        "child": {}
                    },
                    {
                        "name": "库车",
                        "id": "101130807",
                        "child": {}
                    },
                    {
                        "name": "柯坪",
                        "id": "101130808",
                        "child": {}
                    },
                    {
                        "name": "阿瓦提",
                        "id": "101130809",
                        "child": {}
                    }
                ]
            },
            {
                "name": "喀什",
                "id": "101130903",
                "child": [
                    {
                        "name": "喀什",
                        "id": "101130901",
                        "child": {}
                    },
                    {
                        "name": "英吉沙",
                        "id": "101130902",
                        "child": {}
                    },
                    {
                        "name": "塔什库尔干",
                        "id": "101130903",
                        "child": {}
                    },
                    {
                        "name": "麦盖提",
                        "id": "101130904",
                        "child": {}
                    },
                    {
                        "name": "莎车",
                        "id": "101130905",
                        "child": {}
                    },
                    {
                        "name": "叶城",
                        "id": "101130906",
                        "child": {}
                    },
                    {
                        "name": "泽普",
                        "id": "101130907",
                        "child": {}
                    },
                    {
                        "name": "巴楚",
                        "id": "101130908",
                        "child": {}
                    },
                    {
                        "name": "岳普湖",
                        "id": "101130909",
                        "child": {}
                    },
                    {
                        "name": "伽师",
                        "id": "101130910",
                        "child": {}
                    },
                    {
                        "name": "疏附",
                        "id": "101130911",
                        "child": {}
                    },
                    {
                        "name": "疏勒",
                        "id": "101130912",
                        "child": {}
                    }
                ]
            },
            {
                "name": "伊宁",
                "id": "101131006",
                "child": [
                    {
                        "name": "伊宁",
                        "id": "101131001",
                        "child": {}
                    },
                    {
                        "name": "察布查尔",
                        "id": "101131002",
                        "child": {}
                    },
                    {
                        "name": "尼勒克",
                        "id": "101131003",
                        "child": {}
                    },
                    {
                        "name": "伊宁县",
                        "id": "101131004",
                        "child": {}
                    },
                    {
                        "name": "巩留",
                        "id": "101131005",
                        "child": {}
                    },
                    {
                        "name": "新源",
                        "id": "101131006",
                        "child": {}
                    },
                    {
                        "name": "昭苏",
                        "id": "101131007",
                        "child": {}
                    },
                    {
                        "name": "特克斯",
                        "id": "101131008",
                        "child": {}
                    },
                    {
                        "name": "霍城",
                        "id": "101131009",
                        "child": {}
                    },
                    {
                        "name": "霍尔果斯",
                        "id": "101131010",
                        "child": {}
                    },
                    {
                        "name": "奎屯",
                        "id": "101131011",
                        "child": {}
                    }
                ]
            },
            {
                "name": "塔城",
                "id": "101131107",
                "child": [
                    {
                        "name": "塔城",
                        "id": "101131101",
                        "child": {}
                    },
                    {
                        "name": "裕民",
                        "id": "101131102",
                        "child": {}
                    },
                    {
                        "name": "额敏",
                        "id": "101131103",
                        "child": {}
                    },
                    {
                        "name": "和布克赛尔",
                        "id": "101131104",
                        "child": {}
                    },
                    {
                        "name": "托里",
                        "id": "101131105",
                        "child": {}
                    },
                    {
                        "name": "乌苏",
                        "id": "101131106",
                        "child": {}
                    },
                    {
                        "name": "沙湾",
                        "id": "101131107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "哈密",
                "id": "101131201",
                "child": [
                    {
                        "name": "哈密",
                        "id": "101131201",
                        "child": {}
                    },
                    {
                        "name": "巴里坤",
                        "id": "101131203",
                        "child": {}
                    },
                    {
                        "name": "伊吾",
                        "id": "101131204",
                        "child": {}
                    }
                ]
            },
            {
                "name": "和田",
                "id": "101131301",
                "child": [
                    {
                        "name": "和田",
                        "id": "101131301",
                        "child": {}
                    },
                    {
                        "name": "皮山",
                        "id": "101131302",
                        "child": {}
                    },
                    {
                        "name": "策勒",
                        "id": "101131303",
                        "child": {}
                    },
                    {
                        "name": "墨玉",
                        "id": "101131304",
                        "child": {}
                    },
                    {
                        "name": "洛浦",
                        "id": "101131305",
                        "child": {}
                    },
                    {
                        "name": "民丰",
                        "id": "101131306",
                        "child": {}
                    },
                    {
                        "name": "于田",
                        "id": "101131307",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿勒泰",
                "id": "101131407",
                "child": [
                    {
                        "name": "阿勒泰",
                        "id": "101131401",
                        "child": {}
                    },
                    {
                        "name": "哈巴河",
                        "id": "101131402",
                        "child": {}
                    },
                    {
                        "name": "吉木乃",
                        "id": "101131405",
                        "child": {}
                    },
                    {
                        "name": "布尔津",
                        "id": "101131406",
                        "child": {}
                    },
                    {
                        "name": "福海",
                        "id": "101131407",
                        "child": {}
                    },
                    {
                        "name": "富蕴",
                        "id": "101131408",
                        "child": {}
                    },
                    {
                        "name": "青河",
                        "id": "101131409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿图什",
                "id": "101131502",
                "child": [
                    {
                        "name": "阿图什",
                        "id": "101131501",
                        "child": {}
                    },
                    {
                        "name": "乌恰",
                        "id": "101131502",
                        "child": {}
                    },
                    {
                        "name": "阿克陶",
                        "id": "101131503",
                        "child": {}
                    },
                    {
                        "name": "阿合奇",
                        "id": "101131504",
                        "child": {}
                    }
                ]
            },
            {
                "name": "博乐",
                "id": "101131606",
                "child": [
                    {
                        "name": "博乐",
                        "id": "101131601",
                        "child": {}
                    },
                    {
                        "name": "温泉",
                        "id": "101131602",
                        "child": {}
                    },
                    {
                        "name": "精河",
                        "id": "101131603",
                        "child": {}
                    },
                    {
                        "name": "阿拉山口",
                        "id": "101131606",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "西藏": {
        "father": "",
        "id": "101140401",
        "name": "西藏",
        "child": [
            {
                "name": "拉萨",
                "id": "101140102",
                "child": [
                    {
                        "name": "拉萨",
                        "id": "101140101",
                        "child": {}
                    },
                    {
                        "name": "当雄",
                        "id": "101140102",
                        "child": {}
                    },
                    {
                        "name": "尼木",
                        "id": "101140103",
                        "child": {}
                    },
                    {
                        "name": "林周",
                        "id": "101140104",
                        "child": {}
                    },
                    {
                        "name": "堆龙德庆",
                        "id": "101140105",
                        "child": {}
                    },
                    {
                        "name": "曲水",
                        "id": "101140106",
                        "child": {}
                    },
                    {
                        "name": "达孜",
                        "id": "101140107",
                        "child": {}
                    },
                    {
                        "name": "墨竹工卡",
                        "id": "101140108",
                        "child": {}
                    }
                ]
            },
            {
                "name": "日喀则",
                "id": "101140208",
                "child": [
                    {
                        "name": "日喀则",
                        "id": "101140201",
                        "child": {}
                    },
                    {
                        "name": "拉孜",
                        "id": "101140202",
                        "child": {}
                    },
                    {
                        "name": "南木林",
                        "id": "101140203",
                        "child": {}
                    },
                    {
                        "name": "聂拉木",
                        "id": "101140204",
                        "child": {}
                    },
                    {
                        "name": "定日",
                        "id": "101140205",
                        "child": {}
                    },
                    {
                        "name": "江孜",
                        "id": "101140206",
                        "child": {}
                    },
                    {
                        "name": "帕里",
                        "id": "101140207",
                        "child": {}
                    },
                    {
                        "name": "仲巴",
                        "id": "101140208",
                        "child": {}
                    },
                    {
                        "name": "萨嘎",
                        "id": "101140209",
                        "child": {}
                    },
                    {
                        "name": "吉隆",
                        "id": "101140210",
                        "child": {}
                    },
                    {
                        "name": "昂仁",
                        "id": "101140211",
                        "child": {}
                    },
                    {
                        "name": "定结",
                        "id": "101140212",
                        "child": {}
                    },
                    {
                        "name": "萨迦",
                        "id": "101140213",
                        "child": {}
                    },
                    {
                        "name": "谢通门",
                        "id": "101140214",
                        "child": {}
                    },
                    {
                        "name": "岗巴",
                        "id": "101140216",
                        "child": {}
                    },
                    {
                        "name": "白朗",
                        "id": "101140217",
                        "child": {}
                    },
                    {
                        "name": "亚东",
                        "id": "101140218",
                        "child": {}
                    },
                    {
                        "name": "康马",
                        "id": "101140219",
                        "child": {}
                    },
                    {
                        "name": "仁布",
                        "id": "101140220",
                        "child": {}
                    }
                ]
            },
            {
                "name": "山南",
                "id": "101140301",
                "child": [
                    {
                        "name": "山南",
                        "id": "101140301",
                        "child": {}
                    },
                    {
                        "name": "贡嘎",
                        "id": "101140302",
                        "child": {}
                    },
                    {
                        "name": "扎囊",
                        "id": "101140303",
                        "child": {}
                    },
                    {
                        "name": "加查",
                        "id": "101140304",
                        "child": {}
                    },
                    {
                        "name": "浪卡子",
                        "id": "101140305",
                        "child": {}
                    },
                    {
                        "name": "错那",
                        "id": "101140306",
                        "child": {}
                    },
                    {
                        "name": "隆子",
                        "id": "101140307",
                        "child": {}
                    },
                    {
                        "name": "泽当",
                        "id": "101140308",
                        "child": {}
                    },
                    {
                        "name": "乃东",
                        "id": "101140309",
                        "child": {}
                    },
                    {
                        "name": "桑日",
                        "id": "101140310",
                        "child": {}
                    },
                    {
                        "name": "洛扎",
                        "id": "101140311",
                        "child": {}
                    },
                    {
                        "name": "措美",
                        "id": "101140312",
                        "child": {}
                    },
                    {
                        "name": "琼结",
                        "id": "101140313",
                        "child": {}
                    }
                ]
            },
            {
                "name": "林芝",
                "id": "101140401",
                "child": [
                    {
                        "name": "林芝",
                        "id": "101140401",
                        "child": {}
                    },
                    {
                        "name": "波密",
                        "id": "101140402",
                        "child": {}
                    },
                    {
                        "name": "米林",
                        "id": "101140403",
                        "child": {}
                    },
                    {
                        "name": "察隅",
                        "id": "101140404",
                        "child": {}
                    },
                    {
                        "name": "工布江达",
                        "id": "101140405",
                        "child": {}
                    },
                    {
                        "name": "朗县",
                        "id": "101140406",
                        "child": {}
                    },
                    {
                        "name": "墨脱",
                        "id": "101140407",
                        "child": {}
                    }
                ]
            },
            {
                "name": "昌都",
                "id": "101140507",
                "child": [
                    {
                        "name": "昌都",
                        "id": "101140501",
                        "child": {}
                    },
                    {
                        "name": "丁青",
                        "id": "101140502",
                        "child": {}
                    },
                    {
                        "name": "边坝",
                        "id": "101140503",
                        "child": {}
                    },
                    {
                        "name": "洛隆",
                        "id": "101140504",
                        "child": {}
                    },
                    {
                        "name": "左贡",
                        "id": "101140505",
                        "child": {}
                    },
                    {
                        "name": "芒康",
                        "id": "101140506",
                        "child": {}
                    },
                    {
                        "name": "类乌齐",
                        "id": "101140507",
                        "child": {}
                    },
                    {
                        "name": "八宿",
                        "id": "101140508",
                        "child": {}
                    },
                    {
                        "name": "江达",
                        "id": "101140509",
                        "child": {}
                    },
                    {
                        "name": "察雅",
                        "id": "101140510",
                        "child": {}
                    },
                    {
                        "name": "贡觉",
                        "id": "101140511",
                        "child": {}
                    }
                ]
            },
            {
                "name": "那曲",
                "id": "101140608",
                "child": [
                    {
                        "name": "那曲",
                        "id": "101140601",
                        "child": {}
                    },
                    {
                        "name": "尼玛",
                        "id": "101140602",
                        "child": {}
                    },
                    {
                        "name": "嘉黎",
                        "id": "101140603",
                        "child": {}
                    },
                    {
                        "name": "班戈",
                        "id": "101140604",
                        "child": {}
                    },
                    {
                        "name": "安多",
                        "id": "101140605",
                        "child": {}
                    },
                    {
                        "name": "索县",
                        "id": "101140606",
                        "child": {}
                    },
                    {
                        "name": "聂荣",
                        "id": "101140607",
                        "child": {}
                    },
                    {
                        "name": "巴青",
                        "id": "101140608",
                        "child": {}
                    },
                    {
                        "name": "比如",
                        "id": "101140609",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿里",
                "id": "101140710",
                "child": [
                    {
                        "name": "阿里",
                        "id": "101140701",
                        "child": {}
                    },
                    {
                        "name": "改则",
                        "id": "101140702",
                        "child": {}
                    },
                    {
                        "name": "申扎",
                        "id": "101140703",
                        "child": {}
                    },
                    {
                        "name": "狮泉河",
                        "id": "101140704",
                        "child": {}
                    },
                    {
                        "name": "普兰",
                        "id": "101140705",
                        "child": {}
                    },
                    {
                        "name": "札达",
                        "id": "101140706",
                        "child": {}
                    },
                    {
                        "name": "噶尔",
                        "id": "101140707",
                        "child": {}
                    },
                    {
                        "name": "日土",
                        "id": "101140708",
                        "child": {}
                    },
                    {
                        "name": "革吉",
                        "id": "101140709",
                        "child": {}
                    },
                    {
                        "name": "措勤",
                        "id": "101140710",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "青海": {
        "father": "",
        "id": "101150504",
        "name": "青海",
        "child": [
            {
                "name": "西宁",
                "id": "101150104",
                "child": [
                    {
                        "name": "西宁",
                        "id": "101150101",
                        "child": {}
                    },
                    {
                        "name": "大通",
                        "id": "101150102",
                        "child": {}
                    },
                    {
                        "name": "湟源",
                        "id": "101150103",
                        "child": {}
                    },
                    {
                        "name": "湟中",
                        "id": "101150104",
                        "child": {}
                    }
                ]
            },
            {
                "name": "海东",
                "id": "101150207",
                "child": [
                    {
                        "name": "海东",
                        "id": "101150201",
                        "child": {}
                    },
                    {
                        "name": "乐都",
                        "id": "101150202",
                        "child": {}
                    },
                    {
                        "name": "民和",
                        "id": "101150203",
                        "child": {}
                    },
                    {
                        "name": "互助",
                        "id": "101150204",
                        "child": {}
                    },
                    {
                        "name": "化隆",
                        "id": "101150205",
                        "child": {}
                    },
                    {
                        "name": "循化",
                        "id": "101150206",
                        "child": {}
                    },
                    {
                        "name": "冷湖",
                        "id": "101150207",
                        "child": {}
                    },
                    {
                        "name": "平安",
                        "id": "101150208",
                        "child": {}
                    }
                ]
            },
            {
                "name": "黄南",
                "id": "101150303",
                "child": [
                    {
                        "name": "黄南",
                        "id": "101150301",
                        "child": {}
                    },
                    {
                        "name": "尖扎",
                        "id": "101150302",
                        "child": {}
                    },
                    {
                        "name": "泽库",
                        "id": "101150303",
                        "child": {}
                    },
                    {
                        "name": "同仁",
                        "id": "101150305",
                        "child": {}
                    }
                ]
            },
            {
                "name": "海南",
                "id": "101150406",
                "child": [
                    {
                        "name": "海南",
                        "id": "101150401",
                        "child": {}
                    },
                    {
                        "name": "贵德",
                        "id": "101150404",
                        "child": {}
                    },
                    {
                        "name": "兴海",
                        "id": "101150406",
                        "child": {}
                    },
                    {
                        "name": "贵南",
                        "id": "101150407",
                        "child": {}
                    },
                    {
                        "name": "同德",
                        "id": "101150408",
                        "child": {}
                    },
                    {
                        "name": "共和",
                        "id": "101150409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "果洛",
                "id": "101150504",
                "child": [
                    {
                        "name": "果洛",
                        "id": "101150501",
                        "child": {}
                    },
                    {
                        "name": "班玛",
                        "id": "101150502",
                        "child": {}
                    },
                    {
                        "name": "甘德",
                        "id": "101150503",
                        "child": {}
                    },
                    {
                        "name": "达日",
                        "id": "101150504",
                        "child": {}
                    },
                    {
                        "name": "久治",
                        "id": "101150505",
                        "child": {}
                    },
                    {
                        "name": "玛多",
                        "id": "101150506",
                        "child": {}
                    },
                    {
                        "name": "多县",
                        "id": "101150507",
                        "child": {}
                    },
                    {
                        "name": "玛沁",
                        "id": "101150508",
                        "child": {}
                    }
                ]
            },
            {
                "name": "玉树",
                "id": "101150602",
                "child": [
                    {
                        "name": "玉树",
                        "id": "101150601",
                        "child": {}
                    },
                    {
                        "name": "称多",
                        "id": "101150602",
                        "child": {}
                    },
                    {
                        "name": "治多",
                        "id": "101150603",
                        "child": {}
                    },
                    {
                        "name": "杂多",
                        "id": "101150604",
                        "child": {}
                    },
                    {
                        "name": "囊谦",
                        "id": "101150605",
                        "child": {}
                    },
                    {
                        "name": "曲麻莱",
                        "id": "101150606",
                        "child": {}
                    }
                ]
            },
            {
                "name": "海西",
                "id": "101150709",
                "child": [
                    {
                        "name": "海西",
                        "id": "101150701",
                        "child": {}
                    },
                    {
                        "name": "天峻",
                        "id": "101150708",
                        "child": {}
                    },
                    {
                        "name": "乌兰",
                        "id": "101150709",
                        "child": {}
                    },
                    {
                        "name": "茫崖",
                        "id": "101150712",
                        "child": {}
                    },
                    {
                        "name": "大柴旦",
                        "id": "101150713",
                        "child": {}
                    },
                    {
                        "name": "德令哈",
                        "id": "101150716",
                        "child": {}
                    }
                ]
            },
            {
                "name": "海北",
                "id": "101150806",
                "child": [
                    {
                        "name": "海北",
                        "id": "101150801",
                        "child": {}
                    },
                    {
                        "name": "门源",
                        "id": "101150802",
                        "child": {}
                    },
                    {
                        "name": "祁连",
                        "id": "101150803",
                        "child": {}
                    },
                    {
                        "name": "海晏",
                        "id": "101150804",
                        "child": {}
                    },
                    {
                        "name": "刚察",
                        "id": "101150806",
                        "child": {}
                    }
                ]
            },
            {
                "name": "格尔木",
                "id": "101150902",
                "child": [
                    {
                        "name": "格尔木",
                        "id": "101150901",
                        "child": {}
                    },
                    {
                        "name": "都兰",
                        "id": "101150902",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "甘肃": {
        "father": "",
        "id": "101161201",
        "name": "甘肃",
        "child": [
            {
                "name": "兰州",
                "id": "101160103",
                "child": [
                    {
                        "name": "兰州",
                        "id": "101160101",
                        "child": {}
                    },
                    {
                        "name": "皋兰",
                        "id": "101160102",
                        "child": {}
                    },
                    {
                        "name": "永登",
                        "id": "101160103",
                        "child": {}
                    },
                    {
                        "name": "榆中",
                        "id": "101160104",
                        "child": {}
                    }
                ]
            },
            {
                "name": "定西",
                "id": "101160206",
                "child": [
                    {
                        "name": "定西",
                        "id": "101160201",
                        "child": {}
                    },
                    {
                        "name": "通渭",
                        "id": "101160202",
                        "child": {}
                    },
                    {
                        "name": "陇西",
                        "id": "101160203",
                        "child": {}
                    },
                    {
                        "name": "渭源",
                        "id": "101160204",
                        "child": {}
                    },
                    {
                        "name": "临洮",
                        "id": "101160205",
                        "child": {}
                    },
                    {
                        "name": "漳县",
                        "id": "101160206",
                        "child": {}
                    },
                    {
                        "name": "岷县",
                        "id": "101160207",
                        "child": {}
                    },
                    {
                        "name": "安定",
                        "id": "101160208",
                        "child": {}
                    }
                ]
            },
            {
                "name": "平凉",
                "id": "101160301",
                "child": [
                    {
                        "name": "平凉",
                        "id": "101160301",
                        "child": {}
                    },
                    {
                        "name": "泾川",
                        "id": "101160302",
                        "child": {}
                    },
                    {
                        "name": "灵台",
                        "id": "101160303",
                        "child": {}
                    },
                    {
                        "name": "崇信",
                        "id": "101160304",
                        "child": {}
                    },
                    {
                        "name": "华亭",
                        "id": "101160305",
                        "child": {}
                    },
                    {
                        "name": "庄浪",
                        "id": "101160306",
                        "child": {}
                    },
                    {
                        "name": "静宁",
                        "id": "101160307",
                        "child": {}
                    },
                    {
                        "name": "崆峒",
                        "id": "101160308",
                        "child": {}
                    }
                ]
            },
            {
                "name": "庆阳",
                "id": "101160403",
                "child": [
                    {
                        "name": "庆阳",
                        "id": "101160401",
                        "child": {}
                    },
                    {
                        "name": "环县",
                        "id": "101160403",
                        "child": {}
                    },
                    {
                        "name": "华池",
                        "id": "101160404",
                        "child": {}
                    },
                    {
                        "name": "合水",
                        "id": "101160405",
                        "child": {}
                    },
                    {
                        "name": "正宁",
                        "id": "101160406",
                        "child": {}
                    },
                    {
                        "name": "宁县",
                        "id": "101160407",
                        "child": {}
                    },
                    {
                        "name": "镇原",
                        "id": "101160408",
                        "child": {}
                    },
                    {
                        "name": "庆城",
                        "id": "101160409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "武威",
                "id": "101160505",
                "child": [
                    {
                        "name": "武威",
                        "id": "101160501",
                        "child": {}
                    },
                    {
                        "name": "民勤",
                        "id": "101160502",
                        "child": {}
                    },
                    {
                        "name": "古浪",
                        "id": "101160503",
                        "child": {}
                    },
                    {
                        "name": "天祝",
                        "id": "101160505",
                        "child": {}
                    }
                ]
            },
            {
                "name": "金昌",
                "id": "101160601",
                "child": [
                    {
                        "name": "金昌",
                        "id": "101160601",
                        "child": {}
                    },
                    {
                        "name": "永昌",
                        "id": "101160602",
                        "child": {}
                    }
                ]
            },
            {
                "name": "张掖",
                "id": "101160703",
                "child": [
                    {
                        "name": "张掖",
                        "id": "101160701",
                        "child": {}
                    },
                    {
                        "name": "肃南",
                        "id": "101160702",
                        "child": {}
                    },
                    {
                        "name": "民乐",
                        "id": "101160703",
                        "child": {}
                    },
                    {
                        "name": "临泽",
                        "id": "101160704",
                        "child": {}
                    },
                    {
                        "name": "高台",
                        "id": "101160705",
                        "child": {}
                    },
                    {
                        "name": "山丹",
                        "id": "101160706",
                        "child": {}
                    }
                ]
            },
            {
                "name": "酒泉",
                "id": "101160808",
                "child": [
                    {
                        "name": "酒泉",
                        "id": "101160801",
                        "child": {}
                    },
                    {
                        "name": "金塔",
                        "id": "101160803",
                        "child": {}
                    },
                    {
                        "name": "阿克塞",
                        "id": "101160804",
                        "child": {}
                    },
                    {
                        "name": "瓜州",
                        "id": "101160805",
                        "child": {}
                    },
                    {
                        "name": "肃北",
                        "id": "101160806",
                        "child": {}
                    },
                    {
                        "name": "玉门",
                        "id": "101160807",
                        "child": {}
                    },
                    {
                        "name": "敦煌",
                        "id": "101160808",
                        "child": {}
                    }
                ]
            },
            {
                "name": "天水",
                "id": "101160904",
                "child": [
                    {
                        "name": "天水",
                        "id": "101160901",
                        "child": {}
                    },
                    {
                        "name": "清水",
                        "id": "101160903",
                        "child": {}
                    },
                    {
                        "name": "秦安",
                        "id": "101160904",
                        "child": {}
                    },
                    {
                        "name": "甘谷",
                        "id": "101160905",
                        "child": {}
                    },
                    {
                        "name": "武山",
                        "id": "101160906",
                        "child": {}
                    },
                    {
                        "name": "张家川",
                        "id": "101160907",
                        "child": {}
                    },
                    {
                        "name": "麦积",
                        "id": "101160908",
                        "child": {}
                    }
                ]
            },
            {
                "name": "武都",
                "id": "101161003",
                "child": [
                    {
                        "name": "武都",
                        "id": "101161001",
                        "child": {}
                    },
                    {
                        "name": "成县",
                        "id": "101161002",
                        "child": {}
                    },
                    {
                        "name": "文县",
                        "id": "101161003",
                        "child": {}
                    },
                    {
                        "name": "宕昌",
                        "id": "101161004",
                        "child": {}
                    },
                    {
                        "name": "康县",
                        "id": "101161005",
                        "child": {}
                    },
                    {
                        "name": "西和",
                        "id": "101161006",
                        "child": {}
                    },
                    {
                        "name": "礼县",
                        "id": "101161007",
                        "child": {}
                    },
                    {
                        "name": "徽县",
                        "id": "101161008",
                        "child": {}
                    },
                    {
                        "name": "两当",
                        "id": "101161009",
                        "child": {}
                    }
                ]
            },
            {
                "name": "临夏",
                "id": "101161107",
                "child": [
                    {
                        "name": "临夏",
                        "id": "101161101",
                        "child": {}
                    },
                    {
                        "name": "康乐",
                        "id": "101161102",
                        "child": {}
                    },
                    {
                        "name": "永靖",
                        "id": "101161103",
                        "child": {}
                    },
                    {
                        "name": "广河",
                        "id": "101161104",
                        "child": {}
                    },
                    {
                        "name": "和政",
                        "id": "101161105",
                        "child": {}
                    },
                    {
                        "name": "东乡",
                        "id": "101161106",
                        "child": {}
                    },
                    {
                        "name": "积石山",
                        "id": "101161107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "合作",
                "id": "101161201",
                "child": [
                    {
                        "name": "合作",
                        "id": "101161201",
                        "child": {}
                    },
                    {
                        "name": "临潭",
                        "id": "101161202",
                        "child": {}
                    },
                    {
                        "name": "卓尼",
                        "id": "101161203",
                        "child": {}
                    },
                    {
                        "name": "舟曲",
                        "id": "101161204",
                        "child": {}
                    },
                    {
                        "name": "迭部",
                        "id": "101161205",
                        "child": {}
                    },
                    {
                        "name": "玛曲",
                        "id": "101161206",
                        "child": {}
                    },
                    {
                        "name": "碌曲",
                        "id": "101161207",
                        "child": {}
                    },
                    {
                        "name": "夏河",
                        "id": "101161208",
                        "child": {}
                    }
                ]
            },
            {
                "name": "白银",
                "id": "101161302",
                "child": [
                    {
                        "name": "白银",
                        "id": "101161301",
                        "child": {}
                    },
                    {
                        "name": "靖远",
                        "id": "101161302",
                        "child": {}
                    },
                    {
                        "name": "会宁",
                        "id": "101161303",
                        "child": {}
                    },
                    {
                        "name": "平川",
                        "id": "101161304",
                        "child": {}
                    },
                    {
                        "name": "景泰",
                        "id": "101161305",
                        "child": {}
                    }
                ]
            },
            {
                "name": "嘉峪关",
                "id": "101161401",
                "child": [
                    {
                        "name": "嘉峪关",
                        "id": "101161401",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "宁夏": {
        "father": "",
        "id": "101170402",
        "name": "宁夏",
        "child": [
            {
                "name": "银川",
                "id": "101170101",
                "child": [
                    {
                        "name": "银川",
                        "id": "101170101",
                        "child": {}
                    },
                    {
                        "name": "永宁",
                        "id": "101170102",
                        "child": {}
                    },
                    {
                        "name": "灵武",
                        "id": "101170103",
                        "child": {}
                    },
                    {
                        "name": "贺兰",
                        "id": "101170104",
                        "child": {}
                    }
                ]
            },
            {
                "name": "石嘴山",
                "id": "101170204",
                "child": [
                    {
                        "name": "石嘴山",
                        "id": "101170201",
                        "child": {}
                    },
                    {
                        "name": "惠农",
                        "id": "101170202",
                        "child": {}
                    },
                    {
                        "name": "平罗",
                        "id": "101170203",
                        "child": {}
                    },
                    {
                        "name": "陶乐",
                        "id": "101170204",
                        "child": {}
                    }
                ]
            },
            {
                "name": "吴忠",
                "id": "101170302",
                "child": [
                    {
                        "name": "吴忠",
                        "id": "101170301",
                        "child": {}
                    },
                    {
                        "name": "同心",
                        "id": "101170302",
                        "child": {}
                    },
                    {
                        "name": "盐池",
                        "id": "101170303",
                        "child": {}
                    },
                    {
                        "name": "青铜峡",
                        "id": "101170306",
                        "child": {}
                    }
                ]
            },
            {
                "name": "固原",
                "id": "101170402",
                "child": [
                    {
                        "name": "固原",
                        "id": "101170401",
                        "child": {}
                    },
                    {
                        "name": "西吉",
                        "id": "101170402",
                        "child": {}
                    },
                    {
                        "name": "隆德",
                        "id": "101170403",
                        "child": {}
                    },
                    {
                        "name": "泾源",
                        "id": "101170404",
                        "child": {}
                    },
                    {
                        "name": "彭阳",
                        "id": "101170406",
                        "child": {}
                    }
                ]
            },
            {
                "name": "中卫",
                "id": "101170502",
                "child": [
                    {
                        "name": "中卫",
                        "id": "101170501",
                        "child": {}
                    },
                    {
                        "name": "中宁",
                        "id": "101170502",
                        "child": {}
                    },
                    {
                        "name": "海原",
                        "id": "101170504",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "河南": {
        "father": "",
        "id": "101180101",
        "name": "河南",
        "child": [
            {
                "name": "郑州",
                "id": "101180101",
                "child": [
                    {
                        "name": "郑州",
                        "id": "101180101",
                        "child": {}
                    },
                    {
                        "name": "巩义",
                        "id": "101180102",
                        "child": {}
                    },
                    {
                        "name": "荥阳",
                        "id": "101180103",
                        "child": {}
                    },
                    {
                        "name": "登封",
                        "id": "101180104",
                        "child": {}
                    },
                    {
                        "name": "新密",
                        "id": "101180105",
                        "child": {}
                    },
                    {
                        "name": "新郑",
                        "id": "101180106",
                        "child": {}
                    },
                    {
                        "name": "中牟",
                        "id": "101180107",
                        "child": {}
                    },
                    {
                        "name": "上街",
                        "id": "101180108",
                        "child": {}
                    }
                ]
            },
            {
                "name": "安阳",
                "id": "101180204",
                "child": [
                    {
                        "name": "安阳",
                        "id": "101180201",
                        "child": {}
                    },
                    {
                        "name": "汤阴",
                        "id": "101180202",
                        "child": {}
                    },
                    {
                        "name": "滑县",
                        "id": "101180203",
                        "child": {}
                    },
                    {
                        "name": "内黄",
                        "id": "101180204",
                        "child": {}
                    },
                    {
                        "name": "林州",
                        "id": "101180205",
                        "child": {}
                    }
                ]
            },
            {
                "name": "新乡",
                "id": "101180302",
                "child": [
                    {
                        "name": "新乡",
                        "id": "101180301",
                        "child": {}
                    },
                    {
                        "name": "获嘉",
                        "id": "101180302",
                        "child": {}
                    },
                    {
                        "name": "原阳",
                        "id": "101180303",
                        "child": {}
                    },
                    {
                        "name": "辉县",
                        "id": "101180304",
                        "child": {}
                    },
                    {
                        "name": "卫辉",
                        "id": "101180305",
                        "child": {}
                    },
                    {
                        "name": "延津",
                        "id": "101180306",
                        "child": {}
                    },
                    {
                        "name": "封丘",
                        "id": "101180307",
                        "child": {}
                    },
                    {
                        "name": "长垣",
                        "id": "101180308",
                        "child": {}
                    }
                ]
            },
            {
                "name": "许昌",
                "id": "101180405",
                "child": [
                    {
                        "name": "许昌",
                        "id": "101180401",
                        "child": {}
                    },
                    {
                        "name": "鄢陵",
                        "id": "101180402",
                        "child": {}
                    },
                    {
                        "name": "襄城",
                        "id": "101180403",
                        "child": {}
                    },
                    {
                        "name": "长葛",
                        "id": "101180404",
                        "child": {}
                    },
                    {
                        "name": "禹州",
                        "id": "101180405",
                        "child": {}
                    }
                ]
            },
            {
                "name": "平顶山",
                "id": "101180503",
                "child": [
                    {
                        "name": "平顶山",
                        "id": "101180501",
                        "child": {}
                    },
                    {
                        "name": "郏县",
                        "id": "101180502",
                        "child": {}
                    },
                    {
                        "name": "宝丰",
                        "id": "101180503",
                        "child": {}
                    },
                    {
                        "name": "汝州",
                        "id": "101180504",
                        "child": {}
                    },
                    {
                        "name": "叶县",
                        "id": "101180505",
                        "child": {}
                    },
                    {
                        "name": "舞钢",
                        "id": "101180506",
                        "child": {}
                    },
                    {
                        "name": "鲁山",
                        "id": "101180507",
                        "child": {}
                    },
                    {
                        "name": "石龙",
                        "id": "101180508",
                        "child": {}
                    }
                ]
            },
            {
                "name": "信阳",
                "id": "101180605",
                "child": [
                    {
                        "name": "信阳",
                        "id": "101180601",
                        "child": {}
                    },
                    {
                        "name": "息县",
                        "id": "101180602",
                        "child": {}
                    },
                    {
                        "name": "罗山",
                        "id": "101180603",
                        "child": {}
                    },
                    {
                        "name": "光山",
                        "id": "101180604",
                        "child": {}
                    },
                    {
                        "name": "新县",
                        "id": "101180605",
                        "child": {}
                    },
                    {
                        "name": "淮滨",
                        "id": "101180606",
                        "child": {}
                    },
                    {
                        "name": "潢川",
                        "id": "101180607",
                        "child": {}
                    },
                    {
                        "name": "固始",
                        "id": "101180608",
                        "child": {}
                    },
                    {
                        "name": "商城",
                        "id": "101180609",
                        "child": {}
                    }
                ]
            },
            {
                "name": "南阳",
                "id": "101180704",
                "child": [
                    {
                        "name": "南阳",
                        "id": "101180701",
                        "child": {}
                    },
                    {
                        "name": "南召",
                        "id": "101180702",
                        "child": {}
                    },
                    {
                        "name": "方城",
                        "id": "101180703",
                        "child": {}
                    },
                    {
                        "name": "社旗",
                        "id": "101180704",
                        "child": {}
                    },
                    {
                        "name": "西峡",
                        "id": "101180705",
                        "child": {}
                    },
                    {
                        "name": "内乡",
                        "id": "101180706",
                        "child": {}
                    },
                    {
                        "name": "镇平",
                        "id": "101180707",
                        "child": {}
                    },
                    {
                        "name": "淅川",
                        "id": "101180708",
                        "child": {}
                    },
                    {
                        "name": "新野",
                        "id": "101180709",
                        "child": {}
                    },
                    {
                        "name": "唐河",
                        "id": "101180710",
                        "child": {}
                    },
                    {
                        "name": "邓州",
                        "id": "101180711",
                        "child": {}
                    },
                    {
                        "name": "桐柏",
                        "id": "101180712",
                        "child": {}
                    }
                ]
            },
            {
                "name": "开封",
                "id": "101180804",
                "child": [
                    {
                        "name": "开封",
                        "id": "101180801",
                        "child": {}
                    },
                    {
                        "name": "杞县",
                        "id": "101180802",
                        "child": {}
                    },
                    {
                        "name": "尉氏",
                        "id": "101180803",
                        "child": {}
                    },
                    {
                        "name": "通许",
                        "id": "101180804",
                        "child": {}
                    },
                    {
                        "name": "兰考",
                        "id": "101180805",
                        "child": {}
                    }
                ]
            },
            {
                "name": "洛阳",
                "id": "101180904",
                "child": [
                    {
                        "name": "洛阳",
                        "id": "101180901",
                        "child": {}
                    },
                    {
                        "name": "新安",
                        "id": "101180902",
                        "child": {}
                    },
                    {
                        "name": "孟津",
                        "id": "101180903",
                        "child": {}
                    },
                    {
                        "name": "宜阳",
                        "id": "101180904",
                        "child": {}
                    },
                    {
                        "name": "洛宁",
                        "id": "101180905",
                        "child": {}
                    },
                    {
                        "name": "伊川",
                        "id": "101180906",
                        "child": {}
                    },
                    {
                        "name": "嵩县",
                        "id": "101180907",
                        "child": {}
                    },
                    {
                        "name": "偃师",
                        "id": "101180908",
                        "child": {}
                    },
                    {
                        "name": "栾川",
                        "id": "101180909",
                        "child": {}
                    },
                    {
                        "name": "汝阳",
                        "id": "101180910",
                        "child": {}
                    },
                    {
                        "name": "吉利",
                        "id": "101180911",
                        "child": {}
                    }
                ]
            },
            {
                "name": "商丘",
                "id": "101181003",
                "child": [
                    {
                        "name": "商丘",
                        "id": "101181001",
                        "child": {}
                    },
                    {
                        "name": "睢县",
                        "id": "101181003",
                        "child": {}
                    },
                    {
                        "name": "民权",
                        "id": "101181004",
                        "child": {}
                    },
                    {
                        "name": "虞城",
                        "id": "101181005",
                        "child": {}
                    },
                    {
                        "name": "柘城",
                        "id": "101181006",
                        "child": {}
                    },
                    {
                        "name": "宁陵",
                        "id": "101181007",
                        "child": {}
                    },
                    {
                        "name": "夏邑",
                        "id": "101181008",
                        "child": {}
                    },
                    {
                        "name": "永城",
                        "id": "101181009",
                        "child": {}
                    }
                ]
            },
            {
                "name": "焦作",
                "id": "101181101",
                "child": [
                    {
                        "name": "焦作",
                        "id": "101181101",
                        "child": {}
                    },
                    {
                        "name": "修武",
                        "id": "101181102",
                        "child": {}
                    },
                    {
                        "name": "武陟",
                        "id": "101181103",
                        "child": {}
                    },
                    {
                        "name": "沁阳",
                        "id": "101181104",
                        "child": {}
                    },
                    {
                        "name": "博爱",
                        "id": "101181106",
                        "child": {}
                    },
                    {
                        "name": "温县",
                        "id": "101181107",
                        "child": {}
                    },
                    {
                        "name": "孟州",
                        "id": "101181108",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鹤壁",
                "id": "101181202",
                "child": [
                    {
                        "name": "鹤壁",
                        "id": "101181201",
                        "child": {}
                    },
                    {
                        "name": "浚县",
                        "id": "101181202",
                        "child": {}
                    },
                    {
                        "name": "淇县",
                        "id": "101181203",
                        "child": {}
                    }
                ]
            },
            {
                "name": "濮阳",
                "id": "101181301",
                "child": [
                    {
                        "name": "濮阳",
                        "id": "101181301",
                        "child": {}
                    },
                    {
                        "name": "台前",
                        "id": "101181302",
                        "child": {}
                    },
                    {
                        "name": "南乐",
                        "id": "101181303",
                        "child": {}
                    },
                    {
                        "name": "清丰",
                        "id": "101181304",
                        "child": {}
                    },
                    {
                        "name": "范县",
                        "id": "101181305",
                        "child": {}
                    }
                ]
            },
            {
                "name": "周口",
                "id": "101181401",
                "child": [
                    {
                        "name": "周口",
                        "id": "101181401",
                        "child": {}
                    },
                    {
                        "name": "扶沟",
                        "id": "101181402",
                        "child": {}
                    },
                    {
                        "name": "太康",
                        "id": "101181403",
                        "child": {}
                    },
                    {
                        "name": "淮阳",
                        "id": "101181404",
                        "child": {}
                    },
                    {
                        "name": "西华",
                        "id": "101181405",
                        "child": {}
                    },
                    {
                        "name": "商水",
                        "id": "101181406",
                        "child": {}
                    },
                    {
                        "name": "项城",
                        "id": "101181407",
                        "child": {}
                    },
                    {
                        "name": "郸城",
                        "id": "101181408",
                        "child": {}
                    },
                    {
                        "name": "鹿邑",
                        "id": "101181409",
                        "child": {}
                    },
                    {
                        "name": "沈丘",
                        "id": "101181410",
                        "child": {}
                    }
                ]
            },
            {
                "name": "漯河",
                "id": "101181503",
                "child": [
                    {
                        "name": "漯河",
                        "id": "101181501",
                        "child": {}
                    },
                    {
                        "name": "临颍",
                        "id": "101181502",
                        "child": {}
                    },
                    {
                        "name": "舞阳",
                        "id": "101181503",
                        "child": {}
                    }
                ]
            },
            {
                "name": "驻马店",
                "id": "101181608",
                "child": [
                    {
                        "name": "驻马店",
                        "id": "101181601",
                        "child": {}
                    },
                    {
                        "name": "西平",
                        "id": "101181602",
                        "child": {}
                    },
                    {
                        "name": "遂平",
                        "id": "101181603",
                        "child": {}
                    },
                    {
                        "name": "上蔡",
                        "id": "101181604",
                        "child": {}
                    },
                    {
                        "name": "汝南",
                        "id": "101181605",
                        "child": {}
                    },
                    {
                        "name": "泌阳",
                        "id": "101181606",
                        "child": {}
                    },
                    {
                        "name": "平舆",
                        "id": "101181607",
                        "child": {}
                    },
                    {
                        "name": "新蔡",
                        "id": "101181608",
                        "child": {}
                    },
                    {
                        "name": "确山",
                        "id": "101181609",
                        "child": {}
                    },
                    {
                        "name": "正阳",
                        "id": "101181610",
                        "child": {}
                    }
                ]
            },
            {
                "name": "三门峡",
                "id": "101181703",
                "child": [
                    {
                        "name": "三门峡",
                        "id": "101181701",
                        "child": {}
                    },
                    {
                        "name": "灵宝",
                        "id": "101181702",
                        "child": {}
                    },
                    {
                        "name": "渑池",
                        "id": "101181703",
                        "child": {}
                    },
                    {
                        "name": "卢氏",
                        "id": "101181704",
                        "child": {}
                    },
                    {
                        "name": "义马",
                        "id": "101181705",
                        "child": {}
                    },
                    {
                        "name": "陕县",
                        "id": "101181706",
                        "child": {}
                    }
                ]
            },
            {
                "name": "济源",
                "id": "101181801",
                "child": [
                    {
                        "name": "济源",
                        "id": "101181801",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "江苏": {
        "father": "",
        "id": "101191203",
        "name": "江苏",
        "child": [
            {
                "name": "南京",
                "id": "101190104",
                "child": [
                    {
                        "name": "南京",
                        "id": "101190101",
                        "child": {}
                    },
                    {
                        "name": "溧水",
                        "id": "101190102",
                        "child": {}
                    },
                    {
                        "name": "高淳",
                        "id": "101190103",
                        "child": {}
                    },
                    {
                        "name": "江宁",
                        "id": "101190104",
                        "child": {}
                    },
                    {
                        "name": "六合",
                        "id": "101190105",
                        "child": {}
                    },
                    {
                        "name": "江浦",
                        "id": "101190106",
                        "child": {}
                    },
                    {
                        "name": "浦口",
                        "id": "101190107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "无锡",
                "id": "101190203",
                "child": [
                    {
                        "name": "无锡",
                        "id": "101190201",
                        "child": {}
                    },
                    {
                        "name": "江阴",
                        "id": "101190202",
                        "child": {}
                    },
                    {
                        "name": "宜兴",
                        "id": "101190203",
                        "child": {}
                    },
                    {
                        "name": "锡山",
                        "id": "101190204",
                        "child": {}
                    }
                ]
            },
            {
                "name": "镇江",
                "id": "101190304",
                "child": [
                    {
                        "name": "镇江",
                        "id": "101190301",
                        "child": {}
                    },
                    {
                        "name": "丹阳",
                        "id": "101190302",
                        "child": {}
                    },
                    {
                        "name": "扬中",
                        "id": "101190303",
                        "child": {}
                    },
                    {
                        "name": "句容",
                        "id": "101190304",
                        "child": {}
                    },
                    {
                        "name": "丹徒",
                        "id": "101190305",
                        "child": {}
                    }
                ]
            },
            {
                "name": "苏州",
                "id": "101190408",
                "child": [
                    {
                        "name": "苏州",
                        "id": "101190401",
                        "child": {}
                    },
                    {
                        "name": "常熟",
                        "id": "101190402",
                        "child": {}
                    },
                    {
                        "name": "张家港",
                        "id": "101190403",
                        "child": {}
                    },
                    {
                        "name": "昆山",
                        "id": "101190404",
                        "child": {}
                    },
                    {
                        "name": "吴中",
                        "id": "101190405",
                        "child": {}
                    },
                    {
                        "name": "吴江",
                        "id": "101190407",
                        "child": {}
                    },
                    {
                        "name": "太仓",
                        "id": "101190408",
                        "child": {}
                    }
                ]
            },
            {
                "name": "南通",
                "id": "101190501",
                "child": [
                    {
                        "name": "南通",
                        "id": "101190501",
                        "child": {}
                    },
                    {
                        "name": "海安",
                        "id": "101190502",
                        "child": {}
                    },
                    {
                        "name": "如皋",
                        "id": "101190503",
                        "child": {}
                    },
                    {
                        "name": "如东",
                        "id": "101190504",
                        "child": {}
                    },
                    {
                        "name": "启东",
                        "id": "101190507",
                        "child": {}
                    },
                    {
                        "name": "海门",
                        "id": "101190508",
                        "child": {}
                    }
                ]
            },
            {
                "name": "扬州",
                "id": "101190606",
                "child": [
                    {
                        "name": "扬州",
                        "id": "101190601",
                        "child": {}
                    },
                    {
                        "name": "宝应",
                        "id": "101190602",
                        "child": {}
                    },
                    {
                        "name": "仪征",
                        "id": "101190603",
                        "child": {}
                    },
                    {
                        "name": "高邮",
                        "id": "101190604",
                        "child": {}
                    },
                    {
                        "name": "江都",
                        "id": "101190605",
                        "child": {}
                    },
                    {
                        "name": "邗江",
                        "id": "101190606",
                        "child": {}
                    }
                ]
            },
            {
                "name": "盐城",
                "id": "101190701",
                "child": [
                    {
                        "name": "盐城",
                        "id": "101190701",
                        "child": {}
                    },
                    {
                        "name": "响水",
                        "id": "101190702",
                        "child": {}
                    },
                    {
                        "name": "滨海",
                        "id": "101190703",
                        "child": {}
                    },
                    {
                        "name": "阜宁",
                        "id": "101190704",
                        "child": {}
                    },
                    {
                        "name": "射阳",
                        "id": "101190705",
                        "child": {}
                    },
                    {
                        "name": "建湖",
                        "id": "101190706",
                        "child": {}
                    },
                    {
                        "name": "东台",
                        "id": "101190707",
                        "child": {}
                    },
                    {
                        "name": "大丰",
                        "id": "101190708",
                        "child": {}
                    },
                    {
                        "name": "盐都",
                        "id": "101190709",
                        "child": {}
                    }
                ]
            },
            {
                "name": "徐州",
                "id": "101190806",
                "child": [
                    {
                        "name": "徐州",
                        "id": "101190801",
                        "child": {}
                    },
                    {
                        "name": "铜山",
                        "id": "101190802",
                        "child": {}
                    },
                    {
                        "name": "丰县",
                        "id": "101190803",
                        "child": {}
                    },
                    {
                        "name": "沛县",
                        "id": "101190804",
                        "child": {}
                    },
                    {
                        "name": "邳州",
                        "id": "101190805",
                        "child": {}
                    },
                    {
                        "name": "睢宁",
                        "id": "101190806",
                        "child": {}
                    },
                    {
                        "name": "新沂",
                        "id": "101190807",
                        "child": {}
                    }
                ]
            },
            {
                "name": "淮安",
                "id": "101190908",
                "child": [
                    {
                        "name": "淮安",
                        "id": "101190901",
                        "child": {}
                    },
                    {
                        "name": "金湖",
                        "id": "101190902",
                        "child": {}
                    },
                    {
                        "name": "盱眙",
                        "id": "101190903",
                        "child": {}
                    },
                    {
                        "name": "洪泽",
                        "id": "101190904",
                        "child": {}
                    },
                    {
                        "name": "涟水",
                        "id": "101190905",
                        "child": {}
                    },
                    {
                        "name": "淮阴区",
                        "id": "101190906",
                        "child": {}
                    },
                    {
                        "name": "楚州",
                        "id": "101190908",
                        "child": {}
                    }
                ]
            },
            {
                "name": "连云港",
                "id": "101191002",
                "child": [
                    {
                        "name": "连云港",
                        "id": "101191001",
                        "child": {}
                    },
                    {
                        "name": "东海",
                        "id": "101191002",
                        "child": {}
                    },
                    {
                        "name": "赣榆",
                        "id": "101191003",
                        "child": {}
                    },
                    {
                        "name": "灌云",
                        "id": "101191004",
                        "child": {}
                    },
                    {
                        "name": "灌南",
                        "id": "101191005",
                        "child": {}
                    }
                ]
            },
            {
                "name": "常州",
                "id": "101191104",
                "child": [
                    {
                        "name": "常州",
                        "id": "101191101",
                        "child": {}
                    },
                    {
                        "name": "溧阳",
                        "id": "101191102",
                        "child": {}
                    },
                    {
                        "name": "金坛",
                        "id": "101191103",
                        "child": {}
                    },
                    {
                        "name": "武进",
                        "id": "101191104",
                        "child": {}
                    }
                ]
            },
            {
                "name": "泰州",
                "id": "101191203",
                "child": [
                    {
                        "name": "泰州",
                        "id": "101191201",
                        "child": {}
                    },
                    {
                        "name": "兴化",
                        "id": "101191202",
                        "child": {}
                    },
                    {
                        "name": "泰兴",
                        "id": "101191203",
                        "child": {}
                    },
                    {
                        "name": "姜堰",
                        "id": "101191204",
                        "child": {}
                    },
                    {
                        "name": "靖江",
                        "id": "101191205",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宿迁",
                "id": "101191304",
                "child": [
                    {
                        "name": "宿迁",
                        "id": "101191301",
                        "child": {}
                    },
                    {
                        "name": "沭阳",
                        "id": "101191302",
                        "child": {}
                    },
                    {
                        "name": "泗阳",
                        "id": "101191303",
                        "child": {}
                    },
                    {
                        "name": "泗洪",
                        "id": "101191304",
                        "child": {}
                    },
                    {
                        "name": "宿豫",
                        "id": "101191305",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "湖北": {
        "father": "",
        "id": "101201501",
        "name": "湖北",
        "child": [
            {
                "name": "武汉",
                "id": "101200104",
                "child": [
                    {
                        "name": "武汉",
                        "id": "101200101",
                        "child": {}
                    },
                    {
                        "name": "蔡甸",
                        "id": "101200102",
                        "child": {}
                    },
                    {
                        "name": "黄陂",
                        "id": "101200103",
                        "child": {}
                    },
                    {
                        "name": "新洲",
                        "id": "101200104",
                        "child": {}
                    },
                    {
                        "name": "江夏",
                        "id": "101200105",
                        "child": {}
                    },
                    {
                        "name": "东西湖",
                        "id": "101200106",
                        "child": {}
                    }
                ]
            },
            {
                "name": "襄阳",
                "id": "101200207",
                "child": [
                    {
                        "name": "襄阳",
                        "id": "101200201",
                        "child": {}
                    },
                    {
                        "name": "襄阳",
                        "id": "101200202",
                        "child": {}
                    },
                    {
                        "name": "保康",
                        "id": "101200203",
                        "child": {}
                    },
                    {
                        "name": "南漳",
                        "id": "101200204",
                        "child": {}
                    },
                    {
                        "name": "宜城",
                        "id": "101200205",
                        "child": {}
                    },
                    {
                        "name": "老河口",
                        "id": "101200206",
                        "child": {}
                    },
                    {
                        "name": "谷城",
                        "id": "101200207",
                        "child": {}
                    },
                    {
                        "name": "枣阳",
                        "id": "101200208",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鄂州",
                "id": "101200302",
                "child": [
                    {
                        "name": "鄂州",
                        "id": "101200301",
                        "child": {}
                    },
                    {
                        "name": "梁子湖",
                        "id": "101200302",
                        "child": {}
                    }
                ]
            },
            {
                "name": "孝感",
                "id": "101200403",
                "child": [
                    {
                        "name": "孝感",
                        "id": "101200401",
                        "child": {}
                    },
                    {
                        "name": "安陆",
                        "id": "101200402",
                        "child": {}
                    },
                    {
                        "name": "云梦",
                        "id": "101200403",
                        "child": {}
                    },
                    {
                        "name": "大悟",
                        "id": "101200404",
                        "child": {}
                    },
                    {
                        "name": "应城",
                        "id": "101200405",
                        "child": {}
                    },
                    {
                        "name": "汉川",
                        "id": "101200406",
                        "child": {}
                    },
                    {
                        "name": "孝昌",
                        "id": "101200407",
                        "child": {}
                    }
                ]
            },
            {
                "name": "黄冈",
                "id": "101200509",
                "child": [
                    {
                        "name": "黄冈",
                        "id": "101200501",
                        "child": {}
                    },
                    {
                        "name": "红安",
                        "id": "101200502",
                        "child": {}
                    },
                    {
                        "name": "麻城",
                        "id": "101200503",
                        "child": {}
                    },
                    {
                        "name": "罗田",
                        "id": "101200504",
                        "child": {}
                    },
                    {
                        "name": "英山",
                        "id": "101200505",
                        "child": {}
                    },
                    {
                        "name": "浠水",
                        "id": "101200506",
                        "child": {}
                    },
                    {
                        "name": "蕲春",
                        "id": "101200507",
                        "child": {}
                    },
                    {
                        "name": "黄梅",
                        "id": "101200508",
                        "child": {}
                    },
                    {
                        "name": "武穴",
                        "id": "101200509",
                        "child": {}
                    },
                    {
                        "name": "团风",
                        "id": "101200510",
                        "child": {}
                    }
                ]
            },
            {
                "name": "黄石",
                "id": "101200602",
                "child": [
                    {
                        "name": "黄石",
                        "id": "101200601",
                        "child": {}
                    },
                    {
                        "name": "大冶",
                        "id": "101200602",
                        "child": {}
                    },
                    {
                        "name": "阳新",
                        "id": "101200603",
                        "child": {}
                    },
                    {
                        "name": "铁山",
                        "id": "101200604",
                        "child": {}
                    },
                    {
                        "name": "下陆",
                        "id": "101200605",
                        "child": {}
                    },
                    {
                        "name": "西塞山",
                        "id": "101200606",
                        "child": {}
                    }
                ]
            },
            {
                "name": "咸宁",
                "id": "101200705",
                "child": [
                    {
                        "name": "咸宁",
                        "id": "101200701",
                        "child": {}
                    },
                    {
                        "name": "赤壁",
                        "id": "101200702",
                        "child": {}
                    },
                    {
                        "name": "嘉鱼",
                        "id": "101200703",
                        "child": {}
                    },
                    {
                        "name": "崇阳",
                        "id": "101200704",
                        "child": {}
                    },
                    {
                        "name": "通城",
                        "id": "101200705",
                        "child": {}
                    },
                    {
                        "name": "通山",
                        "id": "101200706",
                        "child": {}
                    }
                ]
            },
            {
                "name": "荆州",
                "id": "101200807",
                "child": [
                    {
                        "name": "荆州",
                        "id": "101200801",
                        "child": {}
                    },
                    {
                        "name": "江陵",
                        "id": "101200802",
                        "child": {}
                    },
                    {
                        "name": "公安",
                        "id": "101200803",
                        "child": {}
                    },
                    {
                        "name": "石首",
                        "id": "101200804",
                        "child": {}
                    },
                    {
                        "name": "监利",
                        "id": "101200805",
                        "child": {}
                    },
                    {
                        "name": "洪湖",
                        "id": "101200806",
                        "child": {}
                    },
                    {
                        "name": "松滋",
                        "id": "101200807",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宜昌",
                "id": "101200909",
                "child": [
                    {
                        "name": "宜昌",
                        "id": "101200901",
                        "child": {}
                    },
                    {
                        "name": "远安",
                        "id": "101200902",
                        "child": {}
                    },
                    {
                        "name": "秭归",
                        "id": "101200903",
                        "child": {}
                    },
                    {
                        "name": "兴山",
                        "id": "101200904",
                        "child": {}
                    },
                    {
                        "name": "五峰",
                        "id": "101200906",
                        "child": {}
                    },
                    {
                        "name": "当阳",
                        "id": "101200907",
                        "child": {}
                    },
                    {
                        "name": "长阳",
                        "id": "101200908",
                        "child": {}
                    },
                    {
                        "name": "宜都",
                        "id": "101200909",
                        "child": {}
                    },
                    {
                        "name": "枝江",
                        "id": "101200910",
                        "child": {}
                    },
                    {
                        "name": "三峡",
                        "id": "101200911",
                        "child": {}
                    },
                    {
                        "name": "夷陵",
                        "id": "101200912",
                        "child": {}
                    }
                ]
            },
            {
                "name": "恩施",
                "id": "101201006",
                "child": [
                    {
                        "name": "恩施",
                        "id": "101201001",
                        "child": {}
                    },
                    {
                        "name": "利川",
                        "id": "101201002",
                        "child": {}
                    },
                    {
                        "name": "建始",
                        "id": "101201003",
                        "child": {}
                    },
                    {
                        "name": "咸丰",
                        "id": "101201004",
                        "child": {}
                    },
                    {
                        "name": "宣恩",
                        "id": "101201005",
                        "child": {}
                    },
                    {
                        "name": "鹤峰",
                        "id": "101201006",
                        "child": {}
                    },
                    {
                        "name": "来凤",
                        "id": "101201007",
                        "child": {}
                    },
                    {
                        "name": "巴东",
                        "id": "101201008",
                        "child": {}
                    }
                ]
            },
            {
                "name": "十堰",
                "id": "101201102",
                "child": [
                    {
                        "name": "十堰",
                        "id": "101201101",
                        "child": {}
                    },
                    {
                        "name": "竹溪",
                        "id": "101201102",
                        "child": {}
                    },
                    {
                        "name": "郧西",
                        "id": "101201103",
                        "child": {}
                    },
                    {
                        "name": "郧县",
                        "id": "101201104",
                        "child": {}
                    },
                    {
                        "name": "竹山",
                        "id": "101201105",
                        "child": {}
                    },
                    {
                        "name": "房县",
                        "id": "101201106",
                        "child": {}
                    },
                    {
                        "name": "丹江口",
                        "id": "101201107",
                        "child": {}
                    },
                    {
                        "name": "茅箭",
                        "id": "101201108",
                        "child": {}
                    },
                    {
                        "name": "张湾",
                        "id": "101201109",
                        "child": {}
                    }
                ]
            },
            {
                "name": "神农架",
                "id": "101201201",
                "child": [
                    {
                        "name": "神农架",
                        "id": "101201201",
                        "child": {}
                    }
                ]
            },
            {
                "name": "随州",
                "id": "101201302",
                "child": [
                    {
                        "name": "随州",
                        "id": "101201301",
                        "child": {}
                    },
                    {
                        "name": "广水",
                        "id": "101201302",
                        "child": {}
                    }
                ]
            },
            {
                "name": "荆门",
                "id": "101201403",
                "child": [
                    {
                        "name": "荆门",
                        "id": "101201401",
                        "child": {}
                    },
                    {
                        "name": "钟祥",
                        "id": "101201402",
                        "child": {}
                    },
                    {
                        "name": "京山",
                        "id": "101201403",
                        "child": {}
                    },
                    {
                        "name": "掇刀",
                        "id": "101201404",
                        "child": {}
                    },
                    {
                        "name": "沙洋",
                        "id": "101201405",
                        "child": {}
                    },
                    {
                        "name": "沙市",
                        "id": "101201406",
                        "child": {}
                    }
                ]
            },
            {
                "name": "天门",
                "id": "101201501",
                "child": [
                    {
                        "name": "天门",
                        "id": "101201501",
                        "child": {}
                    }
                ]
            },
            {
                "name": "仙桃",
                "id": "101201601",
                "child": [
                    {
                        "name": "仙桃",
                        "id": "101201601",
                        "child": {}
                    }
                ]
            },
            {
                "name": "潜江",
                "id": "101201701",
                "child": [
                    {
                        "name": "潜江",
                        "id": "101201701",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "浙江": {
        "father": "",
        "id": "101210404",
        "name": "浙江",
        "child": [
            {
                "name": "杭州",
                "id": "101210107",
                "child": [
                    {
                        "name": "杭州",
                        "id": "101210101",
                        "child": {}
                    },
                    {
                        "name": "萧山",
                        "id": "101210102",
                        "child": {}
                    },
                    {
                        "name": "桐庐",
                        "id": "101210103",
                        "child": {}
                    },
                    {
                        "name": "淳安",
                        "id": "101210104",
                        "child": {}
                    },
                    {
                        "name": "建德",
                        "id": "101210105",
                        "child": {}
                    },
                    {
                        "name": "余杭",
                        "id": "101210106",
                        "child": {}
                    },
                    {
                        "name": "临安",
                        "id": "101210107",
                        "child": {}
                    },
                    {
                        "name": "富阳",
                        "id": "101210108",
                        "child": {}
                    }
                ]
            },
            {
                "name": "湖州",
                "id": "101210204",
                "child": [
                    {
                        "name": "湖州",
                        "id": "101210201",
                        "child": {}
                    },
                    {
                        "name": "长兴",
                        "id": "101210202",
                        "child": {}
                    },
                    {
                        "name": "安吉",
                        "id": "101210203",
                        "child": {}
                    },
                    {
                        "name": "德清",
                        "id": "101210204",
                        "child": {}
                    }
                ]
            },
            {
                "name": "嘉兴",
                "id": "101210304",
                "child": [
                    {
                        "name": "嘉兴",
                        "id": "101210301",
                        "child": {}
                    },
                    {
                        "name": "嘉善",
                        "id": "101210302",
                        "child": {}
                    },
                    {
                        "name": "海宁",
                        "id": "101210303",
                        "child": {}
                    },
                    {
                        "name": "桐乡",
                        "id": "101210304",
                        "child": {}
                    },
                    {
                        "name": "平湖",
                        "id": "101210305",
                        "child": {}
                    },
                    {
                        "name": "海盐",
                        "id": "101210306",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宁波",
                "id": "101210404",
                "child": [
                    {
                        "name": "宁波",
                        "id": "101210401",
                        "child": {}
                    },
                    {
                        "name": "慈溪",
                        "id": "101210403",
                        "child": {}
                    },
                    {
                        "name": "余姚",
                        "id": "101210404",
                        "child": {}
                    },
                    {
                        "name": "奉化",
                        "id": "101210405",
                        "child": {}
                    },
                    {
                        "name": "象山",
                        "id": "101210406",
                        "child": {}
                    },
                    {
                        "name": "宁海",
                        "id": "101210408",
                        "child": {}
                    },
                    {
                        "name": "北仑",
                        "id": "101210410",
                        "child": {}
                    },
                    {
                        "name": "鄞州",
                        "id": "101210411",
                        "child": {}
                    },
                    {
                        "name": "镇海",
                        "id": "101210412",
                        "child": {}
                    }
                ]
            },
            {
                "name": "绍兴",
                "id": "101210506",
                "child": [
                    {
                        "name": "越城",
                        "id": "101210501",
                        "child": {}
                    },
                    {
                        "name": "诸暨",
                        "id": "101210502",
                        "child": {}
                    },
                    {
                        "name": "上虞",
                        "id": "101210503",
                        "child": {}
                    },
                    {
                        "name": "新昌",
                        "id": "101210504",
                        "child": {}
                    },
                    {
                        "name": "嵊州",
                        "id": "101210505",
                        "child": {}
                    },
                    {
                        "name": "柯桥",
                        "id": "101210506",
                        "child": {}
                    }
                ]
            },
            {
                "name": "台州",
                "id": "101210613",
                "child": [
                    {
                        "name": "台州",
                        "id": "101210601",
                        "child": {}
                    },
                    {
                        "name": "玉环",
                        "id": "101210603",
                        "child": {}
                    },
                    {
                        "name": "三门",
                        "id": "101210604",
                        "child": {}
                    },
                    {
                        "name": "天台",
                        "id": "101210605",
                        "child": {}
                    },
                    {
                        "name": "仙居",
                        "id": "101210606",
                        "child": {}
                    },
                    {
                        "name": "温岭",
                        "id": "101210607",
                        "child": {}
                    },
                    {
                        "name": "洪家",
                        "id": "101210609",
                        "child": {}
                    },
                    {
                        "name": "临海",
                        "id": "101210610",
                        "child": {}
                    },
                    {
                        "name": "椒江",
                        "id": "101210611",
                        "child": {}
                    },
                    {
                        "name": "黄岩",
                        "id": "101210612",
                        "child": {}
                    },
                    {
                        "name": "路桥",
                        "id": "101210613",
                        "child": {}
                    }
                ]
            },
            {
                "name": "温州",
                "id": "101210709",
                "child": [
                    {
                        "name": "温州",
                        "id": "101210701",
                        "child": {}
                    },
                    {
                        "name": "泰顺",
                        "id": "101210702",
                        "child": {}
                    },
                    {
                        "name": "文成",
                        "id": "101210703",
                        "child": {}
                    },
                    {
                        "name": "平阳",
                        "id": "101210704",
                        "child": {}
                    },
                    {
                        "name": "瑞安",
                        "id": "101210705",
                        "child": {}
                    },
                    {
                        "name": "洞头",
                        "id": "101210706",
                        "child": {}
                    },
                    {
                        "name": "乐清",
                        "id": "101210707",
                        "child": {}
                    },
                    {
                        "name": "永嘉",
                        "id": "101210708",
                        "child": {}
                    },
                    {
                        "name": "苍南",
                        "id": "101210709",
                        "child": {}
                    }
                ]
            },
            {
                "name": "丽水",
                "id": "101210806",
                "child": [
                    {
                        "name": "丽水",
                        "id": "101210801",
                        "child": {}
                    },
                    {
                        "name": "遂昌",
                        "id": "101210802",
                        "child": {}
                    },
                    {
                        "name": "龙泉",
                        "id": "101210803",
                        "child": {}
                    },
                    {
                        "name": "缙云",
                        "id": "101210804",
                        "child": {}
                    },
                    {
                        "name": "青田",
                        "id": "101210805",
                        "child": {}
                    },
                    {
                        "name": "云和",
                        "id": "101210806",
                        "child": {}
                    },
                    {
                        "name": "庆元",
                        "id": "101210807",
                        "child": {}
                    },
                    {
                        "name": "松阳",
                        "id": "101210808",
                        "child": {}
                    },
                    {
                        "name": "景宁",
                        "id": "101210809",
                        "child": {}
                    }
                ]
            },
            {
                "name": "金华",
                "id": "101210908",
                "child": [
                    {
                        "name": "金华",
                        "id": "101210901",
                        "child": {}
                    },
                    {
                        "name": "浦江",
                        "id": "101210902",
                        "child": {}
                    },
                    {
                        "name": "兰溪",
                        "id": "101210903",
                        "child": {}
                    },
                    {
                        "name": "义乌",
                        "id": "101210904",
                        "child": {}
                    },
                    {
                        "name": "东阳",
                        "id": "101210905",
                        "child": {}
                    },
                    {
                        "name": "武义",
                        "id": "101210906",
                        "child": {}
                    },
                    {
                        "name": "永康",
                        "id": "101210907",
                        "child": {}
                    },
                    {
                        "name": "磐安",
                        "id": "101210908",
                        "child": {}
                    }
                ]
            },
            {
                "name": "衢州",
                "id": "101211003",
                "child": [
                    {
                        "name": "衢州",
                        "id": "101211001",
                        "child": {}
                    },
                    {
                        "name": "常山",
                        "id": "101211002",
                        "child": {}
                    },
                    {
                        "name": "开化",
                        "id": "101211003",
                        "child": {}
                    },
                    {
                        "name": "龙游",
                        "id": "101211004",
                        "child": {}
                    },
                    {
                        "name": "江山",
                        "id": "101211005",
                        "child": {}
                    },
                    {
                        "name": "衢江",
                        "id": "101211006",
                        "child": {}
                    }
                ]
            },
            {
                "name": "舟山",
                "id": "101211102",
                "child": [
                    {
                        "name": "舟山",
                        "id": "101211101",
                        "child": {}
                    },
                    {
                        "name": "嵊泗",
                        "id": "101211102",
                        "child": {}
                    },
                    {
                        "name": "岱山",
                        "id": "101211104",
                        "child": {}
                    },
                    {
                        "name": "普陀",
                        "id": "101211105",
                        "child": {}
                    },
                    {
                        "name": "定海",
                        "id": "101211106",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "安徽": {
        "father": "",
        "id": "101220902",
        "name": "安徽",
        "child": [
            {
                "name": "合肥",
                "id": "101220104",
                "child": [
                    {
                        "name": "合肥",
                        "id": "101220101",
                        "child": {}
                    },
                    {
                        "name": "长丰",
                        "id": "101220102",
                        "child": {}
                    },
                    {
                        "name": "肥东",
                        "id": "101220103",
                        "child": {}
                    },
                    {
                        "name": "肥西",
                        "id": "101220104",
                        "child": {}
                    },
                    {
                        "name": "巢湖",
                        "id": "101220105",
                        "child": {}
                    },
                    {
                        "name": "庐江",
                        "id": "101220106",
                        "child": {}
                    }
                ]
            },
            {
                "name": "蚌埠",
                "id": "101220202",
                "child": [
                    {
                        "name": "蚌埠",
                        "id": "101220201",
                        "child": {}
                    },
                    {
                        "name": "怀远",
                        "id": "101220202",
                        "child": {}
                    },
                    {
                        "name": "固镇",
                        "id": "101220203",
                        "child": {}
                    },
                    {
                        "name": "五河",
                        "id": "101220204",
                        "child": {}
                    }
                ]
            },
            {
                "name": "芜湖",
                "id": "101220301",
                "child": [
                    {
                        "name": "芜湖",
                        "id": "101220301",
                        "child": {}
                    },
                    {
                        "name": "繁昌",
                        "id": "101220302",
                        "child": {}
                    },
                    {
                        "name": "芜湖县",
                        "id": "101220303",
                        "child": {}
                    },
                    {
                        "name": "南陵",
                        "id": "101220304",
                        "child": {}
                    },
                    {
                        "name": "无为",
                        "id": "101220305",
                        "child": {}
                    }
                ]
            },
            {
                "name": "淮南",
                "id": "101220401",
                "child": [
                    {
                        "name": "淮南",
                        "id": "101220401",
                        "child": {}
                    },
                    {
                        "name": "凤台",
                        "id": "101220402",
                        "child": {}
                    },
                    {
                        "name": "潘集",
                        "id": "101220403",
                        "child": {}
                    }
                ]
            },
            {
                "name": "马鞍山",
                "id": "101220502",
                "child": [
                    {
                        "name": "马鞍山",
                        "id": "101220501",
                        "child": {}
                    },
                    {
                        "name": "当涂",
                        "id": "101220502",
                        "child": {}
                    },
                    {
                        "name": "含山",
                        "id": "101220503",
                        "child": {}
                    },
                    {
                        "name": "和县",
                        "id": "101220504",
                        "child": {}
                    }
                ]
            },
            {
                "name": "安庆",
                "id": "101220608",
                "child": [
                    {
                        "name": "安庆",
                        "id": "101220601",
                        "child": {}
                    },
                    {
                        "name": "枞阳",
                        "id": "101220602",
                        "child": {}
                    },
                    {
                        "name": "太湖",
                        "id": "101220603",
                        "child": {}
                    },
                    {
                        "name": "潜山",
                        "id": "101220604",
                        "child": {}
                    },
                    {
                        "name": "怀宁",
                        "id": "101220605",
                        "child": {}
                    },
                    {
                        "name": "宿松",
                        "id": "101220606",
                        "child": {}
                    },
                    {
                        "name": "望江",
                        "id": "101220607",
                        "child": {}
                    },
                    {
                        "name": "岳西",
                        "id": "101220608",
                        "child": {}
                    },
                    {
                        "name": "桐城",
                        "id": "101220609",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宿州",
                "id": "101220705",
                "child": [
                    {
                        "name": "宿州",
                        "id": "101220701",
                        "child": {}
                    },
                    {
                        "name": "砀山",
                        "id": "101220702",
                        "child": {}
                    },
                    {
                        "name": "灵璧",
                        "id": "101220703",
                        "child": {}
                    },
                    {
                        "name": "泗县",
                        "id": "101220704",
                        "child": {}
                    },
                    {
                        "name": "萧县",
                        "id": "101220705",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阜阳",
                "id": "101220805",
                "child": [
                    {
                        "name": "阜阳",
                        "id": "101220801",
                        "child": {}
                    },
                    {
                        "name": "阜南",
                        "id": "101220802",
                        "child": {}
                    },
                    {
                        "name": "颍上",
                        "id": "101220803",
                        "child": {}
                    },
                    {
                        "name": "临泉",
                        "id": "101220804",
                        "child": {}
                    },
                    {
                        "name": "界首",
                        "id": "101220805",
                        "child": {}
                    },
                    {
                        "name": "太和",
                        "id": "101220806",
                        "child": {}
                    }
                ]
            },
            {
                "name": "亳州",
                "id": "101220902",
                "child": [
                    {
                        "name": "亳州",
                        "id": "101220901",
                        "child": {}
                    },
                    {
                        "name": "涡阳",
                        "id": "101220902",
                        "child": {}
                    },
                    {
                        "name": "利辛",
                        "id": "101220903",
                        "child": {}
                    },
                    {
                        "name": "蒙城",
                        "id": "101220904",
                        "child": {}
                    }
                ]
            },
            {
                "name": "黄山",
                "id": "101221008",
                "child": [
                    {
                        "name": "黄山",
                        "id": "101221001",
                        "child": {}
                    },
                    {
                        "name": "黄山区",
                        "id": "101221002",
                        "child": {}
                    },
                    {
                        "name": "屯溪",
                        "id": "101221003",
                        "child": {}
                    },
                    {
                        "name": "祁门",
                        "id": "101221004",
                        "child": {}
                    },
                    {
                        "name": "黟县",
                        "id": "101221005",
                        "child": {}
                    },
                    {
                        "name": "歙县",
                        "id": "101221006",
                        "child": {}
                    },
                    {
                        "name": "休宁",
                        "id": "101221007",
                        "child": {}
                    },
                    {
                        "name": "黄山市",
                        "id": "101221008",
                        "child": {}
                    }
                ]
            },
            {
                "name": "滁州",
                "id": "101221105",
                "child": [
                    {
                        "name": "滁州",
                        "id": "101221101",
                        "child": {}
                    },
                    {
                        "name": "凤阳",
                        "id": "101221102",
                        "child": {}
                    },
                    {
                        "name": "明光",
                        "id": "101221103",
                        "child": {}
                    },
                    {
                        "name": "定远",
                        "id": "101221104",
                        "child": {}
                    },
                    {
                        "name": "全椒",
                        "id": "101221105",
                        "child": {}
                    },
                    {
                        "name": "来安",
                        "id": "101221106",
                        "child": {}
                    },
                    {
                        "name": "天长",
                        "id": "101221107",
                        "child": {}
                    }
                ]
            },
            {
                "name": "淮北",
                "id": "101221202",
                "child": [
                    {
                        "name": "淮北",
                        "id": "101221201",
                        "child": {}
                    },
                    {
                        "name": "濉溪",
                        "id": "101221202",
                        "child": {}
                    }
                ]
            },
            {
                "name": "铜陵",
                "id": "101221301",
                "child": [
                    {
                        "name": "铜陵",
                        "id": "101221301",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宣城",
                "id": "101221403",
                "child": [
                    {
                        "name": "宣城",
                        "id": "101221401",
                        "child": {}
                    },
                    {
                        "name": "泾县",
                        "id": "101221402",
                        "child": {}
                    },
                    {
                        "name": "旌德",
                        "id": "101221403",
                        "child": {}
                    },
                    {
                        "name": "宁国",
                        "id": "101221404",
                        "child": {}
                    },
                    {
                        "name": "绩溪",
                        "id": "101221405",
                        "child": {}
                    },
                    {
                        "name": "广德",
                        "id": "101221406",
                        "child": {}
                    },
                    {
                        "name": "郎溪",
                        "id": "101221407",
                        "child": {}
                    }
                ]
            },
            {
                "name": "六安",
                "id": "101221501",
                "child": [
                    {
                        "name": "六安",
                        "id": "101221501",
                        "child": {}
                    },
                    {
                        "name": "霍邱",
                        "id": "101221502",
                        "child": {}
                    },
                    {
                        "name": "寿县",
                        "id": "101221503",
                        "child": {}
                    },
                    {
                        "name": "金寨",
                        "id": "101221505",
                        "child": {}
                    },
                    {
                        "name": "霍山",
                        "id": "101221506",
                        "child": {}
                    },
                    {
                        "name": "舒城",
                        "id": "101221507",
                        "child": {}
                    }
                ]
            },
            {
                "name": "池州",
                "id": "101221704",
                "child": [
                    {
                        "name": "池州",
                        "id": "101221701",
                        "child": {}
                    },
                    {
                        "name": "东至",
                        "id": "101221702",
                        "child": {}
                    },
                    {
                        "name": "青阳",
                        "id": "101221703",
                        "child": {}
                    },
                    {
                        "name": "九华山",
                        "id": "101221704",
                        "child": {}
                    },
                    {
                        "name": "石台",
                        "id": "101221705",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "福建": {
        "father": "",
        "id": "101230507",
        "name": "福建",
        "child": [
            {
                "name": "福州",
                "id": "101230101",
                "child": [
                    {
                        "name": "福州",
                        "id": "101230101",
                        "child": {}
                    },
                    {
                        "name": "闽清",
                        "id": "101230102",
                        "child": {}
                    },
                    {
                        "name": "闽侯",
                        "id": "101230103",
                        "child": {}
                    },
                    {
                        "name": "罗源",
                        "id": "101230104",
                        "child": {}
                    },
                    {
                        "name": "连江",
                        "id": "101230105",
                        "child": {}
                    },
                    {
                        "name": "永泰",
                        "id": "101230107",
                        "child": {}
                    },
                    {
                        "name": "平潭",
                        "id": "101230108",
                        "child": {}
                    },
                    {
                        "name": "长乐",
                        "id": "101230110",
                        "child": {}
                    },
                    {
                        "name": "福清",
                        "id": "101230111",
                        "child": {}
                    }
                ]
            },
            {
                "name": "厦门",
                "id": "101230202",
                "child": [
                    {
                        "name": "厦门",
                        "id": "101230201",
                        "child": {}
                    },
                    {
                        "name": "同安",
                        "id": "101230202",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宁德",
                "id": "101230309",
                "child": [
                    {
                        "name": "宁德",
                        "id": "101230301",
                        "child": {}
                    },
                    {
                        "name": "古田",
                        "id": "101230302",
                        "child": {}
                    },
                    {
                        "name": "霞浦",
                        "id": "101230303",
                        "child": {}
                    },
                    {
                        "name": "寿宁",
                        "id": "101230304",
                        "child": {}
                    },
                    {
                        "name": "周宁",
                        "id": "101230305",
                        "child": {}
                    },
                    {
                        "name": "福安",
                        "id": "101230306",
                        "child": {}
                    },
                    {
                        "name": "柘荣",
                        "id": "101230307",
                        "child": {}
                    },
                    {
                        "name": "福鼎",
                        "id": "101230308",
                        "child": {}
                    },
                    {
                        "name": "屏南",
                        "id": "101230309",
                        "child": {}
                    }
                ]
            },
            {
                "name": "莆田",
                "id": "101230402",
                "child": [
                    {
                        "name": "莆田",
                        "id": "101230401",
                        "child": {}
                    },
                    {
                        "name": "仙游",
                        "id": "101230402",
                        "child": {}
                    },
                    {
                        "name": "秀屿港",
                        "id": "101230403",
                        "child": {}
                    },
                    {
                        "name": "涵江",
                        "id": "101230404",
                        "child": {}
                    },
                    {
                        "name": "秀屿",
                        "id": "101230405",
                        "child": {}
                    },
                    {
                        "name": "荔城",
                        "id": "101230406",
                        "child": {}
                    },
                    {
                        "name": "城厢",
                        "id": "101230407",
                        "child": {}
                    }
                ]
            },
            {
                "name": "泉州",
                "id": "101230507",
                "child": [
                    {
                        "name": "泉州",
                        "id": "101230501",
                        "child": {}
                    },
                    {
                        "name": "安溪",
                        "id": "101230502",
                        "child": {}
                    },
                    {
                        "name": "永春",
                        "id": "101230504",
                        "child": {}
                    },
                    {
                        "name": "德化",
                        "id": "101230505",
                        "child": {}
                    },
                    {
                        "name": "南安",
                        "id": "101230506",
                        "child": {}
                    },
                    {
                        "name": "崇武",
                        "id": "101230507",
                        "child": {}
                    },
                    {
                        "name": "惠安",
                        "id": "101230508",
                        "child": {}
                    },
                    {
                        "name": "晋江",
                        "id": "101230509",
                        "child": {}
                    },
                    {
                        "name": "石狮",
                        "id": "101230510",
                        "child": {}
                    }
                ]
            },
            {
                "name": "漳州",
                "id": "101230605",
                "child": [
                    {
                        "name": "漳州",
                        "id": "101230601",
                        "child": {}
                    },
                    {
                        "name": "长泰",
                        "id": "101230602",
                        "child": {}
                    },
                    {
                        "name": "南靖",
                        "id": "101230603",
                        "child": {}
                    },
                    {
                        "name": "平和",
                        "id": "101230604",
                        "child": {}
                    },
                    {
                        "name": "龙海",
                        "id": "101230605",
                        "child": {}
                    },
                    {
                        "name": "漳浦",
                        "id": "101230606",
                        "child": {}
                    },
                    {
                        "name": "诏安",
                        "id": "101230607",
                        "child": {}
                    },
                    {
                        "name": "东山",
                        "id": "101230608",
                        "child": {}
                    },
                    {
                        "name": "云霄",
                        "id": "101230609",
                        "child": {}
                    },
                    {
                        "name": "华安",
                        "id": "101230610",
                        "child": {}
                    }
                ]
            },
            {
                "name": "龙岩",
                "id": "101230706",
                "child": [
                    {
                        "name": "龙岩",
                        "id": "101230701",
                        "child": {}
                    },
                    {
                        "name": "长汀",
                        "id": "101230702",
                        "child": {}
                    },
                    {
                        "name": "连城",
                        "id": "101230703",
                        "child": {}
                    },
                    {
                        "name": "武平",
                        "id": "101230704",
                        "child": {}
                    },
                    {
                        "name": "上杭",
                        "id": "101230705",
                        "child": {}
                    },
                    {
                        "name": "永定",
                        "id": "101230706",
                        "child": {}
                    },
                    {
                        "name": "漳平",
                        "id": "101230707",
                        "child": {}
                    }
                ]
            },
            {
                "name": "三明",
                "id": "101230805",
                "child": [
                    {
                        "name": "三明",
                        "id": "101230801",
                        "child": {}
                    },
                    {
                        "name": "宁化",
                        "id": "101230802",
                        "child": {}
                    },
                    {
                        "name": "清流",
                        "id": "101230803",
                        "child": {}
                    },
                    {
                        "name": "泰宁",
                        "id": "101230804",
                        "child": {}
                    },
                    {
                        "name": "将乐",
                        "id": "101230805",
                        "child": {}
                    },
                    {
                        "name": "建宁",
                        "id": "101230806",
                        "child": {}
                    },
                    {
                        "name": "明溪",
                        "id": "101230807",
                        "child": {}
                    },
                    {
                        "name": "沙县",
                        "id": "101230808",
                        "child": {}
                    },
                    {
                        "name": "尤溪",
                        "id": "101230809",
                        "child": {}
                    },
                    {
                        "name": "永安",
                        "id": "101230810",
                        "child": {}
                    },
                    {
                        "name": "大田",
                        "id": "101230811",
                        "child": {}
                    }
                ]
            },
            {
                "name": "南平",
                "id": "101230901",
                "child": [
                    {
                        "name": "南平",
                        "id": "101230901",
                        "child": {}
                    },
                    {
                        "name": "顺昌",
                        "id": "101230902",
                        "child": {}
                    },
                    {
                        "name": "光泽",
                        "id": "101230903",
                        "child": {}
                    },
                    {
                        "name": "邵武",
                        "id": "101230904",
                        "child": {}
                    },
                    {
                        "name": "武夷山",
                        "id": "101230905",
                        "child": {}
                    },
                    {
                        "name": "浦城",
                        "id": "101230906",
                        "child": {}
                    },
                    {
                        "name": "建阳",
                        "id": "101230907",
                        "child": {}
                    },
                    {
                        "name": "松溪",
                        "id": "101230908",
                        "child": {}
                    },
                    {
                        "name": "政和",
                        "id": "101230909",
                        "child": {}
                    },
                    {
                        "name": "建瓯",
                        "id": "101230910",
                        "child": {}
                    }
                ]
            },
            {
                "name": "钓鱼岛",
                "id": "101231001",
                "child": [
                    {
                        "name": "钓鱼岛",
                        "id": "101231001",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "江西": {
        "father": "",
        "id": "101240506",
        "name": "江西",
        "child": [
            {
                "name": "南昌",
                "id": "101240101",
                "child": [
                    {
                        "name": "南昌",
                        "id": "101240101",
                        "child": {}
                    },
                    {
                        "name": "新建",
                        "id": "101240102",
                        "child": {}
                    },
                    {
                        "name": "南昌县",
                        "id": "101240103",
                        "child": {}
                    },
                    {
                        "name": "安义",
                        "id": "101240104",
                        "child": {}
                    },
                    {
                        "name": "进贤",
                        "id": "101240105",
                        "child": {}
                    }
                ]
            },
            {
                "name": "九江",
                "id": "101240210",
                "child": [
                    {
                        "name": "九江",
                        "id": "101240201",
                        "child": {}
                    },
                    {
                        "name": "瑞昌",
                        "id": "101240202",
                        "child": {}
                    },
                    {
                        "name": "庐山",
                        "id": "101240203",
                        "child": {}
                    },
                    {
                        "name": "武宁",
                        "id": "101240204",
                        "child": {}
                    },
                    {
                        "name": "德安",
                        "id": "101240205",
                        "child": {}
                    },
                    {
                        "name": "永修",
                        "id": "101240206",
                        "child": {}
                    },
                    {
                        "name": "湖口",
                        "id": "101240207",
                        "child": {}
                    },
                    {
                        "name": "彭泽",
                        "id": "101240208",
                        "child": {}
                    },
                    {
                        "name": "星子",
                        "id": "101240209",
                        "child": {}
                    },
                    {
                        "name": "都昌",
                        "id": "101240210",
                        "child": {}
                    },
                    {
                        "name": "修水",
                        "id": "101240212",
                        "child": {}
                    }
                ]
            },
            {
                "name": "上饶",
                "id": "101240308",
                "child": [
                    {
                        "name": "上饶",
                        "id": "101240301",
                        "child": {}
                    },
                    {
                        "name": "鄱阳",
                        "id": "101240302",
                        "child": {}
                    },
                    {
                        "name": "婺源",
                        "id": "101240303",
                        "child": {}
                    },
                    {
                        "name": "余干",
                        "id": "101240305",
                        "child": {}
                    },
                    {
                        "name": "万年",
                        "id": "101240306",
                        "child": {}
                    },
                    {
                        "name": "德兴",
                        "id": "101240307",
                        "child": {}
                    },
                    {
                        "name": "上饶县",
                        "id": "101240308",
                        "child": {}
                    },
                    {
                        "name": "弋阳",
                        "id": "101240309",
                        "child": {}
                    },
                    {
                        "name": "横峰",
                        "id": "101240310",
                        "child": {}
                    },
                    {
                        "name": "铅山",
                        "id": "101240311",
                        "child": {}
                    },
                    {
                        "name": "玉山",
                        "id": "101240312",
                        "child": {}
                    },
                    {
                        "name": "广丰",
                        "id": "101240313",
                        "child": {}
                    }
                ]
            },
            {
                "name": "抚州",
                "id": "101240409",
                "child": [
                    {
                        "name": "抚州",
                        "id": "101240401",
                        "child": {}
                    },
                    {
                        "name": "广昌",
                        "id": "101240402",
                        "child": {}
                    },
                    {
                        "name": "乐安",
                        "id": "101240403",
                        "child": {}
                    },
                    {
                        "name": "崇仁",
                        "id": "101240404",
                        "child": {}
                    },
                    {
                        "name": "金溪",
                        "id": "101240405",
                        "child": {}
                    },
                    {
                        "name": "资溪",
                        "id": "101240406",
                        "child": {}
                    },
                    {
                        "name": "宜黄",
                        "id": "101240407",
                        "child": {}
                    },
                    {
                        "name": "南城",
                        "id": "101240408",
                        "child": {}
                    },
                    {
                        "name": "南丰",
                        "id": "101240409",
                        "child": {}
                    },
                    {
                        "name": "黎川",
                        "id": "101240410",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宜春",
                "id": "101240506",
                "child": [
                    {
                        "name": "宜春",
                        "id": "101240501",
                        "child": {}
                    },
                    {
                        "name": "铜鼓",
                        "id": "101240502",
                        "child": {}
                    },
                    {
                        "name": "宜丰",
                        "id": "101240503",
                        "child": {}
                    },
                    {
                        "name": "万载",
                        "id": "101240504",
                        "child": {}
                    },
                    {
                        "name": "上高",
                        "id": "101240505",
                        "child": {}
                    },
                    {
                        "name": "靖安",
                        "id": "101240506",
                        "child": {}
                    },
                    {
                        "name": "奉新",
                        "id": "101240507",
                        "child": {}
                    },
                    {
                        "name": "高安",
                        "id": "101240508",
                        "child": {}
                    },
                    {
                        "name": "樟树",
                        "id": "101240509",
                        "child": {}
                    },
                    {
                        "name": "丰城",
                        "id": "101240510",
                        "child": {}
                    }
                ]
            },
            {
                "name": "吉安",
                "id": "101240603",
                "child": [
                    {
                        "name": "吉安",
                        "id": "101240601",
                        "child": {}
                    },
                    {
                        "name": "吉水",
                        "id": "101240603",
                        "child": {}
                    },
                    {
                        "name": "新干",
                        "id": "101240604",
                        "child": {}
                    },
                    {
                        "name": "峡江",
                        "id": "101240605",
                        "child": {}
                    },
                    {
                        "name": "永丰",
                        "id": "101240606",
                        "child": {}
                    },
                    {
                        "name": "永新",
                        "id": "101240607",
                        "child": {}
                    },
                    {
                        "name": "井冈山",
                        "id": "101240608",
                        "child": {}
                    },
                    {
                        "name": "万安",
                        "id": "101240609",
                        "child": {}
                    },
                    {
                        "name": "遂川",
                        "id": "101240610",
                        "child": {}
                    },
                    {
                        "name": "泰和",
                        "id": "101240611",
                        "child": {}
                    },
                    {
                        "name": "安福",
                        "id": "101240612",
                        "child": {}
                    },
                    {
                        "name": "宁冈",
                        "id": "101240613",
                        "child": {}
                    }
                ]
            },
            {
                "name": "赣州",
                "id": "101240708",
                "child": [
                    {
                        "name": "赣州",
                        "id": "101240701",
                        "child": {}
                    },
                    {
                        "name": "崇义",
                        "id": "101240702",
                        "child": {}
                    },
                    {
                        "name": "上犹",
                        "id": "101240703",
                        "child": {}
                    },
                    {
                        "name": "南康",
                        "id": "101240704",
                        "child": {}
                    },
                    {
                        "name": "大余",
                        "id": "101240705",
                        "child": {}
                    },
                    {
                        "name": "信丰",
                        "id": "101240706",
                        "child": {}
                    },
                    {
                        "name": "宁都",
                        "id": "101240707",
                        "child": {}
                    },
                    {
                        "name": "石城",
                        "id": "101240708",
                        "child": {}
                    },
                    {
                        "name": "瑞金",
                        "id": "101240709",
                        "child": {}
                    },
                    {
                        "name": "于都",
                        "id": "101240710",
                        "child": {}
                    },
                    {
                        "name": "会昌",
                        "id": "101240711",
                        "child": {}
                    },
                    {
                        "name": "安远",
                        "id": "101240712",
                        "child": {}
                    },
                    {
                        "name": "全南",
                        "id": "101240713",
                        "child": {}
                    },
                    {
                        "name": "龙南",
                        "id": "101240714",
                        "child": {}
                    },
                    {
                        "name": "定南",
                        "id": "101240715",
                        "child": {}
                    },
                    {
                        "name": "寻乌",
                        "id": "101240716",
                        "child": {}
                    },
                    {
                        "name": "兴国",
                        "id": "101240717",
                        "child": {}
                    }
                ]
            },
            {
                "name": "景德镇",
                "id": "101240803",
                "child": [
                    {
                        "name": "景德镇",
                        "id": "101240801",
                        "child": {}
                    },
                    {
                        "name": "乐平",
                        "id": "101240802",
                        "child": {}
                    },
                    {
                        "name": "浮梁",
                        "id": "101240803",
                        "child": {}
                    }
                ]
            },
            {
                "name": "萍乡",
                "id": "101240902",
                "child": [
                    {
                        "name": "萍乡",
                        "id": "101240901",
                        "child": {}
                    },
                    {
                        "name": "莲花",
                        "id": "101240902",
                        "child": {}
                    },
                    {
                        "name": "上栗",
                        "id": "101240903",
                        "child": {}
                    },
                    {
                        "name": "安源",
                        "id": "101240904",
                        "child": {}
                    },
                    {
                        "name": "芦溪",
                        "id": "101240905",
                        "child": {}
                    },
                    {
                        "name": "湘东",
                        "id": "101240906",
                        "child": {}
                    }
                ]
            },
            {
                "name": "新余",
                "id": "101241001",
                "child": [
                    {
                        "name": "新余",
                        "id": "101241001",
                        "child": {}
                    },
                    {
                        "name": "分宜",
                        "id": "101241002",
                        "child": {}
                    }
                ]
            },
            {
                "name": "鹰潭",
                "id": "101241103",
                "child": [
                    {
                        "name": "鹰潭",
                        "id": "101241101",
                        "child": {}
                    },
                    {
                        "name": "余江",
                        "id": "101241102",
                        "child": {}
                    },
                    {
                        "name": "贵溪",
                        "id": "101241103",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "湖南": {
        "father": "",
        "id": "101250201",
        "name": "湖南",
        "child": [
            {
                "name": "长沙",
                "id": "101250104",
                "child": [
                    {
                        "name": "长沙",
                        "id": "101250101",
                        "child": {}
                    },
                    {
                        "name": "宁乡",
                        "id": "101250102",
                        "child": {}
                    },
                    {
                        "name": "浏阳",
                        "id": "101250103",
                        "child": {}
                    },
                    {
                        "name": "马坡岭",
                        "id": "101250104",
                        "child": {}
                    },
                    {
                        "name": "望城",
                        "id": "101250105",
                        "child": {}
                    }
                ]
            },
            {
                "name": "湘潭",
                "id": "101250201",
                "child": [
                    {
                        "name": "湘潭",
                        "id": "101250201",
                        "child": {}
                    },
                    {
                        "name": "韶山",
                        "id": "101250202",
                        "child": {}
                    },
                    {
                        "name": "湘乡",
                        "id": "101250203",
                        "child": {}
                    }
                ]
            },
            {
                "name": "株洲",
                "id": "101250303",
                "child": [
                    {
                        "name": "株洲",
                        "id": "101250301",
                        "child": {}
                    },
                    {
                        "name": "攸县",
                        "id": "101250302",
                        "child": {}
                    },
                    {
                        "name": "醴陵",
                        "id": "101250303",
                        "child": {}
                    },
                    {
                        "name": "茶陵",
                        "id": "101250305",
                        "child": {}
                    },
                    {
                        "name": "炎陵",
                        "id": "101250306",
                        "child": {}
                    }
                ]
            },
            {
                "name": "衡阳",
                "id": "101250402",
                "child": [
                    {
                        "name": "衡阳",
                        "id": "101250401",
                        "child": {}
                    },
                    {
                        "name": "衡山",
                        "id": "101250402",
                        "child": {}
                    },
                    {
                        "name": "衡东",
                        "id": "101250403",
                        "child": {}
                    },
                    {
                        "name": "祁东",
                        "id": "101250404",
                        "child": {}
                    },
                    {
                        "name": "衡阳县",
                        "id": "101250405",
                        "child": {}
                    },
                    {
                        "name": "常宁",
                        "id": "101250406",
                        "child": {}
                    },
                    {
                        "name": "衡南",
                        "id": "101250407",
                        "child": {}
                    },
                    {
                        "name": "耒阳",
                        "id": "101250408",
                        "child": {}
                    },
                    {
                        "name": "南岳",
                        "id": "101250409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "郴州",
                "id": "101250502",
                "child": [
                    {
                        "name": "郴州",
                        "id": "101250501",
                        "child": {}
                    },
                    {
                        "name": "桂阳",
                        "id": "101250502",
                        "child": {}
                    },
                    {
                        "name": "嘉禾",
                        "id": "101250503",
                        "child": {}
                    },
                    {
                        "name": "宜章",
                        "id": "101250504",
                        "child": {}
                    },
                    {
                        "name": "临武",
                        "id": "101250505",
                        "child": {}
                    },
                    {
                        "name": "资兴",
                        "id": "101250507",
                        "child": {}
                    },
                    {
                        "name": "汝城",
                        "id": "101250508",
                        "child": {}
                    },
                    {
                        "name": "安仁",
                        "id": "101250509",
                        "child": {}
                    },
                    {
                        "name": "永兴",
                        "id": "101250510",
                        "child": {}
                    },
                    {
                        "name": "桂东",
                        "id": "101250511",
                        "child": {}
                    },
                    {
                        "name": "苏仙",
                        "id": "101250512",
                        "child": {}
                    }
                ]
            },
            {
                "name": "常德",
                "id": "101250604",
                "child": [
                    {
                        "name": "常德",
                        "id": "101250601",
                        "child": {}
                    },
                    {
                        "name": "安乡",
                        "id": "101250602",
                        "child": {}
                    },
                    {
                        "name": "桃源",
                        "id": "101250603",
                        "child": {}
                    },
                    {
                        "name": "汉寿",
                        "id": "101250604",
                        "child": {}
                    },
                    {
                        "name": "澧县",
                        "id": "101250605",
                        "child": {}
                    },
                    {
                        "name": "临澧",
                        "id": "101250606",
                        "child": {}
                    },
                    {
                        "name": "石门",
                        "id": "101250607",
                        "child": {}
                    },
                    {
                        "name": "津市",
                        "id": "101250608",
                        "child": {}
                    }
                ]
            },
            {
                "name": "益阳",
                "id": "101250702",
                "child": [
                    {
                        "name": "益阳",
                        "id": "101250700",
                        "child": {}
                    },
                    {
                        "name": "赫山区",
                        "id": "101250701",
                        "child": {}
                    },
                    {
                        "name": "南县",
                        "id": "101250702",
                        "child": {}
                    },
                    {
                        "name": "桃江",
                        "id": "101250703",
                        "child": {}
                    },
                    {
                        "name": "安化",
                        "id": "101250704",
                        "child": {}
                    },
                    {
                        "name": "沅江",
                        "id": "101250705",
                        "child": {}
                    }
                ]
            },
            {
                "name": "娄底",
                "id": "101250806",
                "child": [
                    {
                        "name": "娄底",
                        "id": "101250801",
                        "child": {}
                    },
                    {
                        "name": "双峰",
                        "id": "101250802",
                        "child": {}
                    },
                    {
                        "name": "冷水江",
                        "id": "101250803",
                        "child": {}
                    },
                    {
                        "name": "新化",
                        "id": "101250805",
                        "child": {}
                    },
                    {
                        "name": "涟源",
                        "id": "101250806",
                        "child": {}
                    }
                ]
            },
            {
                "name": "邵阳",
                "id": "101250905",
                "child": [
                    {
                        "name": "邵阳",
                        "id": "101250901",
                        "child": {}
                    },
                    {
                        "name": "隆回",
                        "id": "101250902",
                        "child": {}
                    },
                    {
                        "name": "洞口",
                        "id": "101250903",
                        "child": {}
                    },
                    {
                        "name": "新邵",
                        "id": "101250904",
                        "child": {}
                    },
                    {
                        "name": "邵东",
                        "id": "101250905",
                        "child": {}
                    },
                    {
                        "name": "绥宁",
                        "id": "101250906",
                        "child": {}
                    },
                    {
                        "name": "新宁",
                        "id": "101250907",
                        "child": {}
                    },
                    {
                        "name": "武冈",
                        "id": "101250908",
                        "child": {}
                    },
                    {
                        "name": "城步",
                        "id": "101250909",
                        "child": {}
                    },
                    {
                        "name": "邵阳县",
                        "id": "101250910",
                        "child": {}
                    }
                ]
            },
            {
                "name": "岳阳",
                "id": "101251001",
                "child": [
                    {
                        "name": "岳阳",
                        "id": "101251001",
                        "child": {}
                    },
                    {
                        "name": "华容",
                        "id": "101251002",
                        "child": {}
                    },
                    {
                        "name": "湘阴",
                        "id": "101251003",
                        "child": {}
                    },
                    {
                        "name": "汨罗",
                        "id": "101251004",
                        "child": {}
                    },
                    {
                        "name": "平江",
                        "id": "101251005",
                        "child": {}
                    },
                    {
                        "name": "临湘",
                        "id": "101251006",
                        "child": {}
                    }
                ]
            },
            {
                "name": "张家界",
                "id": "101251102",
                "child": [
                    {
                        "name": "张家界",
                        "id": "101251101",
                        "child": {}
                    },
                    {
                        "name": "桑植",
                        "id": "101251102",
                        "child": {}
                    },
                    {
                        "name": "慈利",
                        "id": "101251103",
                        "child": {}
                    },
                    {
                        "name": "武陵源",
                        "id": "101251104",
                        "child": {}
                    }
                ]
            },
            {
                "name": "怀化",
                "id": "101251210",
                "child": [
                    {
                        "name": "怀化",
                        "id": "101251201",
                        "child": {}
                    },
                    {
                        "name": "沅陵",
                        "id": "101251203",
                        "child": {}
                    },
                    {
                        "name": "辰溪",
                        "id": "101251204",
                        "child": {}
                    },
                    {
                        "name": "靖州",
                        "id": "101251205",
                        "child": {}
                    },
                    {
                        "name": "会同",
                        "id": "101251206",
                        "child": {}
                    },
                    {
                        "name": "通道",
                        "id": "101251207",
                        "child": {}
                    },
                    {
                        "name": "麻阳",
                        "id": "101251208",
                        "child": {}
                    },
                    {
                        "name": "新晃",
                        "id": "101251209",
                        "child": {}
                    },
                    {
                        "name": "芷江",
                        "id": "101251210",
                        "child": {}
                    },
                    {
                        "name": "溆浦",
                        "id": "101251211",
                        "child": {}
                    },
                    {
                        "name": "中方",
                        "id": "101251212",
                        "child": {}
                    },
                    {
                        "name": "洪江",
                        "id": "101251213",
                        "child": {}
                    }
                ]
            },
            {
                "name": "永州",
                "id": "101251404",
                "child": [
                    {
                        "name": "永州",
                        "id": "101251401",
                        "child": {}
                    },
                    {
                        "name": "祁阳",
                        "id": "101251402",
                        "child": {}
                    },
                    {
                        "name": "东安",
                        "id": "101251403",
                        "child": {}
                    },
                    {
                        "name": "双牌",
                        "id": "101251404",
                        "child": {}
                    },
                    {
                        "name": "道县",
                        "id": "101251405",
                        "child": {}
                    },
                    {
                        "name": "宁远",
                        "id": "101251406",
                        "child": {}
                    },
                    {
                        "name": "江永",
                        "id": "101251407",
                        "child": {}
                    },
                    {
                        "name": "蓝山",
                        "id": "101251408",
                        "child": {}
                    },
                    {
                        "name": "新田",
                        "id": "101251409",
                        "child": {}
                    },
                    {
                        "name": "江华",
                        "id": "101251410",
                        "child": {}
                    },
                    {
                        "name": "冷水滩",
                        "id": "101251411",
                        "child": {}
                    }
                ]
            },
            {
                "name": "吉首",
                "id": "101251503",
                "child": [
                    {
                        "name": "吉首",
                        "id": "101251501",
                        "child": {}
                    },
                    {
                        "name": "保靖",
                        "id": "101251502",
                        "child": {}
                    },
                    {
                        "name": "永顺",
                        "id": "101251503",
                        "child": {}
                    },
                    {
                        "name": "古丈",
                        "id": "101251504",
                        "child": {}
                    },
                    {
                        "name": "凤凰",
                        "id": "101251505",
                        "child": {}
                    },
                    {
                        "name": "泸溪",
                        "id": "101251506",
                        "child": {}
                    },
                    {
                        "name": "龙山",
                        "id": "101251507",
                        "child": {}
                    },
                    {
                        "name": "花垣",
                        "id": "101251508",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "贵州": {
        "father": "",
        "id": "101260402",
        "name": "贵州",
        "child": [
            {
                "name": "贵阳",
                "id": "101260103",
                "child": [
                    {
                        "name": "贵阳",
                        "id": "101260101",
                        "child": {}
                    },
                    {
                        "name": "白云",
                        "id": "101260102",
                        "child": {}
                    },
                    {
                        "name": "花溪",
                        "id": "101260103",
                        "child": {}
                    },
                    {
                        "name": "乌当",
                        "id": "101260104",
                        "child": {}
                    },
                    {
                        "name": "息烽",
                        "id": "101260105",
                        "child": {}
                    },
                    {
                        "name": "开阳",
                        "id": "101260106",
                        "child": {}
                    },
                    {
                        "name": "修文",
                        "id": "101260107",
                        "child": {}
                    },
                    {
                        "name": "清镇",
                        "id": "101260108",
                        "child": {}
                    },
                    {
                        "name": "小河",
                        "id": "101260109",
                        "child": {}
                    },
                    {
                        "name": "云岩",
                        "id": "101260110",
                        "child": {}
                    },
                    {
                        "name": "南明",
                        "id": "101260111",
                        "child": {}
                    }
                ]
            },
            {
                "name": "遵义",
                "id": "101260202",
                "child": [
                    {
                        "name": "遵义",
                        "id": "101260201",
                        "child": {}
                    },
                    {
                        "name": "遵义县",
                        "id": "101260202",
                        "child": {}
                    },
                    {
                        "name": "仁怀",
                        "id": "101260203",
                        "child": {}
                    },
                    {
                        "name": "绥阳",
                        "id": "101260204",
                        "child": {}
                    },
                    {
                        "name": "湄潭",
                        "id": "101260205",
                        "child": {}
                    },
                    {
                        "name": "凤冈",
                        "id": "101260206",
                        "child": {}
                    },
                    {
                        "name": "桐梓",
                        "id": "101260207",
                        "child": {}
                    },
                    {
                        "name": "赤水",
                        "id": "101260208",
                        "child": {}
                    },
                    {
                        "name": "习水",
                        "id": "101260209",
                        "child": {}
                    },
                    {
                        "name": "道真",
                        "id": "101260210",
                        "child": {}
                    },
                    {
                        "name": "正安",
                        "id": "101260211",
                        "child": {}
                    },
                    {
                        "name": "务川",
                        "id": "101260212",
                        "child": {}
                    },
                    {
                        "name": "余庆",
                        "id": "101260213",
                        "child": {}
                    },
                    {
                        "name": "汇川",
                        "id": "101260214",
                        "child": {}
                    },
                    {
                        "name": "红花岗",
                        "id": "101260215",
                        "child": {}
                    }
                ]
            },
            {
                "name": "安顺",
                "id": "101260305",
                "child": [
                    {
                        "name": "安顺",
                        "id": "101260301",
                        "child": {}
                    },
                    {
                        "name": "普定",
                        "id": "101260302",
                        "child": {}
                    },
                    {
                        "name": "镇宁",
                        "id": "101260303",
                        "child": {}
                    },
                    {
                        "name": "平坝",
                        "id": "101260304",
                        "child": {}
                    },
                    {
                        "name": "紫云",
                        "id": "101260305",
                        "child": {}
                    },
                    {
                        "name": "关岭",
                        "id": "101260306",
                        "child": {}
                    }
                ]
            },
            {
                "name": "都匀",
                "id": "101260402",
                "child": [
                    {
                        "name": "都匀",
                        "id": "101260401",
                        "child": {}
                    },
                    {
                        "name": "贵定",
                        "id": "101260402",
                        "child": {}
                    },
                    {
                        "name": "瓮安",
                        "id": "101260403",
                        "child": {}
                    },
                    {
                        "name": "长顺",
                        "id": "101260404",
                        "child": {}
                    },
                    {
                        "name": "福泉",
                        "id": "101260405",
                        "child": {}
                    },
                    {
                        "name": "惠水",
                        "id": "101260406",
                        "child": {}
                    },
                    {
                        "name": "龙里",
                        "id": "101260407",
                        "child": {}
                    },
                    {
                        "name": "罗甸",
                        "id": "101260408",
                        "child": {}
                    },
                    {
                        "name": "平塘",
                        "id": "101260409",
                        "child": {}
                    },
                    {
                        "name": "独山",
                        "id": "101260410",
                        "child": {}
                    },
                    {
                        "name": "三都",
                        "id": "101260411",
                        "child": {}
                    },
                    {
                        "name": "荔波",
                        "id": "101260412",
                        "child": {}
                    }
                ]
            },
            {
                "name": "凯里",
                "id": "101260504",
                "child": [
                    {
                        "name": "凯里",
                        "id": "101260501",
                        "child": {}
                    },
                    {
                        "name": "岑巩",
                        "id": "101260502",
                        "child": {}
                    },
                    {
                        "name": "施秉",
                        "id": "101260503",
                        "child": {}
                    },
                    {
                        "name": "镇远",
                        "id": "101260504",
                        "child": {}
                    },
                    {
                        "name": "黄平",
                        "id": "101260505",
                        "child": {}
                    },
                    {
                        "name": "麻江",
                        "id": "101260507",
                        "child": {}
                    },
                    {
                        "name": "丹寨",
                        "id": "101260508",
                        "child": {}
                    },
                    {
                        "name": "三穗",
                        "id": "101260509",
                        "child": {}
                    },
                    {
                        "name": "台江",
                        "id": "101260510",
                        "child": {}
                    },
                    {
                        "name": "剑河",
                        "id": "101260511",
                        "child": {}
                    },
                    {
                        "name": "雷山",
                        "id": "101260512",
                        "child": {}
                    },
                    {
                        "name": "黎平",
                        "id": "101260513",
                        "child": {}
                    },
                    {
                        "name": "天柱",
                        "id": "101260514",
                        "child": {}
                    },
                    {
                        "name": "锦屏",
                        "id": "101260515",
                        "child": {}
                    },
                    {
                        "name": "榕江",
                        "id": "101260516",
                        "child": {}
                    },
                    {
                        "name": "从江",
                        "id": "101260517",
                        "child": {}
                    }
                ]
            },
            {
                "name": "铜仁",
                "id": "101260610",
                "child": [
                    {
                        "name": "铜仁",
                        "id": "101260601",
                        "child": {}
                    },
                    {
                        "name": "江口",
                        "id": "101260602",
                        "child": {}
                    },
                    {
                        "name": "玉屏",
                        "id": "101260603",
                        "child": {}
                    },
                    {
                        "name": "万山",
                        "id": "101260604",
                        "child": {}
                    },
                    {
                        "name": "思南",
                        "id": "101260605",
                        "child": {}
                    },
                    {
                        "name": "印江",
                        "id": "101260607",
                        "child": {}
                    },
                    {
                        "name": "石阡",
                        "id": "101260608",
                        "child": {}
                    },
                    {
                        "name": "沿河",
                        "id": "101260609",
                        "child": {}
                    },
                    {
                        "name": "德江",
                        "id": "101260610",
                        "child": {}
                    },
                    {
                        "name": "松桃",
                        "id": "101260611",
                        "child": {}
                    }
                ]
            },
            {
                "name": "毕节",
                "id": "101260706",
                "child": [
                    {
                        "name": "毕节",
                        "id": "101260701",
                        "child": {}
                    },
                    {
                        "name": "赫章",
                        "id": "101260702",
                        "child": {}
                    },
                    {
                        "name": "金沙",
                        "id": "101260703",
                        "child": {}
                    },
                    {
                        "name": "威宁",
                        "id": "101260704",
                        "child": {}
                    },
                    {
                        "name": "大方",
                        "id": "101260705",
                        "child": {}
                    },
                    {
                        "name": "纳雍",
                        "id": "101260706",
                        "child": {}
                    },
                    {
                        "name": "织金",
                        "id": "101260707",
                        "child": {}
                    },
                    {
                        "name": "黔西",
                        "id": "101260708",
                        "child": {}
                    }
                ]
            },
            {
                "name": "水城",
                "id": "101260804",
                "child": [
                    {
                        "name": "水城",
                        "id": "101260801",
                        "child": {}
                    },
                    {
                        "name": "六枝",
                        "id": "101260802",
                        "child": {}
                    },
                    {
                        "name": "盘县",
                        "id": "101260804",
                        "child": {}
                    }
                ]
            },
            {
                "name": "兴义",
                "id": "101260909",
                "child": [
                    {
                        "name": "兴义",
                        "id": "101260901",
                        "child": {}
                    },
                    {
                        "name": "晴隆",
                        "id": "101260902",
                        "child": {}
                    },
                    {
                        "name": "兴仁",
                        "id": "101260903",
                        "child": {}
                    },
                    {
                        "name": "贞丰",
                        "id": "101260904",
                        "child": {}
                    },
                    {
                        "name": "望谟",
                        "id": "101260905",
                        "child": {}
                    },
                    {
                        "name": "安龙",
                        "id": "101260907",
                        "child": {}
                    },
                    {
                        "name": "册亨",
                        "id": "101260908",
                        "child": {}
                    },
                    {
                        "name": "普安",
                        "id": "101260909",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "四川": {
        "father": "",
        "id": "101270903",
        "name": "四川",
        "child": [
            {
                "name": "成都",
                "id": "101270105",
                "child": [
                    {
                        "name": "成都",
                        "id": "101270101",
                        "child": {}
                    },
                    {
                        "name": "龙泉驿",
                        "id": "101270102",
                        "child": {}
                    },
                    {
                        "name": "新都",
                        "id": "101270103",
                        "child": {}
                    },
                    {
                        "name": "温江",
                        "id": "101270104",
                        "child": {}
                    },
                    {
                        "name": "金堂",
                        "id": "101270105",
                        "child": {}
                    },
                    {
                        "name": "双流",
                        "id": "101270106",
                        "child": {}
                    },
                    {
                        "name": "郫县",
                        "id": "101270107",
                        "child": {}
                    },
                    {
                        "name": "大邑",
                        "id": "101270108",
                        "child": {}
                    },
                    {
                        "name": "蒲江",
                        "id": "101270109",
                        "child": {}
                    },
                    {
                        "name": "新津",
                        "id": "101270110",
                        "child": {}
                    },
                    {
                        "name": "都江堰",
                        "id": "101270111",
                        "child": {}
                    },
                    {
                        "name": "彭州",
                        "id": "101270112",
                        "child": {}
                    },
                    {
                        "name": "邛崃",
                        "id": "101270113",
                        "child": {}
                    },
                    {
                        "name": "崇州",
                        "id": "101270114",
                        "child": {}
                    }
                ]
            },
            {
                "name": "攀枝花",
                "id": "101270202",
                "child": [
                    {
                        "name": "攀枝花",
                        "id": "101270201",
                        "child": {}
                    },
                    {
                        "name": "仁和",
                        "id": "101270202",
                        "child": {}
                    },
                    {
                        "name": "米易",
                        "id": "101270203",
                        "child": {}
                    },
                    {
                        "name": "盐边",
                        "id": "101270204",
                        "child": {}
                    }
                ]
            },
            {
                "name": "自贡",
                "id": "101270301",
                "child": [
                    {
                        "name": "自贡",
                        "id": "101270301",
                        "child": {}
                    },
                    {
                        "name": "富顺",
                        "id": "101270302",
                        "child": {}
                    },
                    {
                        "name": "荣县",
                        "id": "101270303",
                        "child": {}
                    }
                ]
            },
            {
                "name": "绵阳",
                "id": "101270401",
                "child": [
                    {
                        "name": "绵阳",
                        "id": "101270401",
                        "child": {}
                    },
                    {
                        "name": "三台",
                        "id": "101270402",
                        "child": {}
                    },
                    {
                        "name": "盐亭",
                        "id": "101270403",
                        "child": {}
                    },
                    {
                        "name": "安县",
                        "id": "101270404",
                        "child": {}
                    },
                    {
                        "name": "梓潼",
                        "id": "101270405",
                        "child": {}
                    },
                    {
                        "name": "北川",
                        "id": "101270406",
                        "child": {}
                    },
                    {
                        "name": "平武",
                        "id": "101270407",
                        "child": {}
                    },
                    {
                        "name": "江油",
                        "id": "101270408",
                        "child": {}
                    }
                ]
            },
            {
                "name": "南充",
                "id": "101270501",
                "child": [
                    {
                        "name": "南充",
                        "id": "101270501",
                        "child": {}
                    },
                    {
                        "name": "南部",
                        "id": "101270502",
                        "child": {}
                    },
                    {
                        "name": "营山",
                        "id": "101270503",
                        "child": {}
                    },
                    {
                        "name": "蓬安",
                        "id": "101270504",
                        "child": {}
                    },
                    {
                        "name": "仪陇",
                        "id": "101270505",
                        "child": {}
                    },
                    {
                        "name": "西充",
                        "id": "101270506",
                        "child": {}
                    },
                    {
                        "name": "阆中",
                        "id": "101270507",
                        "child": {}
                    }
                ]
            },
            {
                "name": "达州",
                "id": "101270605",
                "child": [
                    {
                        "name": "达川",
                        "id": "101270601",
                        "child": {}
                    },
                    {
                        "name": "宣汉",
                        "id": "101270602",
                        "child": {}
                    },
                    {
                        "name": "开江",
                        "id": "101270603",
                        "child": {}
                    },
                    {
                        "name": "大竹",
                        "id": "101270604",
                        "child": {}
                    },
                    {
                        "name": "渠县",
                        "id": "101270605",
                        "child": {}
                    },
                    {
                        "name": "万源",
                        "id": "101270606",
                        "child": {}
                    },
                    {
                        "name": "达县",
                        "id": "101270608",
                        "child": {}
                    }
                ]
            },
            {
                "name": "遂宁",
                "id": "101270702",
                "child": [
                    {
                        "name": "遂宁",
                        "id": "101270701",
                        "child": {}
                    },
                    {
                        "name": "蓬溪",
                        "id": "101270702",
                        "child": {}
                    },
                    {
                        "name": "射洪",
                        "id": "101270703",
                        "child": {}
                    }
                ]
            },
            {
                "name": "广安",
                "id": "101270805",
                "child": [
                    {
                        "name": "广安",
                        "id": "101270801",
                        "child": {}
                    },
                    {
                        "name": "岳池",
                        "id": "101270802",
                        "child": {}
                    },
                    {
                        "name": "武胜",
                        "id": "101270803",
                        "child": {}
                    },
                    {
                        "name": "邻水",
                        "id": "101270804",
                        "child": {}
                    },
                    {
                        "name": "华蓥",
                        "id": "101270805",
                        "child": {}
                    }
                ]
            },
            {
                "name": "巴中",
                "id": "101270903",
                "child": [
                    {
                        "name": "巴中",
                        "id": "101270901",
                        "child": {}
                    },
                    {
                        "name": "通江",
                        "id": "101270902",
                        "child": {}
                    },
                    {
                        "name": "南江",
                        "id": "101270903",
                        "child": {}
                    },
                    {
                        "name": "平昌",
                        "id": "101270904",
                        "child": {}
                    }
                ]
            },
            {
                "name": "泸州",
                "id": "101271006",
                "child": [
                    {
                        "name": "泸州",
                        "id": "101271001",
                        "child": {}
                    },
                    {
                        "name": "泸县",
                        "id": "101271003",
                        "child": {}
                    },
                    {
                        "name": "合江",
                        "id": "101271004",
                        "child": {}
                    },
                    {
                        "name": "叙永",
                        "id": "101271005",
                        "child": {}
                    },
                    {
                        "name": "古蔺",
                        "id": "101271006",
                        "child": {}
                    },
                    {
                        "name": "纳溪",
                        "id": "101271007",
                        "child": {}
                    }
                ]
            },
            {
                "name": "宜宾",
                "id": "101271105",
                "child": [
                    {
                        "name": "宜宾",
                        "id": "101271101",
                        "child": {}
                    },
                    {
                        "name": "宜宾县",
                        "id": "101271103",
                        "child": {}
                    },
                    {
                        "name": "南溪",
                        "id": "101271104",
                        "child": {}
                    },
                    {
                        "name": "江安",
                        "id": "101271105",
                        "child": {}
                    },
                    {
                        "name": "长宁",
                        "id": "101271106",
                        "child": {}
                    },
                    {
                        "name": "高县",
                        "id": "101271107",
                        "child": {}
                    },
                    {
                        "name": "珙县",
                        "id": "101271108",
                        "child": {}
                    },
                    {
                        "name": "筠连",
                        "id": "101271109",
                        "child": {}
                    },
                    {
                        "name": "兴文",
                        "id": "101271110",
                        "child": {}
                    },
                    {
                        "name": "屏山",
                        "id": "101271111",
                        "child": {}
                    }
                ]
            },
            {
                "name": "内江",
                "id": "101271202",
                "child": [
                    {
                        "name": "内江",
                        "id": "101271201",
                        "child": {}
                    },
                    {
                        "name": "东兴",
                        "id": "101271202",
                        "child": {}
                    },
                    {
                        "name": "威远",
                        "id": "101271203",
                        "child": {}
                    },
                    {
                        "name": "资中",
                        "id": "101271204",
                        "child": {}
                    },
                    {
                        "name": "隆昌",
                        "id": "101271205",
                        "child": {}
                    }
                ]
            },
            {
                "name": "资阳",
                "id": "101271304",
                "child": [
                    {
                        "name": "资阳",
                        "id": "101271301",
                        "child": {}
                    },
                    {
                        "name": "安岳",
                        "id": "101271302",
                        "child": {}
                    },
                    {
                        "name": "乐至",
                        "id": "101271303",
                        "child": {}
                    },
                    {
                        "name": "简阳",
                        "id": "101271304",
                        "child": {}
                    }
                ]
            },
            {
                "name": "乐山",
                "id": "101271403",
                "child": [
                    {
                        "name": "乐山",
                        "id": "101271401",
                        "child": {}
                    },
                    {
                        "name": "犍为",
                        "id": "101271402",
                        "child": {}
                    },
                    {
                        "name": "井研",
                        "id": "101271403",
                        "child": {}
                    },
                    {
                        "name": "夹江",
                        "id": "101271404",
                        "child": {}
                    },
                    {
                        "name": "沐川",
                        "id": "101271405",
                        "child": {}
                    },
                    {
                        "name": "峨边",
                        "id": "101271406",
                        "child": {}
                    },
                    {
                        "name": "马边",
                        "id": "101271407",
                        "child": {}
                    },
                    {
                        "name": "峨眉",
                        "id": "101271408",
                        "child": {}
                    },
                    {
                        "name": "峨眉山",
                        "id": "101271409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "眉山",
                "id": "101271503",
                "child": [
                    {
                        "name": "眉山",
                        "id": "101271501",
                        "child": {}
                    },
                    {
                        "name": "仁寿",
                        "id": "101271502",
                        "child": {}
                    },
                    {
                        "name": "彭山",
                        "id": "101271503",
                        "child": {}
                    },
                    {
                        "name": "洪雅",
                        "id": "101271504",
                        "child": {}
                    },
                    {
                        "name": "丹棱",
                        "id": "101271505",
                        "child": {}
                    },
                    {
                        "name": "青神",
                        "id": "101271506",
                        "child": {}
                    }
                ]
            },
            {
                "name": "凉山",
                "id": "101271603",
                "child": [
                    {
                        "name": "凉山",
                        "id": "101271601",
                        "child": {}
                    },
                    {
                        "name": "木里",
                        "id": "101271603",
                        "child": {}
                    },
                    {
                        "name": "盐源",
                        "id": "101271604",
                        "child": {}
                    },
                    {
                        "name": "德昌",
                        "id": "101271605",
                        "child": {}
                    },
                    {
                        "name": "会理",
                        "id": "101271606",
                        "child": {}
                    },
                    {
                        "name": "会东",
                        "id": "101271607",
                        "child": {}
                    },
                    {
                        "name": "宁南",
                        "id": "101271608",
                        "child": {}
                    },
                    {
                        "name": "普格",
                        "id": "101271609",
                        "child": {}
                    },
                    {
                        "name": "西昌",
                        "id": "101271610",
                        "child": {}
                    },
                    {
                        "name": "金阳",
                        "id": "101271611",
                        "child": {}
                    },
                    {
                        "name": "昭觉",
                        "id": "101271612",
                        "child": {}
                    },
                    {
                        "name": "喜德",
                        "id": "101271613",
                        "child": {}
                    },
                    {
                        "name": "冕宁",
                        "id": "101271614",
                        "child": {}
                    },
                    {
                        "name": "越西",
                        "id": "101271615",
                        "child": {}
                    },
                    {
                        "name": "甘洛",
                        "id": "101271616",
                        "child": {}
                    },
                    {
                        "name": "雷波",
                        "id": "101271617",
                        "child": {}
                    },
                    {
                        "name": "美姑",
                        "id": "101271618",
                        "child": {}
                    },
                    {
                        "name": "布拖",
                        "id": "101271619",
                        "child": {}
                    }
                ]
            },
            {
                "name": "雅安",
                "id": "101271708",
                "child": [
                    {
                        "name": "雅安",
                        "id": "101271701",
                        "child": {}
                    },
                    {
                        "name": "名山",
                        "id": "101271702",
                        "child": {}
                    },
                    {
                        "name": "荥经",
                        "id": "101271703",
                        "child": {}
                    },
                    {
                        "name": "汉源",
                        "id": "101271704",
                        "child": {}
                    },
                    {
                        "name": "石棉",
                        "id": "101271705",
                        "child": {}
                    },
                    {
                        "name": "天全",
                        "id": "101271706",
                        "child": {}
                    },
                    {
                        "name": "芦山",
                        "id": "101271707",
                        "child": {}
                    },
                    {
                        "name": "宝兴",
                        "id": "101271708",
                        "child": {}
                    }
                ]
            },
            {
                "name": "甘孜",
                "id": "101271806",
                "child": [
                    {
                        "name": "甘孜",
                        "id": "101271801",
                        "child": {}
                    },
                    {
                        "name": "康定",
                        "id": "101271802",
                        "child": {}
                    },
                    {
                        "name": "泸定",
                        "id": "101271803",
                        "child": {}
                    },
                    {
                        "name": "丹巴",
                        "id": "101271804",
                        "child": {}
                    },
                    {
                        "name": "九龙",
                        "id": "101271805",
                        "child": {}
                    },
                    {
                        "name": "雅江",
                        "id": "101271806",
                        "child": {}
                    },
                    {
                        "name": "道孚",
                        "id": "101271807",
                        "child": {}
                    },
                    {
                        "name": "炉霍",
                        "id": "101271808",
                        "child": {}
                    },
                    {
                        "name": "新龙",
                        "id": "101271809",
                        "child": {}
                    },
                    {
                        "name": "德格",
                        "id": "101271810",
                        "child": {}
                    },
                    {
                        "name": "白玉",
                        "id": "101271811",
                        "child": {}
                    },
                    {
                        "name": "石渠",
                        "id": "101271812",
                        "child": {}
                    },
                    {
                        "name": "色达",
                        "id": "101271813",
                        "child": {}
                    },
                    {
                        "name": "理塘",
                        "id": "101271814",
                        "child": {}
                    },
                    {
                        "name": "巴塘",
                        "id": "101271815",
                        "child": {}
                    },
                    {
                        "name": "乡城",
                        "id": "101271816",
                        "child": {}
                    },
                    {
                        "name": "稻城",
                        "id": "101271817",
                        "child": {}
                    },
                    {
                        "name": "得荣",
                        "id": "101271818",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阿坝",
                "id": "101271908",
                "child": [
                    {
                        "name": "阿坝",
                        "id": "101271901",
                        "child": {}
                    },
                    {
                        "name": "汶川",
                        "id": "101271902",
                        "child": {}
                    },
                    {
                        "name": "理县",
                        "id": "101271903",
                        "child": {}
                    },
                    {
                        "name": "茂县",
                        "id": "101271904",
                        "child": {}
                    },
                    {
                        "name": "松潘",
                        "id": "101271905",
                        "child": {}
                    },
                    {
                        "name": "九寨沟",
                        "id": "101271906",
                        "child": {}
                    },
                    {
                        "name": "金川",
                        "id": "101271907",
                        "child": {}
                    },
                    {
                        "name": "小金",
                        "id": "101271908",
                        "child": {}
                    },
                    {
                        "name": "黑水",
                        "id": "101271909",
                        "child": {}
                    },
                    {
                        "name": "马尔康",
                        "id": "101271910",
                        "child": {}
                    },
                    {
                        "name": "壤塘",
                        "id": "101271911",
                        "child": {}
                    },
                    {
                        "name": "若尔盖",
                        "id": "101271912",
                        "child": {}
                    },
                    {
                        "name": "红原",
                        "id": "101271913",
                        "child": {}
                    }
                ]
            },
            {
                "name": "德阳",
                "id": "101272005",
                "child": [
                    {
                        "name": "德阳",
                        "id": "101272001",
                        "child": {}
                    },
                    {
                        "name": "中江",
                        "id": "101272002",
                        "child": {}
                    },
                    {
                        "name": "广汉",
                        "id": "101272003",
                        "child": {}
                    },
                    {
                        "name": "什邡",
                        "id": "101272004",
                        "child": {}
                    },
                    {
                        "name": "绵竹",
                        "id": "101272005",
                        "child": {}
                    },
                    {
                        "name": "罗江",
                        "id": "101272006",
                        "child": {}
                    }
                ]
            },
            {
                "name": "广元",
                "id": "101272101",
                "child": [
                    {
                        "name": "广元",
                        "id": "101272101",
                        "child": {}
                    },
                    {
                        "name": "旺苍",
                        "id": "101272102",
                        "child": {}
                    },
                    {
                        "name": "青川",
                        "id": "101272103",
                        "child": {}
                    },
                    {
                        "name": "剑阁",
                        "id": "101272104",
                        "child": {}
                    },
                    {
                        "name": "苍溪",
                        "id": "101272105",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "广东": {
        "father": "",
        "id": "101281701",
        "name": "广东",
        "child": [
            {
                "name": "广州",
                "id": "101280102",
                "child": [
                    {
                        "name": "广州",
                        "id": "101280101",
                        "child": {}
                    },
                    {
                        "name": "番禺",
                        "id": "101280102",
                        "child": {}
                    },
                    {
                        "name": "从化",
                        "id": "101280103",
                        "child": {}
                    },
                    {
                        "name": "增城",
                        "id": "101280104",
                        "child": {}
                    },
                    {
                        "name": "花都",
                        "id": "101280105",
                        "child": {}
                    }
                ]
            },
            {
                "name": "韶关",
                "id": "101280205",
                "child": [
                    {
                        "name": "韶关",
                        "id": "101280201",
                        "child": {}
                    },
                    {
                        "name": "乳源",
                        "id": "101280202",
                        "child": {}
                    },
                    {
                        "name": "始兴",
                        "id": "101280203",
                        "child": {}
                    },
                    {
                        "name": "翁源",
                        "id": "101280204",
                        "child": {}
                    },
                    {
                        "name": "乐昌",
                        "id": "101280205",
                        "child": {}
                    },
                    {
                        "name": "仁化",
                        "id": "101280206",
                        "child": {}
                    },
                    {
                        "name": "南雄",
                        "id": "101280207",
                        "child": {}
                    },
                    {
                        "name": "新丰",
                        "id": "101280208",
                        "child": {}
                    },
                    {
                        "name": "曲江",
                        "id": "101280209",
                        "child": {}
                    },
                    {
                        "name": "浈江",
                        "id": "101280210",
                        "child": {}
                    },
                    {
                        "name": "武江",
                        "id": "101280211",
                        "child": {}
                    }
                ]
            },
            {
                "name": "惠州",
                "id": "101280303",
                "child": [
                    {
                        "name": "惠州",
                        "id": "101280301",
                        "child": {}
                    },
                    {
                        "name": "博罗",
                        "id": "101280302",
                        "child": {}
                    },
                    {
                        "name": "惠阳",
                        "id": "101280303",
                        "child": {}
                    },
                    {
                        "name": "惠东",
                        "id": "101280304",
                        "child": {}
                    },
                    {
                        "name": "龙门",
                        "id": "101280305",
                        "child": {}
                    }
                ]
            },
            {
                "name": "梅州",
                "id": "101280402",
                "child": [
                    {
                        "name": "梅州",
                        "id": "101280401",
                        "child": {}
                    },
                    {
                        "name": "兴宁",
                        "id": "101280402",
                        "child": {}
                    },
                    {
                        "name": "蕉岭",
                        "id": "101280403",
                        "child": {}
                    },
                    {
                        "name": "大埔",
                        "id": "101280404",
                        "child": {}
                    },
                    {
                        "name": "丰顺",
                        "id": "101280406",
                        "child": {}
                    },
                    {
                        "name": "平远",
                        "id": "101280407",
                        "child": {}
                    },
                    {
                        "name": "五华",
                        "id": "101280408",
                        "child": {}
                    },
                    {
                        "name": "梅县",
                        "id": "101280409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "汕头",
                "id": "101280502",
                "child": [
                    {
                        "name": "汕头",
                        "id": "101280501",
                        "child": {}
                    },
                    {
                        "name": "潮阳",
                        "id": "101280502",
                        "child": {}
                    },
                    {
                        "name": "澄海",
                        "id": "101280503",
                        "child": {}
                    },
                    {
                        "name": "南澳",
                        "id": "101280504",
                        "child": {}
                    }
                ]
            },
            {
                "name": "深圳",
                "id": "101280601",
                "child": [
                    {
                        "name": "深圳",
                        "id": "101280601",
                        "child": {}
                    }
                ]
            },
            {
                "name": "珠海",
                "id": "101280703",
                "child": [
                    {
                        "name": "珠海",
                        "id": "101280701",
                        "child": {}
                    },
                    {
                        "name": "斗门",
                        "id": "101280702",
                        "child": {}
                    },
                    {
                        "name": "金湾",
                        "id": "101280703",
                        "child": {}
                    }
                ]
            },
            {
                "name": "佛山",
                "id": "101280803",
                "child": [
                    {
                        "name": "佛山",
                        "id": "101280800",
                        "child": {}
                    },
                    {
                        "name": "顺德",
                        "id": "101280801",
                        "child": {}
                    },
                    {
                        "name": "三水",
                        "id": "101280802",
                        "child": {}
                    },
                    {
                        "name": "南海",
                        "id": "101280803",
                        "child": {}
                    },
                    {
                        "name": "高明",
                        "id": "101280804",
                        "child": {}
                    }
                ]
            },
            {
                "name": "肇庆",
                "id": "101280907",
                "child": [
                    {
                        "name": "肇庆",
                        "id": "101280901",
                        "child": {}
                    },
                    {
                        "name": "广宁",
                        "id": "101280902",
                        "child": {}
                    },
                    {
                        "name": "四会",
                        "id": "101280903",
                        "child": {}
                    },
                    {
                        "name": "德庆",
                        "id": "101280905",
                        "child": {}
                    },
                    {
                        "name": "怀集",
                        "id": "101280906",
                        "child": {}
                    },
                    {
                        "name": "封开",
                        "id": "101280907",
                        "child": {}
                    },
                    {
                        "name": "高要",
                        "id": "101280908",
                        "child": {}
                    }
                ]
            },
            {
                "name": "湛江",
                "id": "101281008",
                "child": [
                    {
                        "name": "湛江",
                        "id": "101281001",
                        "child": {}
                    },
                    {
                        "name": "吴川",
                        "id": "101281002",
                        "child": {}
                    },
                    {
                        "name": "雷州",
                        "id": "101281003",
                        "child": {}
                    },
                    {
                        "name": "徐闻",
                        "id": "101281004",
                        "child": {}
                    },
                    {
                        "name": "廉江",
                        "id": "101281005",
                        "child": {}
                    },
                    {
                        "name": "赤坎",
                        "id": "101281006",
                        "child": {}
                    },
                    {
                        "name": "遂溪",
                        "id": "101281007",
                        "child": {}
                    },
                    {
                        "name": "坡头",
                        "id": "101281008",
                        "child": {}
                    },
                    {
                        "name": "霞山",
                        "id": "101281009",
                        "child": {}
                    },
                    {
                        "name": "麻章",
                        "id": "101281010",
                        "child": {}
                    }
                ]
            },
            {
                "name": "江门",
                "id": "101281103",
                "child": [
                    {
                        "name": "江门",
                        "id": "101281101",
                        "child": {}
                    },
                    {
                        "name": "开平",
                        "id": "101281103",
                        "child": {}
                    },
                    {
                        "name": "新会",
                        "id": "101281104",
                        "child": {}
                    },
                    {
                        "name": "恩平",
                        "id": "101281105",
                        "child": {}
                    },
                    {
                        "name": "台山",
                        "id": "101281106",
                        "child": {}
                    },
                    {
                        "name": "蓬江",
                        "id": "101281107",
                        "child": {}
                    },
                    {
                        "name": "鹤山",
                        "id": "101281108",
                        "child": {}
                    },
                    {
                        "name": "江海",
                        "id": "101281109",
                        "child": {}
                    }
                ]
            },
            {
                "name": "河源",
                "id": "101281201",
                "child": [
                    {
                        "name": "河源",
                        "id": "101281201",
                        "child": {}
                    },
                    {
                        "name": "紫金",
                        "id": "101281202",
                        "child": {}
                    },
                    {
                        "name": "连平",
                        "id": "101281203",
                        "child": {}
                    },
                    {
                        "name": "和平",
                        "id": "101281204",
                        "child": {}
                    },
                    {
                        "name": "龙川",
                        "id": "101281205",
                        "child": {}
                    },
                    {
                        "name": "东源",
                        "id": "101281206",
                        "child": {}
                    }
                ]
            },
            {
                "name": "清远",
                "id": "101281308",
                "child": [
                    {
                        "name": "清远",
                        "id": "101281301",
                        "child": {}
                    },
                    {
                        "name": "连南",
                        "id": "101281302",
                        "child": {}
                    },
                    {
                        "name": "连州",
                        "id": "101281303",
                        "child": {}
                    },
                    {
                        "name": "连山",
                        "id": "101281304",
                        "child": {}
                    },
                    {
                        "name": "阳山",
                        "id": "101281305",
                        "child": {}
                    },
                    {
                        "name": "佛冈",
                        "id": "101281306",
                        "child": {}
                    },
                    {
                        "name": "英德",
                        "id": "101281307",
                        "child": {}
                    },
                    {
                        "name": "清新",
                        "id": "101281308",
                        "child": {}
                    }
                ]
            },
            {
                "name": "云浮",
                "id": "101281406",
                "child": [
                    {
                        "name": "云浮",
                        "id": "101281401",
                        "child": {}
                    },
                    {
                        "name": "罗定",
                        "id": "101281402",
                        "child": {}
                    },
                    {
                        "name": "新兴",
                        "id": "101281403",
                        "child": {}
                    },
                    {
                        "name": "郁南",
                        "id": "101281404",
                        "child": {}
                    },
                    {
                        "name": "云安",
                        "id": "101281406",
                        "child": {}
                    }
                ]
            },
            {
                "name": "潮州",
                "id": "101281501",
                "child": [
                    {
                        "name": "潮州",
                        "id": "101281501",
                        "child": {}
                    },
                    {
                        "name": "饶平",
                        "id": "101281502",
                        "child": {}
                    },
                    {
                        "name": "潮安",
                        "id": "101281503",
                        "child": {}
                    }
                ]
            },
            {
                "name": "东莞",
                "id": "101281601",
                "child": [
                    {
                        "name": "东莞",
                        "id": "101281601",
                        "child": {}
                    }
                ]
            },
            {
                "name": "中山",
                "id": "101281701",
                "child": [
                    {
                        "name": "中山",
                        "id": "101281701",
                        "child": {}
                    }
                ]
            },
            {
                "name": "阳江",
                "id": "101281804",
                "child": [
                    {
                        "name": "阳江",
                        "id": "101281801",
                        "child": {}
                    },
                    {
                        "name": "阳春",
                        "id": "101281802",
                        "child": {}
                    },
                    {
                        "name": "阳东",
                        "id": "101281803",
                        "child": {}
                    },
                    {
                        "name": "阳西",
                        "id": "101281804",
                        "child": {}
                    }
                ]
            },
            {
                "name": "揭阳",
                "id": "101281904",
                "child": [
                    {
                        "name": "揭阳",
                        "id": "101281901",
                        "child": {}
                    },
                    {
                        "name": "揭西",
                        "id": "101281902",
                        "child": {}
                    },
                    {
                        "name": "普宁",
                        "id": "101281903",
                        "child": {}
                    },
                    {
                        "name": "惠来",
                        "id": "101281904",
                        "child": {}
                    },
                    {
                        "name": "揭东",
                        "id": "101281905",
                        "child": {}
                    }
                ]
            },
            {
                "name": "茂名",
                "id": "101282003",
                "child": [
                    {
                        "name": "茂名",
                        "id": "101282001",
                        "child": {}
                    },
                    {
                        "name": "高州",
                        "id": "101282002",
                        "child": {}
                    },
                    {
                        "name": "化州",
                        "id": "101282003",
                        "child": {}
                    },
                    {
                        "name": "电白",
                        "id": "101282004",
                        "child": {}
                    },
                    {
                        "name": "信宜",
                        "id": "101282005",
                        "child": {}
                    },
                    {
                        "name": "茂港",
                        "id": "101282006",
                        "child": {}
                    }
                ]
            },
            {
                "name": "汕尾",
                "id": "101282102",
                "child": [
                    {
                        "name": "汕尾",
                        "id": "101282101",
                        "child": {}
                    },
                    {
                        "name": "海丰",
                        "id": "101282102",
                        "child": {}
                    },
                    {
                        "name": "陆丰",
                        "id": "101282103",
                        "child": {}
                    },
                    {
                        "name": "陆河",
                        "id": "101282104",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "云南": {
        "father": "",
        "id": "101290501",
        "name": "云南",
        "child": [
            {
                "name": "昆明",
                "id": "101290107",
                "child": [
                    {
                        "name": "昆明",
                        "id": "101290101",
                        "child": {}
                    },
                    {
                        "name": "东川",
                        "id": "101290103",
                        "child": {}
                    },
                    {
                        "name": "寻甸",
                        "id": "101290104",
                        "child": {}
                    },
                    {
                        "name": "晋宁",
                        "id": "101290105",
                        "child": {}
                    },
                    {
                        "name": "宜良",
                        "id": "101290106",
                        "child": {}
                    },
                    {
                        "name": "石林",
                        "id": "101290107",
                        "child": {}
                    },
                    {
                        "name": "呈贡",
                        "id": "101290108",
                        "child": {}
                    },
                    {
                        "name": "富民",
                        "id": "101290109",
                        "child": {}
                    },
                    {
                        "name": "嵩明",
                        "id": "101290110",
                        "child": {}
                    },
                    {
                        "name": "禄劝",
                        "id": "101290111",
                        "child": {}
                    },
                    {
                        "name": "安宁",
                        "id": "101290112",
                        "child": {}
                    },
                    {
                        "name": "太华山",
                        "id": "101290113",
                        "child": {}
                    }
                ]
            },
            {
                "name": "大理",
                "id": "101290202",
                "child": [
                    {
                        "name": "大理",
                        "id": "101290201",
                        "child": {}
                    },
                    {
                        "name": "云龙",
                        "id": "101290202",
                        "child": {}
                    },
                    {
                        "name": "漾濞",
                        "id": "101290203",
                        "child": {}
                    },
                    {
                        "name": "永平",
                        "id": "101290204",
                        "child": {}
                    },
                    {
                        "name": "宾川",
                        "id": "101290205",
                        "child": {}
                    },
                    {
                        "name": "弥渡",
                        "id": "101290206",
                        "child": {}
                    },
                    {
                        "name": "祥云",
                        "id": "101290207",
                        "child": {}
                    },
                    {
                        "name": "巍山",
                        "id": "101290208",
                        "child": {}
                    },
                    {
                        "name": "剑川",
                        "id": "101290209",
                        "child": {}
                    },
                    {
                        "name": "洱源",
                        "id": "101290210",
                        "child": {}
                    },
                    {
                        "name": "鹤庆",
                        "id": "101290211",
                        "child": {}
                    },
                    {
                        "name": "南涧",
                        "id": "101290212",
                        "child": {}
                    }
                ]
            },
            {
                "name": "红河",
                "id": "101290305",
                "child": [
                    {
                        "name": "红河",
                        "id": "101290301",
                        "child": {}
                    },
                    {
                        "name": "石屏",
                        "id": "101290302",
                        "child": {}
                    },
                    {
                        "name": "建水",
                        "id": "101290303",
                        "child": {}
                    },
                    {
                        "name": "弥勒",
                        "id": "101290304",
                        "child": {}
                    },
                    {
                        "name": "元阳",
                        "id": "101290305",
                        "child": {}
                    },
                    {
                        "name": "绿春",
                        "id": "101290306",
                        "child": {}
                    },
                    {
                        "name": "开远",
                        "id": "101290307",
                        "child": {}
                    },
                    {
                        "name": "个旧",
                        "id": "101290308",
                        "child": {}
                    },
                    {
                        "name": "蒙自",
                        "id": "101290309",
                        "child": {}
                    },
                    {
                        "name": "屏边",
                        "id": "101290310",
                        "child": {}
                    },
                    {
                        "name": "泸西",
                        "id": "101290311",
                        "child": {}
                    },
                    {
                        "name": "金平",
                        "id": "101290312",
                        "child": {}
                    }
                ]
            },
            {
                "name": "曲靖",
                "id": "101290405",
                "child": [
                    {
                        "name": "曲靖",
                        "id": "101290401",
                        "child": {}
                    },
                    {
                        "name": "沾益",
                        "id": "101290402",
                        "child": {}
                    },
                    {
                        "name": "陆良",
                        "id": "101290403",
                        "child": {}
                    },
                    {
                        "name": "富源",
                        "id": "101290404",
                        "child": {}
                    },
                    {
                        "name": "马龙",
                        "id": "101290405",
                        "child": {}
                    },
                    {
                        "name": "师宗",
                        "id": "101290406",
                        "child": {}
                    },
                    {
                        "name": "罗平",
                        "id": "101290407",
                        "child": {}
                    },
                    {
                        "name": "会泽",
                        "id": "101290408",
                        "child": {}
                    },
                    {
                        "name": "宣威",
                        "id": "101290409",
                        "child": {}
                    }
                ]
            },
            {
                "name": "保山",
                "id": "101290501",
                "child": [
                    {
                        "name": "保山",
                        "id": "101290501",
                        "child": {}
                    },
                    {
                        "name": "龙陵",
                        "id": "101290503",
                        "child": {}
                    },
                    {
                        "name": "施甸",
                        "id": "101290504",
                        "child": {}
                    },
                    {
                        "name": "昌宁",
                        "id": "101290505",
                        "child": {}
                    },
                    {
                        "name": "腾冲",
                        "id": "101290506",
                        "child": {}
                    }
                ]
            },
            {
                "name": "文山",
                "id": "101290604",
                "child": [
                    {
                        "name": "文山",
                        "id": "101290601",
                        "child": {}
                    },
                    {
                        "name": "西畴",
                        "id": "101290602",
                        "child": {}
                    },
                    {
                        "name": "马关",
                        "id": "101290603",
                        "child": {}
                    },
                    {
                        "name": "麻栗坡",
                        "id": "101290604",
                        "child": {}
                    },
                    {
                        "name": "砚山",
                        "id": "101290605",
                        "child": {}
                    },
                    {
                        "name": "丘北",
                        "id": "101290606",
                        "child": {}
                    },
                    {
                        "name": "广南",
                        "id": "101290607",
                        "child": {}
                    },
                    {
                        "name": "富宁",
                        "id": "101290608",
                        "child": {}
                    }
                ]
            },
            {
                "name": "玉溪",
                "id": "101290701",
                "child": [
                    {
                        "name": "玉溪",
                        "id": "101290701",
                        "child": {}
                    },
                    {
                        "name": "澄江",
                        "id": "101290702",
                        "child": {}
                    },
                    {
                        "name": "江川",
                        "id": "101290703",
                        "child": {}
                    },
                    {
                        "name": "通海",
                        "id": "101290704",
                        "child": {}
                    },
                    {
                        "name": "华宁",
                        "id": "101290705",
                        "child": {}
                    },
                    {
                        "name": "新平",
                        "id": "101290706",
                        "child": {}
                    },
                    {
                        "name": "易门",
                        "id": "101290707",
                        "child": {}
                    },
                    {
                        "name": "峨山",
                        "id": "101290708",
                        "child": {}
                    },
                    {
                        "name": "元江",
                        "id": "101290709",
                        "child": {}
                    }
                ]
            },
            {
                "name": "楚雄",
                "id": "101290809",
                "child": [
                    {
                        "name": "楚雄",
                        "id": "101290801",
                        "child": {}
                    },
                    {
                        "name": "大姚",
                        "id": "101290802",
                        "child": {}
                    },
                    {
                        "name": "元谋",
                        "id": "101290803",
                        "child": {}
                    },
                    {
                        "name": "姚安",
                        "id": "101290804",
                        "child": {}
                    },
                    {
                        "name": "牟定",
                        "id": "101290805",
                        "child": {}
                    },
                    {
                        "name": "南华",
                        "id": "101290806",
                        "child": {}
                    },
                    {
                        "name": "武定",
                        "id": "101290807",
                        "child": {}
                    },
                    {
                        "name": "禄丰",
                        "id": "101290808",
                        "child": {}
                    },
                    {
                        "name": "双柏",
                        "id": "101290809",
                        "child": {}
                    },
                    {
                        "name": "永仁",
                        "id": "101290810",
                        "child": {}
                    }
                ]
            },
            {
                "name": "普洱",
                "id": "101290901",
                "child": [
                    {
                        "name": "普洱",
                        "id": "101290901",
                        "child": {}
                    },
                    {
                        "name": "景谷",
                        "id": "101290902",
                        "child": {}
                    },
                    {
                        "name": "景东",
                        "id": "101290903",
                        "child": {}
                    },
                    {
                        "name": "澜沧",
                        "id": "101290904",
                        "child": {}
                    },
                    {
                        "name": "墨江",
                        "id": "101290906",
                        "child": {}
                    },
                    {
                        "name": "江城",
                        "id": "101290907",
                        "child": {}
                    },
                    {
                        "name": "孟连",
                        "id": "101290908",
                        "child": {}
                    },
                    {
                        "name": "西盟",
                        "id": "101290909",
                        "child": {}
                    },
                    {
                        "name": "镇沅",
                        "id": "101290911",
                        "child": {}
                    },
                    {
                        "name": "宁洱",
                        "id": "101290912",
                        "child": {}
                    }
                ]
            },
            {
                "name": "昭通",
                "id": "101291007",
                "child": [
                    {
                        "name": "昭通",
                        "id": "101291001",
                        "child": {}
                    },
                    {
                        "name": "鲁甸",
                        "id": "101291002",
                        "child": {}
                    },
                    {
                        "name": "彝良",
                        "id": "101291003",
                        "child": {}
                    },
                    {
                        "name": "镇雄",
                        "id": "101291004",
                        "child": {}
                    },
                    {
                        "name": "威信",
                        "id": "101291005",
                        "child": {}
                    },
                    {
                        "name": "巧家",
                        "id": "101291006",
                        "child": {}
                    },
                    {
                        "name": "绥江",
                        "id": "101291007",
                        "child": {}
                    },
                    {
                        "name": "永善",
                        "id": "101291008",
                        "child": {}
                    },
                    {
                        "name": "盐津",
                        "id": "101291009",
                        "child": {}
                    },
                    {
                        "name": "大关",
                        "id": "101291010",
                        "child": {}
                    },
                    {
                        "name": "水富",
                        "id": "101291011",
                        "child": {}
                    }
                ]
            },
            {
                "name": "临沧",
                "id": "101291106",
                "child": [
                    {
                        "name": "临沧",
                        "id": "101291101",
                        "child": {}
                    },
                    {
                        "name": "沧源",
                        "id": "101291102",
                        "child": {}
                    },
                    {
                        "name": "耿马",
                        "id": "101291103",
                        "child": {}
                    },
                    {
                        "name": "双江",
                        "id": "101291104",
                        "child": {}
                    },
                    {
                        "name": "凤庆",
                        "id": "101291105",
                        "child": {}
                    },
                    {
                        "name": "永德",
                        "id": "101291106",
                        "child": {}
                    },
                    {
                        "name": "云县",
                        "id": "101291107",
                        "child": {}
                    },
                    {
                        "name": "镇康",
                        "id": "101291108",
                        "child": {}
                    }
                ]
            },
            {
                "name": "怒江",
                "id": "101291206",
                "child": [
                    {
                        "name": "怒江",
                        "id": "101291201",
                        "child": {}
                    },
                    {
                        "name": "福贡",
                        "id": "101291203",
                        "child": {}
                    },
                    {
                        "name": "兰坪",
                        "id": "101291204",
                        "child": {}
                    },
                    {
                        "name": "泸水",
                        "id": "101291205",
                        "child": {}
                    },
                    {
                        "name": "六库",
                        "id": "101291206",
                        "child": {}
                    },
                    {
                        "name": "贡山",
                        "id": "101291207",
                        "child": {}
                    }
                ]
            },
            {
                "name": "香格里拉",
                "id": "101291302",
                "child": [
                    {
                        "name": "香格里拉",
                        "id": "101291301",
                        "child": {}
                    },
                    {
                        "name": "德钦",
                        "id": "101291302",
                        "child": {}
                    },
                    {
                        "name": "维西",
                        "id": "101291303",
                        "child": {}
                    },
                    {
                        "name": "中甸",
                        "id": "101291304",
                        "child": {}
                    }
                ]
            },
            {
                "name": "丽江",
                "id": "101291403",
                "child": [
                    {
                        "name": "丽江",
                        "id": "101291401",
                        "child": {}
                    },
                    {
                        "name": "永胜",
                        "id": "101291402",
                        "child": {}
                    },
                    {
                        "name": "华坪",
                        "id": "101291403",
                        "child": {}
                    },
                    {
                        "name": "宁蒗",
                        "id": "101291404",
                        "child": {}
                    }
                ]
            },
            {
                "name": "德宏",
                "id": "101291504",
                "child": [
                    {
                        "name": "德宏",
                        "id": "101291501",
                        "child": {}
                    },
                    {
                        "name": "陇川",
                        "id": "101291503",
                        "child": {}
                    },
                    {
                        "name": "盈江",
                        "id": "101291504",
                        "child": {}
                    },
                    {
                        "name": "瑞丽",
                        "id": "101291506",
                        "child": {}
                    },
                    {
                        "name": "梁河",
                        "id": "101291507",
                        "child": {}
                    },
                    {
                        "name": "潞西",
                        "id": "101291508",
                        "child": {}
                    }
                ]
            },
            {
                "name": "景洪",
                "id": "101291603",
                "child": [
                    {
                        "name": "景洪",
                        "id": "101291601",
                        "child": {}
                    },
                    {
                        "name": "勐海",
                        "id": "101291603",
                        "child": {}
                    },
                    {
                        "name": "勐腊",
                        "id": "101291605",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "广西": {
        "father": "",
        "id": "101301401",
        "name": "广西",
        "child": [
            {
                "name": "南宁",
                "id": "101300107",
                "child": [
                    {
                        "name": "南宁",
                        "id": "101300101",
                        "child": {}
                    },
                    {
                        "name": "邕宁",
                        "id": "101300103",
                        "child": {}
                    },
                    {
                        "name": "横县",
                        "id": "101300104",
                        "child": {}
                    },
                    {
                        "name": "隆安",
                        "id": "101300105",
                        "child": {}
                    },
                    {
                        "name": "马山",
                        "id": "101300106",
                        "child": {}
                    },
                    {
                        "name": "上林",
                        "id": "101300107",
                        "child": {}
                    },
                    {
                        "name": "武鸣",
                        "id": "101300108",
                        "child": {}
                    },
                    {
                        "name": "宾阳",
                        "id": "101300109",
                        "child": {}
                    }
                ]
            },
            {
                "name": "崇左",
                "id": "101300205",
                "child": [
                    {
                        "name": "崇左",
                        "id": "101300201",
                        "child": {}
                    },
                    {
                        "name": "天等",
                        "id": "101300202",
                        "child": {}
                    },
                    {
                        "name": "龙州",
                        "id": "101300203",
                        "child": {}
                    },
                    {
                        "name": "凭祥",
                        "id": "101300204",
                        "child": {}
                    },
                    {
                        "name": "大新",
                        "id": "101300205",
                        "child": {}
                    },
                    {
                        "name": "扶绥",
                        "id": "101300206",
                        "child": {}
                    },
                    {
                        "name": "宁明",
                        "id": "101300207",
                        "child": {}
                    }
                ]
            },
            {
                "name": "柳州",
                "id": "101300301",
                "child": [
                    {
                        "name": "柳州",
                        "id": "101300301",
                        "child": {}
                    },
                    {
                        "name": "柳城",
                        "id": "101300302",
                        "child": {}
                    },
                    {
                        "name": "鹿寨",
                        "id": "101300304",
                        "child": {}
                    },
                    {
                        "name": "柳江",
                        "id": "101300305",
                        "child": {}
                    },
                    {
                        "name": "融安",
                        "id": "101300306",
                        "child": {}
                    },
                    {
                        "name": "融水",
                        "id": "101300307",
                        "child": {}
                    },
                    {
                        "name": "三江",
                        "id": "101300308",
                        "child": {}
                    }
                ]
            },
            {
                "name": "来宾",
                "id": "101300404",
                "child": [
                    {
                        "name": "来宾",
                        "id": "101300401",
                        "child": {}
                    },
                    {
                        "name": "忻城",
                        "id": "101300402",
                        "child": {}
                    },
                    {
                        "name": "金秀",
                        "id": "101300403",
                        "child": {}
                    },
                    {
                        "name": "象州",
                        "id": "101300404",
                        "child": {}
                    },
                    {
                        "name": "武宣",
                        "id": "101300405",
                        "child": {}
                    },
                    {
                        "name": "合山",
                        "id": "101300406",
                        "child": {}
                    }
                ]
            },
            {
                "name": "桂林",
                "id": "101300509",
                "child": [
                    {
                        "name": "桂林",
                        "id": "101300501",
                        "child": {}
                    },
                    {
                        "name": "龙胜",
                        "id": "101300503",
                        "child": {}
                    },
                    {
                        "name": "永福",
                        "id": "101300504",
                        "child": {}
                    },
                    {
                        "name": "临桂",
                        "id": "101300505",
                        "child": {}
                    },
                    {
                        "name": "兴安",
                        "id": "101300506",
                        "child": {}
                    },
                    {
                        "name": "灵川",
                        "id": "101300507",
                        "child": {}
                    },
                    {
                        "name": "全州",
                        "id": "101300508",
                        "child": {}
                    },
                    {
                        "name": "灌阳",
                        "id": "101300509",
                        "child": {}
                    },
                    {
                        "name": "阳朔",
                        "id": "101300510",
                        "child": {}
                    },
                    {
                        "name": "恭城",
                        "id": "101300511",
                        "child": {}
                    },
                    {
                        "name": "平乐",
                        "id": "101300512",
                        "child": {}
                    },
                    {
                        "name": "荔浦",
                        "id": "101300513",
                        "child": {}
                    },
                    {
                        "name": "资源",
                        "id": "101300514",
                        "child": {}
                    }
                ]
            },
            {
                "name": "梧州",
                "id": "101300602",
                "child": [
                    {
                        "name": "梧州",
                        "id": "101300601",
                        "child": {}
                    },
                    {
                        "name": "藤县",
                        "id": "101300602",
                        "child": {}
                    },
                    {
                        "name": "苍梧",
                        "id": "101300604",
                        "child": {}
                    },
                    {
                        "name": "蒙山",
                        "id": "101300605",
                        "child": {}
                    },
                    {
                        "name": "岑溪",
                        "id": "101300606",
                        "child": {}
                    }
                ]
            },
            {
                "name": "贺州",
                "id": "101300703",
                "child": [
                    {
                        "name": "贺州",
                        "id": "101300701",
                        "child": {}
                    },
                    {
                        "name": "昭平",
                        "id": "101300702",
                        "child": {}
                    },
                    {
                        "name": "富川",
                        "id": "101300703",
                        "child": {}
                    },
                    {
                        "name": "钟山",
                        "id": "101300704",
                        "child": {}
                    }
                ]
            },
            {
                "name": "贵港",
                "id": "101300802",
                "child": [
                    {
                        "name": "贵港",
                        "id": "101300801",
                        "child": {}
                    },
                    {
                        "name": "桂平",
                        "id": "101300802",
                        "child": {}
                    },
                    {
                        "name": "平南",
                        "id": "101300803",
                        "child": {}
                    }
                ]
            },
            {
                "name": "玉林",
                "id": "101300904",
                "child": [
                    {
                        "name": "玉林",
                        "id": "101300901",
                        "child": {}
                    },
                    {
                        "name": "博白",
                        "id": "101300902",
                        "child": {}
                    },
                    {
                        "name": "北流",
                        "id": "101300903",
                        "child": {}
                    },
                    {
                        "name": "容县",
                        "id": "101300904",
                        "child": {}
                    },
                    {
                        "name": "陆川",
                        "id": "101300905",
                        "child": {}
                    },
                    {
                        "name": "兴业",
                        "id": "101300906",
                        "child": {}
                    }
                ]
            },
            {
                "name": "百色",
                "id": "101301010",
                "child": [
                    {
                        "name": "百色",
                        "id": "101301001",
                        "child": {}
                    },
                    {
                        "name": "那坡",
                        "id": "101301002",
                        "child": {}
                    },
                    {
                        "name": "田阳",
                        "id": "101301003",
                        "child": {}
                    },
                    {
                        "name": "德保",
                        "id": "101301004",
                        "child": {}
                    },
                    {
                        "name": "靖西",
                        "id": "101301005",
                        "child": {}
                    },
                    {
                        "name": "田东",
                        "id": "101301006",
                        "child": {}
                    },
                    {
                        "name": "平果",
                        "id": "101301007",
                        "child": {}
                    },
                    {
                        "name": "隆林",
                        "id": "101301008",
                        "child": {}
                    },
                    {
                        "name": "西林",
                        "id": "101301009",
                        "child": {}
                    },
                    {
                        "name": "乐业",
                        "id": "101301010",
                        "child": {}
                    },
                    {
                        "name": "凌云",
                        "id": "101301011",
                        "child": {}
                    },
                    {
                        "name": "田林",
                        "id": "101301012",
                        "child": {}
                    }
                ]
            },
            {
                "name": "钦州",
                "id": "101301102",
                "child": [
                    {
                        "name": "钦州",
                        "id": "101301101",
                        "child": {}
                    },
                    {
                        "name": "浦北",
                        "id": "101301102",
                        "child": {}
                    },
                    {
                        "name": "灵山",
                        "id": "101301103",
                        "child": {}
                    }
                ]
            },
            {
                "name": "河池",
                "id": "101301203",
                "child": [
                    {
                        "name": "河池",
                        "id": "101301201",
                        "child": {}
                    },
                    {
                        "name": "天峨",
                        "id": "101301202",
                        "child": {}
                    },
                    {
                        "name": "东兰",
                        "id": "101301203",
                        "child": {}
                    },
                    {
                        "name": "巴马",
                        "id": "101301204",
                        "child": {}
                    },
                    {
                        "name": "环江",
                        "id": "101301205",
                        "child": {}
                    },
                    {
                        "name": "罗城",
                        "id": "101301206",
                        "child": {}
                    },
                    {
                        "name": "宜州",
                        "id": "101301207",
                        "child": {}
                    },
                    {
                        "name": "凤山",
                        "id": "101301208",
                        "child": {}
                    },
                    {
                        "name": "南丹",
                        "id": "101301209",
                        "child": {}
                    },
                    {
                        "name": "都安",
                        "id": "101301210",
                        "child": {}
                    },
                    {
                        "name": "大化",
                        "id": "101301211",
                        "child": {}
                    }
                ]
            },
            {
                "name": "北海",
                "id": "101301303",
                "child": [
                    {
                        "name": "北海",
                        "id": "101301301",
                        "child": {}
                    },
                    {
                        "name": "合浦",
                        "id": "101301302",
                        "child": {}
                    },
                    {
                        "name": "涠洲岛",
                        "id": "101301303",
                        "child": {}
                    }
                ]
            },
            {
                "name": "防城港",
                "id": "101301401",
                "child": [
                    {
                        "name": "防城港",
                        "id": "101301401",
                        "child": {}
                    },
                    {
                        "name": "上思",
                        "id": "101301402",
                        "child": {}
                    },
                    {
                        "name": "防城",
                        "id": "101301405",
                        "child": {}
                    }
                ]
            }
        ]
    },
    "海南": {
        "father": "",
        "id": "101310101",
        "name": "海南",
        "child": [
            {
                "name": "海口",
                "id": "101310101",
                "child": [
                    {
                        "name": "海口",
                        "id": "101310101",
                        "child": {}
                    }
                ]
            },
            {
                "name": "三亚",
                "id": "101310206",
                "child": [
                    {
                        "name": "三亚",
                        "id": "101310201",
                        "child": {}
                    },
                    {
                        "name": "东方",
                        "id": "101310202",
                        "child": {}
                    },
                    {
                        "name": "临高",
                        "id": "101310203",
                        "child": {}
                    },
                    {
                        "name": "澄迈",
                        "id": "101310204",
                        "child": {}
                    },
                    {
                        "name": "儋州",
                        "id": "101310205",
                        "child": {}
                    },
                    {
                        "name": "昌江",
                        "id": "101310206",
                        "child": {}
                    },
                    {
                        "name": "白沙",
                        "id": "101310207",
                        "child": {}
                    },
                    {
                        "name": "琼中",
                        "id": "101310208",
                        "child": {}
                    },
                    {
                        "name": "定安",
                        "id": "101310209",
                        "child": {}
                    },
                    {
                        "name": "屯昌",
                        "id": "101310210",
                        "child": {}
                    },
                    {
                        "name": "琼海",
                        "id": "101310211",
                        "child": {}
                    },
                    {
                        "name": "文昌",
                        "id": "101310212",
                        "child": {}
                    },
                    {
                        "name": "保亭",
                        "id": "101310214",
                        "child": {}
                    },
                    {
                        "name": "万宁",
                        "id": "101310215",
                        "child": {}
                    },
                    {
                        "name": "陵水",
                        "id": "101310216",
                        "child": {}
                    },
                    {
                        "name": "西沙",
                        "id": "101310217",
                        "child": {}
                    },
                    {
                        "name": "南沙岛",
                        "id": "101310220",
                        "child": {}
                    },
                    {
                        "name": "乐东",
                        "id": "101310221",
                        "child": {}
                    },
                    {
                        "name": "五指山",
                        "id": "101310222",
                        "child": {}
                    },
                    {
                        "name": "中沙",
                        "id": "101310224",
                        "child": {}
                    }
                ]
            }
        ]
    }
}

module.exports = citys;